{"url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "text": "Like Douglas, the actress said that she never worked for CBS again. Almost two decades later, an executive at CBS contacted her about coming back to the network. It turned out that the executive wanted her to sign a book deal with Simon & Schuster, which is owned by CBS. (CBS said that Moonves has no recollection of making unwelcome advances toward the actress, and that he made no efforts to block future business between her and CBS.)\n\nThe actress thought that the consequences would be too great if she told CBS about the incident. “I never reported it,” she told me. “I just thought, Gee, there goes my career.” At an event not long afterward, she encountered a showrunner who has overseen multiple programs at CBS, and told her the story. The showrunner, who had also worked with Moonves, recalled that the actress was still hurt by the incident and told me that she was “not surprised” by the story. “I had already had to deal with misogynist bullying from him myself,” she told me.\n\n“Our research has proved that the chicken came not just before the egg but before anything else in the known universe.” Copy link to cartoon Copy link to cartoon Shop Shop\n\nTwo women told me that they rebuffed unwanted advances from Moonves in professional settings, and that they believed career opportunities disappeared as a result. Dinah Kirgo, who won an Emmy as a writer for “The Tracey Ullman Show,” first encountered Moonves in the early eighties, when he was the vice-president of development at Saul Ilson Productions, a partnership with Columbia Pictures Television. She and her sister and producing partner, Julie Kirgo, met with Moonves and others about a television deal. “We left the meeting very confident we had an over-all deal with Leslie,” Kirgo told me. The sisters told their agent to expect an offer from Moonves.\n\nInstead, shortly after Kirgo got home, Moonves called her directly. “He said, ‘That was a great meeting, now we have to go out to dinner,’ ” she recalled. Kirgo replied that she and Julie would be happy to have dinner with him. “He said, ‘No, just you and me.’ He said, ‘You’re very expensive, and I need to know you’re worth it,’ ” Kirgo told me. “I was sort of in shock and I said, ‘Well, Leslie, I don’t think your wife would appreciate us having that kind of dinner.’ ” Moonves coldly ended the conversation. (CBS said that Moonves has no recollection of the meeting or the phone call.)\n\nKirgo and her sister never heard from Moonves again. Afterward, Kirgo’s agents told her they had received reports that she had a reputation for being difficult to work with. Kirgo told me that she had never heard complaints before, and that she believed saying no to Moonves had hurt her career. “It’s very insidious, what he did,” she said.\n\nJulie Kirgo confirmed the details of her sister’s story and said that Dinah had told her about the call at the time. “It’s just kind of awful to feel that you have energy and talent and that’s being appreciated, and then suddenly to find out that that’s not where somebody’s interests lie at all. You feel betrayed,” she said. “It pisses me off to this day.”\n\nIn 1992, a former child star who asked to be identified only by her first name, Kimberly, was introduced to Moonves by a friend, who was a member of Moonves’s staff and told her that Moonves could help her get back into television. At a dinner meeting that the three attended, Moonves began by asking questions about Kimberly’s acting career. But when the friend went to the bathroom Moonves turned to Kimberly and said, in a perfunctory way, “Let’s go. Let’s just get a hotel room. Let’s just do this.” She was shocked. “I said, ‘What are you talking about?’ ” When she explained that she had a husband and a child, Moonves became angry and left. (The friend recalled making the introduction to Moonves, and said that her only motivation in doing so was to help Kimberly’s career. CBS said that Moonves has no memory or record of the meeting.)\n\n“The power differential was so great,” Kimberly told me. “I was really scared, because I thought I was burning some sort of a bridge that was going to be great for me.” As a child star, she said, “I’d been taught that powerful people can hurt you, they can ruin you, they can ruin your career.” She said that the turn from business meeting to sexual overture seemed to be well practiced. “It was set up to be that way,” she said. “I thought, Wow, is this the way the world works and I just don’t get it?”\n\nCBS is a multibillion-dollar corporation, with dozens of divisions, and Moonves is only indirectly involved with many of them. However, experts on sexual harassment told me that misconduct by a chief executive can reverberate across aspects of even the largest companies. “If you have a company with an abuser on the top, they typically surround themselves with people like them, who engage in similar behavior,” Debra Katz, a lawyer specializing in sexual harassment, told me. “It can put a set of enablers in place, who protect powerful people when they get challenged for misconduct, and who work to discredit and manage out women who come forward with allegations.”\n\nThirty current and former CBS employees described harassment, gender discrimination, or retaliation at the network. Many said that men accused of misconduct were promoted, even after the company was made aware of those allegations. Their stories match several that have already emerged in public reports. Earlier this year, Leslie Isaacs, a vice-president at Pop, the cable channel jointly operated by CBS and the film studio Lionsgate, filed a lawsuit alleging that CBS was aware of a hostile workplace at the channel. Her complaint described harassment and discrimination by male colleagues, including a vice-president who allegedly instructed female employees to “show your clients your tits.” Isaacs told me, “It wouldn’t be happening at Pop if it wasn’t covered up at CBS, and if CBS wasn’t complicit. They know, and it’s been tolerated.” (Isaacs has entered into a private mediation process with CBS. A Pop spokesperson said, “Pop engaged an independent investigator who conducted a complete investigation and found nothing to corroborate this alleged statement.” CBS said that it flatly denies any efforts to cover this up.)\n\nIn December, CBS confirmed that Brad Kern, the showrunner and executive producer of “NCIS: New Orleans,” had been the subject of sexual-harassment and gender-discrimination allegations. He had retained his position for more than a year after the company was made aware of the claims. (This season, Kern stepped down from his position as showrunner, but he remains a consulting producer. Last month, the company said that it was launching a new investigation—its third—into Kern’s behavior. CBS said that the allegations were investigated and resulted in disciplinary action but that the matter “merits further inquiry.”)\n\nOther allegations have centered on CBS News. Last summer, Erin Gee, who worked at CBS for more than fifteen years, filed a lawsuit alleging that an executive director at “CBS Evening News” urged her to have sex with a co-worker with whom she was having difficulties in order to “break the ice,” and that she was demoted after complaining about gender discrimination. In May, a magistrate judge in New York criticized CBS for failing to save e-mails from the time of Gee’s allegation. “I find the conduct of CBS here to be shocking,” the judge, Sarah Netburn, reportedly said during a hearing. “It is hard to draw any other conclusion than that they were trying to avoid producing and saving those e-mails.” (The network has since reached a settlement with Gee, and her attorney declined to comment. CBS said that “the matter has been resolved.”) In 2015, a CBS reporter, Kenneth Lombardi, alleged in a lawsuit that a CBS News supervisor texted him links to pornography, and that a senior producer had grabbed his crotch. Lombardi claimed that when he complained to a manager she replied, “Never bring up gender discrimination again!” (An attorney for Lombardi said that he was not at liberty to discuss the suit. CBS said that the matter has been resolved.)", "images": ["https://dwgyu36up6iuz.cloudfront.net/heru80fdn/image/upload/c_fill%2Cd_placeholder_image.jpg%2Cfl_progressive%2Cg_center%2Ch_360%2Cq_80%2Cw_480/v1532962438/thenewyorker_how-a-notorious-d-e-a-informant-busted-criminals.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-header-reverse.svg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/master/w_2560%2Cc_limit/180806_r32520_rd.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-reverse.svg", "https://media.newyorker.com/photos/5a202dae8989ed395dbb8178/4:3/w_480%2Cc_limit/DSF-Matt-Lauers-Firing-and-NBCs-Theater-of-Accountability.jpg", "https://www.newyorker.com/verso/static/the-new-yorker/assets/logo-inverted.svg", "https://media.newyorker.com/photos/5ad6062051fedf7258aa438c/1:1/w_270%2Cc_limit/undefined", "https://media.newyorker.com/photos/648ce6c1ef09d4a0e04c7c5b/4:3/w_480%2Cc_limit/undefined", "https://media.newyorker.com/cartoons/5b5b7c343e47e60bb379a34d/master/w_1600%2Cc_limit/180806_a22032.jpg", "https://media.newyorker.com/cartoons/5b5b7c3492497e4fd0017bb4/master/w_1600%2Cc_limit/180806_a21101_rd.jpg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c6938366779/master/w_1600%2Cc_limit/180806_a20641.jpg", "https://media.newyorker.com/cartoons/5b5b7c3487b14c693836677a/master/w_1600%2Cc_limit/180806_a21846.jpg", "https://media.newyorker.com/photos/590979628b51cf59fc423803/4:3/w_480%2Cc_limit/%25E2%2580%258BTalbot-FoxNewsAndTheRepercussionsOfSexualHarassment.jpg"], "top_img": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "keywords": [], "authors": ["Condé Nast", "Ronan Farrow"], "canonical_link": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "meta_data": {"msapplication-tap-highlight": "no", "viewport": "width=device-width, initial-scale=1", "referrer": "no-referrer-when-downgrade", "author": "Condé Nast", "copyright": "Copyright (c) Condé Nast 2023", "description": "Ronan Farrow reports: Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "id": "5b58962892497e4fd001741c", "keywords": "cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "news_keywords": "cbs,sexual harassment,television,#metoo,women,illeana douglas,actresses", "robots": "index, follow, max-image-preview:large", "content-type": "article", "parsely-post-id": "5b58962892497e4fd001741c", "parsely-metadata": "{\"description\":\"Ronan Farrow reports: Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.\",\"image-16-9\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1000,c_limit/180806_r32520_rd.jpg\",\"image-1-1\":\"https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/1:1/w_1000,c_limit/180806_r32520_rd.jpg\"}", "og": {"description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg", "site_name": "The New Yorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct", "type": "article", "url": "https://www.newyorker.com/magazine/2018/08/06/les-moonves-and-cbs-face-allegations-of-sexual-misconduct"}, "article": {"content_tier": "free", "opinion": "false", "section": "tags", "published_time": "2018-07-27T21:37:00.000Z", "modified_time": "2018-07-27T21:37:00.000Z", "author": "Ronan Farrow"}, "twitter": {"card": "summary_large_image", "creator": "@NewYorker", "description": "Six women accuse the C.E.O. of harassment and intimidation, and dozens more describe abuse at his company.", "domain": "https://www.newyorker.com", "image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/16:9/w_1280,c_limit/180806_r32520_rd.jpg?mbid=social_retweet", "site": "@NewYorker", "title": "Les Moonves and CBS Face Allegations of Sexual Misconduct"}, "pinterest": {"image": "https://media.newyorker.com/photos/5b5b36849246473a2ac794ab/2:3/w_1000,h_1500,c_limit/180806_r32520_rd.jpg"}, "fb": {"app_id": 1147169538698836, "pages": 9258148868}, "google-signin-client_id": "275906274807-b4eqbdqr511u9msdpj8mh0pf77fcciv7.apps.googleusercontent.com"}, "movies": [], "publish_date": 1533502800.0, "source": "https://www.newyorker.com", "summary": ""}