{"url": "https://en.wikipedia.org/wiki/Cobra_Kai", "text": "American martial arts comedy-drama television series\n\nCobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films created by Robert Mark Kamen.[2] The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. The series was released on YouTube Red / YouTube Premium for the first two seasons, before moving to Netflix starting with the third. The series stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence, respectively, from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989).\n\nThe first and second seasons launched on YouTube Red/Premium in May 2018 and April 2019. Netflix acquired the series in June 2020 after YouTube decided to stop producing scripted original programming. The third, fourth and fifth seasons were released in January 2021, December 2021, and September 2022, respectively. In January 2023, the series was renewed for a sixth and final season, although production was halted on May 2 due to the Writers Guild of America strike. The production is yet to begin.[3][4]\n\nCobra Kai re-examines the \"Miyagi-verse\" narrative from Johnny's point of view, beginning with his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel.[5] The series also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, Vanessa Rubio and Dallas Dupree Young, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films. The series takes place between 2017 and 2019.[6][7]\n\nCobra Kai has attained high viewership on both YouTube and Netflix, and has received critical acclaim for its writing, performances, action sequences, humor, character development, and faithfulness to the previous films. It has received numerous awards and nominations, with the third season being nominated for Outstanding Comedy Series at the 73rd Primetime Emmy Awards.\n\nSummary [ edit ]\n\nSeason 1 [ edit ]\n\nThirty-four years after being defeated by Daniel LaRusso in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, suffers from alcoholism and depression. He works as a part-time handyman, and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that he had been accustomed to growing up. He has an estranged son named Robby from a previous relationship, whom he has abandoned. In contrast, Daniel is now the owner of a highly successful car dealership chain, and is married to co-owner Amanda with whom he has two children: Samantha and Anthony. Daniel is finally living the wealthy lifestyle he envied as a kid when he and his mother Lucille lived in Reseda. However, after his friend and mentor Mr. Miyagi died, Daniel's struggle to meaningfully connect with his children has disrupted the balance in his life.\n\nAfter using karate to defend his teenage neighbor Miguel Diaz from a group of thugs, Johnny agrees to teach Miguel karate and re-opens the Cobra Kai karate dojo as a chance to recapture his past. The revived Cobra Kai attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage. Johnny develops a bond with Miguel in a manner that resembles the relationship between Daniel and Mr. Miyagi, while Miguel goes on to date Samantha. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries to infuse it with more honor than Kreese did. On the other hand, the reopening of Cobra Kai revives Johnny's rivalry with Daniel, who vows to bring down the dojo. Daniel begins training Robby in the ways of Miyagi-Do, while Robby begins a rivalry with Miguel. The rivalries culminate at the 2018 All-Valley Karate Tournament, which Miguel manages to win through underhanded tactics, causing Johnny to realize the flaws of the dojo.\n\nSeason 2 [ edit ]\n\nCobra Kai founder and Johnny's old sensei John Kreese unexpectedly reappears, and Johnny reluctantly allows him to rejoin Cobra Kai. Meanwhile, Daniel opens his own Miyagi-Do dojo with Robby and Sam, who have begun dating, as his first students in response to Cobra Kai's success. A massive rivalry forms between the two dojos, particularly between Sam and new Cobra Kai student Tory Nichols, the latter of whom begins a relationship with Miguel. Under Johnny's nose, Kreese begins manipulating the Cobra Kai students to show No Mercy, which Tory and Eli \"Hawk\" Moskowitz embrace. After witnessing Miguel and Sam making out at a party, Tory instigates a school brawl between the dojos, which culminates with Robby accidentally kicking Miguel off a school balcony and onto the stairs below, severely injuring his spine and causing him to fall into a coma. In the aftermath, Daniel is convinced by Amanda to shut down Miyagi-Do, as the rivalry has gotten out of hand, while Kreese seizes control of the Cobra Kai dojo.\n\nSeason 3 [ edit ]\n\nFollowing the school brawl, Johnny relapses into becoming an alcoholic due to being depressed about Miguel being disabled, while Daniel's business begins struggling due to Robby's affiliation with Miyagi-Do. After getting a lead on Robby, who has gone missing, the two temporarily work together in an effort to find him, before ultimately giving up. Robby is found and put in juvenile detention, becoming angry at both Daniel and Johnny, and becoming tempted by Kreese's offer to join Cobra Kai. Meanwhile, Miguel awakens from his coma, and begins training with Johnny to regain his ability to walk. Once Miguel regains his walking ability, Johnny begins a new dojo called Eagle Fang Karate in an effort to compete with Cobra Kai, which catches the attention of Kreese. Around the same time, Amanda allows Daniel to reopen Miyagi-Do after a battle between his former students and Cobra Kai leads to a reluctant Hawk breaking Demetri's arm. Initially refusing to work together, Johnny and Daniel resolve their differences after meeting their ex-girlfriend Ali Mills at a party. At the same time, the Cobra Kais under Tory's leadership invade the LaRusso house, where Hawk abandons Cobra Kai to join the alliance, and Cobra Kai is defeated by Miyagi-Do and Eagle Fang, who choose to work together. After finding out, Daniel and Johnny confront Kreese, who reveals that Robby has joined Cobra Kai, and issues an ultimatum: Whichever dojo loses the next All-Valley tournament must shut down. The three agree, and Johnny and Daniel merge their respective dojos together.\n\nSpread throughout the season are flashbacks to Kreese's time in Vietnam, which describe how he became the man he is today.\n\nSeason 4 [ edit ]\n\nIn an effort to beat Johnny and Daniel at the All-Valley, Kreese enlists the help of his best friend and Cobra Kai co-founder Terry Silver, a rich businessman and former cocaine addict who quit karate after assisting Kreese in his schemes in The Karate Kid Part III. Despite being initially reluctant, Silver is coerced into joining Kreese, but has differing views on how to win the tournament. Though their alliance initially works extremely well, Silver's return spurs Daniel to attempt to take full control of the Miyagi-Fang alliance, angering Johnny who is paranoid that Miguel is taking to Daniel's teachings. This culminates in a fight between the two, that leaves the two dojos split yet again. During this, Tory rejoins school, with help from a sympathetic Amanda, causing her rivalry with Sam to reignite. In addition, Robby begins training Kenny Payne, a young student bullied by Daniel's son Anthony, in an effort to be the mentor he wish he had, and develops a relationship with Tory. At the tournament, which is split between a girls and boys bracket, Robby is pitted against Eli, and loses after having a crisis of faith due to Kenny's increasingly violent and vengeful behavior against Anthony. After Robby's defeat, Daniel and Johnny realize the benefits of the latter's ways and opt to recombine dojos. However, Tory defeats Sam (illegally owing to Silver paying the referee), causing Cobra Kai to win the tournament on the whole. Having heard Johnny mistakenly call him Robby earlier after Robby taunted him about Johnny using him as a second chance to compensate for his relationship problems with Robby, Miguel leaves the tournament in an effort to find his biological father in Mexico. Meanwhile, Silver, realizing Kreese has a soft spot for Johnny and having relapsed into insanity, frames Kreese for beating up Cobra Kai student Raymond \"Stingray\" Porter and takes full control of the dojo.\n\nSeason 5 [ edit ]\n\nDespite having lost the All-Valley, Johnny and Daniel continue efforts to bring down Cobra Kai, which now contains Silver's resources and backing. To do this, Daniel brings in former rival Chozen Toguchi to assist him, sending him undercover. However, Silver begins manipulating Daniel and sending his life into ruin, including making Amanda temporarily leave him. Silver brings in foreign senseis, including sensei Kim Da-eun, the granddaughter of Silver and Kreese's sensei, to assist him in his plans. Tory, still loyal to a now imprisoned Kreese, works undercover at Cobra Kai, the only person aware of Silver paying off the referee. After returning from Mexico, Miguel breaks up with Sam, but resolves his rivalry with Robby after Johnny forces them to fight when he learns Carmen is pregnant. After Amanda finds out from her cousin Jessica Andrews the true depravity of Silver, Johnny and Chozen convince a disillusioned Daniel to reignite his passion for Karate. The dojos continue to work together, and by manipulating Kreese, discover Silver's master plan to enlist Cobra Kai in the Seikai Taikai tournament, the most respected Karate tournament in the world. In a competition between the two, both dojos ultimately manage to enlist. During a celebration of Carmen's pregnancy, Mike Barnes, Silver's former henchman from 1985, kidnaps Daniel, Johnny, and Chozen, as his furniture store was burnt down earlier by Silver. Initially accusing Daniel of burning the store down, Barnes enlists Johnny and Chozen in an effort to get revenge on Silver, where the three face down his army of senseis. This is juxtaposed with the Miyagi-Fang students who, alongside a reformed Tory, break into the Cobra Kai dojo to download footage of Silver beating Ray up, where they face the entire Cobra Kai dojo as well as Kim Da-eun. They ultimately upload video footage of Silver revealing to Tory that he bribed the ref, causing Kenny and the rest of Cobra Kai to quit, Silver to be arrested and the dojo shut down. In the aftermath, Miguel and Sam, as well as Robby and Tory, rekindle their respective relationships. In jail, however, Kreese fakes his death and escapes.\n\nSeason 6 [ edit ]\n\nThe upcoming sixth season will be the series' last according to Netflix.[8]\n\nCast and characters [ edit ]\n\nMain cast [ edit ]\n\nSupporting cast [ edit ]\n\nThe following characters only appear via archival footage from the film series:\n\nEpisodes [ edit ]\n\nSeason Episodes Originally released Network 1 10 May 2, 2018 ( ) YouTube Red 2 10 April 24, 2019 ( ) YouTube Premium 3 10 January 1, 2021 ( ) Netflix 4 10 December 31, 2021 ( ) 5 10 September 9, 2022 ( )\n\nProduction [ edit ]\n\nThe thematic genesis for Cobra Kai began with a few works of pop culture. First, the 2007 music video for the song \"Sweep the Leg\" by No More Kings stars William Zabka (who also directed the video) as a caricature of himself as Johnny, and features references to The Karate Kid, including cameo appearances by Zabka's former Karate Kid co-stars.[10][11] In a 2010 interview, Zabka jokingly discussed this video in the context of his vision that Johnny was the true hero of the film.[12] Next in June 2010, Macchio appeared in Funny or Die's online short, \"Wax On, F*ck Off\", in which his loved ones stage an intervention to turn the former child star from a well-adjusted family man into an addict besieged with tabloid scandal in order to help his career (with frequent references to The Karate Kid).[13] A recurring joke in the sketch is that Macchio is confused for an adolescent. The short was lauded by TV Guide's Bruce Fretts, who referred to the video as \"sidesplitting\" and \"comic gold\".[14] Finally, in 2013, Macchio and Zabka made guest appearances as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka.[15] This influenced the launch of Cobra Kai, which gives a balanced perspective for Johnny, Daniel, and other characters.[16] Zabka continued to be a recurring character throughout the ninth season of the show.\n\nDevelopment [ edit ]\n\nCobra Kai was greenlit in August 2017, with ten half-hour episodes, written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg. Although the series received offers from Netflix, Amazon, Hulu, and AMC, it ultimately ended up on the subscription service YouTube Red.[17][18] The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television.[19] YouTube Premium released the first season on May 2, 2018, and the second season on April 24, 2019. The creators of the series explored moving to another platform ahead of the season two premiere, but the deal did not go through.[20]\n\nThe third season was produced for YouTube and was initially set for a 2020 release,[21][22] but in May 2020, the series left YouTube and moved to another streaming platform, ahead of its third-season premiere. As YouTube was not interested in renewing the series for a fourth season, the producers wanted to find a streaming venue that would leave that option open.[23] The show moved to Netflix in June, taking the third season with them.[24] Netflix released the first two seasons from YouTube on August 28, 2020, and the new third season on January 1, 2021.[25] A fourth season was renewed, prior to season 3 being released,[26] and was released on December 31, 2021.[27][28] The fifth season premiered on September 9, 2022.[29] In January 2023, the series was renewed for a sixth and final season.[31]\n\nCasting [ edit ]\n\nAccording to Josh Heald, Jon Hurwitz, and Hayden Schlossberg, only the characters from the original four films The Karate Kid (1984), The Karate Kid Part II (1986), The Karate Kid Part III (1989), and The Next Karate Kid (1994) comprise the Miyagi-verse that shapes Cobra Kai. Jon Hurwitz has also clarified that The Karate Kid animated series is not part of the Miyagi-verse canon, but an Easter egg from it appears in the season 3, in response to the question about its status within the Karate Kid franchise. The Easter egg was the Miyagi-Do shrine, briefly seen at Chozen Toguchi's dojo in Okinawa halfway through the season. The artifacts were recovered by Daniel LaRusso and Mister Miyagi in the short-lived Karate Kid animated series, which ran for thirteen episodes in 1989.[33] Furthermore, the writers have also said that they wouldn't use characters from the 2010 film The Karate Kid, as they are not a part of the Miyagi-verse: \"We've ruled that out completely. Jackie Chan is mentioned in season 1 of the show as an actor, so I think in our world, Jackie Chan is an actor and a performer. If the characters on our show have seen a movie called The Karate Kid, they've seen that one\".[34]\n\nIn season 1, Ralph Macchio and William Zabka reprised their respective Karate Kid roles of Daniel LaRusso and Johnny Lawrence. Additional Karate Kid actors included Randee Heller, who reprised her role as Lucille LaRusso (Daniel's mother),[35] and Martin Kove, who revived his role as John Kreese.[36] The cast list for season 1 included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. Ed Asner was cast in a guest role as Johnny's verbally abusive step-father, Sid Weinberg.[37][38] Vanessa Rubio joined the cast as Miguel's mother.[39]\n\nIn season 2, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned,[36] with Jacob Bertrand, Gianni DeCenzo, and Martin Kove being promoted to series regulars and newcomers Paul Walter Hauser and Peyton List joining the cast.[40][41] Actors from The Karate Kid, Rob Garrison (Tommy), Ron Thomas (Bobby), Tony O'Dell (Jimmy), and Randee Heller (Lucille LaRusso) made guest appearances during this season.\n\nIn season 3, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned. Actors from The Karate Kid and The Karate Kid II, Elisabeth Shue (Ali Mills), Ron Thomas (Bobby), Tamlyn Tomita (Kumiko), Traci Toguchi (Yuna), and Yuji Okumoto (Chozen Toguchi) all made guest appearances during this season.\n\nIn season 4, Vanessa Rubio and Peyton List were promoted to series regulars,[42] while Dallas Dupree Young and Oona O'Brien were cast in recurring roles.[42] In addition, Thomas Ian Griffith reprised his role as Terry Silver from The Karate Kid III,[43] and actors from The Karate Kid and The Karate Kid II, Yuji Okumoto (Chozen Toguchi)[44] and Randee Heller (Lucille LaRusso), made guest appearances.\n\nIn season 5, Yuji Okumoto had a recurring role as Chozen Toguchi.[45] In addition, Sean Kanan reprised his role as Mike Barnes and Robyn Lively reprised her role as Jessica Andrews from The Karate Kid III.[46] Alicia Hannah-Kim also joined the cast as Kim Da-eun. Dallas Dupree Young, who joined the show in season four as Kenny Payne, was upgraded to a series regular.[47]\n\nFilming [ edit ]\n\nPrincipal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University.[48] In November, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb.[49] In December, the production was working out of Marietta and Conyers.[50] Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino.[51] Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.[52]\n\nPrincipal photography for the second season began in September 2018 in Atlanta, Georgia. In October, production continued around Atlanta with shooting also occurring in Marietta.[53] In November, the series was filming in Union City.[54] In December, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.[55]\n\nPrincipal photography for the fourth season began in February 2021 and ended in April in Atlanta, Georgia.[56]\n\nFilming for the fifth season began in September 2021 and finished in December. Like previous seasons, parts were filmed in Atlanta, Georgia, Marietta, Georgia and Los Angeles, California. The Mexico scenes were filmed in Puerto Rico on a two-day filming block, just like the two-day filming block of Okinawa, Japan and the Tokyo Metropolitan Government Building in Tokyo, Japan for the third season.[57]\n\nRelease [ edit ]\n\nMarketing [ edit ]\n\nThe series was promoted at the annual Television Critics Association's winter press tour held in January 2018, when YouTube's global head of original content Susanne Daniels described the show: \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it's very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It's next generation Karate Kid.\"[58]\n\nSeveral trailers for the show were released from February[59][60][61] to March, before the premiere date was revealed to be May 2.[62]\n\nYouTube Premium released a six-minute commercial parodying ESPN's 30 for 30 in April 2019, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny.[63][64] It was nominated for a Clio Award.[65]\n\nPremiere [ edit ]\n\nThe series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.[66]\n\nYouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.[67][68]\n\nReception [ edit ]\n\nCritical response [ edit ]\n\nCritical response of Cobra Kai Season Rotten Tomatoes Metacritic 1 100% (49 reviews) 72 (11 reviews) 2 91% (31 reviews) 66 (7 reviews) 3 90% (51 reviews) 72 (15 reviews) 4 95% (37 reviews) 70 (8 reviews) 5 98% (44 reviews) 78 (7 reviews)\n\nAll five seasons of Cobra Kai have received positive critical reviews. At the review aggregator website Rotten Tomatoes, the entire series received a 94% approval rating.[69] On Metacritic, which uses a weighted average, the series holds an average rating of 71 out of 100.[70]\n\nThe first season had a positive response from critics. At Rotten Tomatoes, it holds a 100% approval rating, with an average score of 7.5 out of 10 based on 49 reviews. The website's critical consensus reads: \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\"[71] Cobra Kai was 2018's best-reviewed TV drama on Rotten Tomatoes.[72] Metacritic assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews\".[73]\n\nThe second season had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating with an average score of 7.4 out of 10, based on 31 reviews. Its critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.\"[74] Metacritic's weighted average assigned the second season a score of 66 out of 100, based on seven critics, indicating \"generally favorable reviews\".[75]\n\nThe third season of the series had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating, with an average score of 8 out of 10 based on 51 reviews. The website's critical consensus reads: \"By pairing its emotional punches with stronger humor, Cobra Kai's third season finds itself in fine fighting form.\"[76] On Metacritic with its weighted average, assigned a score of 72 out of 100, based on 15 critics, indicating \"generally favorable reviews\".[77]\n\nThe fourth season had a positive response from critics. It received a 95% Rotten Tomatoes approval rating, with an average score of 7.9 out of 10 based on 37 reviews. The website's critical consensus reads: \"Cobra Kai still delights in a fourth season that mines great fun from shifting alliances, chiefly the uneasy truce between Johnny Lawrence and Daniel LaRusso.\"[78][79] Metacritic's weighted average assigned the fourth season a score of 70 out of 100, based on eight critics, indicating \"generally favorable reviews\".[80]\n\nThe fifth season had a positive response from critics. It received a Rotten Tomatoes approval rating of 98%, with an average rating of 8 out of 10 based on 44 reviews. The site's critical consensus reads: \"Deftly managing an expanded roster of punchy personalities, Cobra Kai graduates to a black belt proficiency in heartfelt melodrama and sly humor.\"[81] On Metacritic, it received a weighted score of 78 out of 100, based on seven critics, indicating \"generally favorable reviews\".[82]\n\nViewership [ edit ]\n\nYouTube [ edit ]\n\nThe first episode, which was posted on YouTube for free along with episode two, had been viewed 5.4 million times within the first 24 hours.[83] While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that YouTube Red's new series debuted to numbers that made rival streaming services take notice.[84] By October 30, 2018, ahead of the second-season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times.[85] The first episode was No. 8 on YouTube's list of ten top-trending videos of 2018.[86]\n\nAccording to market research company Parrot Analytics, the first season of Cobra Kai was the world's most in-demand streaming television show during May 2018.[87] Parrot Analytics later reported that the second season of Cobra Kai was the world's most in-demand digital television show during April[88] and through May 2019.[89] As of September 2020 , the season 1 premiere has over 90 million views,[90] and the season 2 premiere has over 86 million views.[91]\n\nNetflix [ edit ]\n\nAfter the series moved to Netflix in August 2020, season 1 and season 2 of Cobra Kai became the most-watched series on the platform.[92] It was the most-watched show on streaming media in the United States between August 29 and September 6, according to Nielsen ratings. During the week, the show's 20 episodes drew nearly 2.2 billion streaming minutes in the United States.[93] The first season was watched on Netflix by 50 million member households in its first four weeks,[94] making Cobra Kai the most-streamed show on Netflix during the month of September 2020.[95][96]\n\nIn February 2021, after the release of season 3, Forbes announced that it \"kicked off 2021 as one of most viewed original series on a streaming platform\". During the period of December 28, 2020 – January 3, 2021, it came in \"second only to Netflix's Bridgerton\", with over 2.6 billion viewing minutes.[97] Cobra Kai then moved to first place during the period of January 4–10, 2021.[98] Critics also offered cultural commentary in response to season three. Jen Yamato of Los Angeles Times stated that by the end of season three, there are three white men at the center of Cobra Kai, a franchise rooted in and deeply indebted to Eastern tradition.[99] Gustavo Arellano of Los Angeles Times suggested that Cobra Kai offers a \"way forward for all of us during these tumultuous times\", as he saw this uplifting season 3 finale the weekend before the Jan. 6 U.S. Capitol invasion.[100] The Hollywood Reporter, former NBA champion and student of martial arts Kareem Abdul-Jabbar suggested that his friend and teacher, the late Bruce Lee, was linked to the influence of the original Karate Kid films.[101] Finally, Albert Wu and Michelle Kuo of the Los Angeles Review of Books argued that while the original Karate Kid \"film functioned as a post-Vietnam critique of American empire, staking its position explicitly: pacifism over violence, peace over war, an admittedly romanticized version of Eastern wisdom over the macho bravado of jock culture\", Cobra Kai \"models\" the \"unending appeal\" of the \"American Empire\".[102]\n\nAwards and nominations [ edit ]\n\nHome media [ edit ]\n\nDuring the show's time on YouTube Red, Cobra Kai was not released on DVD,[124] but once the show made its move to Netflix, Sony Pictures released the first and second seasons in a \"Collector's Edition\" DVD set on November 24, 2020 in the United States.[125] In 2022, Sony Pictures released the third season in January[126][127] and the fourth in September, both in the United States.[128] Sony Pictures released the fifth season in September 2023 in the United States.[129]\n\nKey = Available only on DVD = Available only on Blu-ray = Available on both DVD & Blu-ray\n\nSeason Release date Region 1[130] Region 2/B[131] Region 2/B\n\n(Germany) [132] Region 4/B[133] 1 & 2 November 24, 2020 May 4, 2020 (DVD) December 21, 2020 (Blu-ray) January 14, 2022 (LE) No release 1 No release No release December 17, 2020 August 14, 2019 2 No release No release December 17, 2020 May 7, 2020 3 January 11, 2022 January 17, 2022 July 10, 2022 (LE) January 12, 2022 4 September 13, 2022 October 17, 2022 TBA November 9, 2022 5 September 12, 2023 October 2, 2023 TBA October 11, 2023\n\nSoundtracks [ edit ]\n\nCobra Kai: Wax Off – EP [ edit ]\n\nMadison Gate Records released an extended play entitled Cobra Kai: Wax Off – EP on July 23, 2021, featuring extended versions of four previously released tracks from the first two seasons soundtracks.[134]\n\nTrack listing [ edit ]\n\nAll music is composed by Leo Birenberg and Zach Robinson No. Title Length 1. \"Quiver – Extended\" 3:51 2. \"Cobra Guy – Extended\" 2:31 3. \"A Badass Name for a Dojo – Extended\" 3:02 4. \"Sam and Robby – Extended\" 4:20 Total length: 13:45\n\nVideo games [ edit ]\n\nCobra Kai: The Karate Kid Saga Continues, a video game based on the series, was released for PlayStation 4, Xbox One, and Nintendo Switch on October 27, 2020, and for Microsoft Windows on January 5, 2021.[135]\n\nA mobile game entitled Cobra Kai: Card Fighter was released on March 19, 2021, on iOS and Android devices.[136]\n\nBook [ edit ]\n\nIn 2022, Ralph Macchio published the memoir Waxing On: The Karate Kid and Me (Dutton), in which he reflects upon the making of and legacy of the Karate Kid films and Cobra Kai.[137]\n\nReferences [ edit ]\n\nNotes [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "https://upload.wikimedia.org/wikipedia/en/thumb/5/5c/Symbol_template_class.svg/16px-Symbol_template_class.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/d6/CobraKaiTitleScreen.png/220px-CobraKaiTitleScreen.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Cobra_Kai", "title": "Cobra Kai", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/d/d6/CobraKaiTitleScreen.png", "width": 640, "height": 359}, "title": "Cobra Kai - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}