{"url": "www.inquisitr.com/4301436/did-mariah-carey-pay-bryan-tanaka-to-get-back-together-with-her/", "text": "Mariah Carey may have reached ultimate sugar mama status, as there are claims that she paid former ex-lover Bryan Tanaka to get back together with her.\n\nBut Gossip Cop, a site that has become known for debunking celebrity rumors, says that those claims are undoubtedly false.\n\n“She lured him back in by increasing his weekly stipend and promising to help him boost his career,” an alleged source told OK! Magazine, as reported by Gossip Cop. The tabloid also alleges that Mariah and Bryan made a deal over what his stipend would be.\n\n“It’s crazy, but keeping up the public perception that she’s desirable is more important to her than money.”\n\nOK! Magazine also claimed that friends are worried that Mariah might be wasting her fortune on Tanaka.\n\nBut Gossip Cop says that they reached out to Mariah’s rep, who said that the rumors published by OK! are fake news. Furthermore, as Gossip Cop notes, Carey is worth millions of dollars. If the rumors were true, a stipend for her dancer boyfriend is probably not going to hurt her much financially. If Tanaka is receiving monetary compensation from Carey, then it’s in his capacity as her backup dancer and for appearing on her realty show, Mariah’s World.\n\nAccording to Gossip Cop, OK! has published false stories about Mariah Carey, including one that claimed she was beefing with Lionel Richie, who they claimed blamed her for the cancellation of their tour. The tour was actually cancelled because of Richie’s knee surgery. OK! also previously published a story that Mariah and ex-husband Nick Cannon had a huge argument backstage at the Kid’s Choice Awards. That story was also debunked by Gossip Cop.\n\nMariah is probably too busy cementing her status as an icon to worry about any rumors about her love life. As Logo reports, Carey recently launched an LGBT-centric fashion line to celebrate Pride Month. A part of the proceeds will go to GLAAD. Mariah was officially named an LGBT ally by the organization in 2016 to thank her for her ongoing support of the community.\n\n“Through her music and outspoken support, Mariah Carey has inspired and empowered countless LGBT fans across the globe,” said GLAAD president Sarah Kate Ellis of the “Honey” singer at the awards ceremony.\n\nRELATED POSTS ON INQUISITR\n\nMariah Carey Relationship: Star Says She Is ‘Single,’ Prepares Special Day For Nick Cannon\n\nMariah Carey Drinking Problem Causing Star’s Bad Behavior?\n\nMariah Carey, Bryan Tanaka Back Together? Diva’s Crazy Rider Requests Revealed\n\nMariah Carey Outrageous Diva Behavior On ‘The House’ Set Revealed, Why Cast Hated Her\n\n[Featured Image by Pascal Le Segretain/Getty Images]", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4301436/did-mariah-carey-pay-bryan-tanaka-to-get-back-together-with-her", "title": "Did Mariah Carey Pay Bryan Tanaka To Get Back Together With Her?", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Mariah Carey may have reached ultimate sugar mama status, as there are claims that she paid former ex-lover Bryan Tanaka to get back together with her. But Gossip Cop, a site that has become known for debunking celebrity rumors, says that those claims are undoubtedly false. &#8220;She lured him back in by increasing his weekly [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Did Mariah Carey Pay Bryan Tanaka To Get Back Together With Her?", "url": "https://www.inquisitr.com/4301436/did-mariah-carey-pay-bryan-tanaka-to-get-back-together-with-her", "type": "article", "description": "Mariah Carey may have reached ultimate sugar mama status, as there are claims that she paid former ex-lover Bryan Tanaka to get back together with her. But Gossip Cop, a site that has become known for debunking celebrity rumors, says that those claims are undoubtedly false. &#8220;She lured him back in by increasing his weekly [&hellip;]"}, "article": {"published_time": "2017-06-17T19:47:44", "modified_time": "2017-06-17T19:47:44", "author": "Patricia Grannum"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Did Mariah Carey Pay Bryan Tanaka To Get Back Together With Her?", "description": "Mariah Carey may have reached ultimate sugar mama status, as there are claims that she paid former ex-lover Bryan Tanaka to get back together with her. But Gossip Cop, a site that has become known for debunking celebrity rumors, says that those claims are undoubtedly false. &#8220;She lured him back in by increasing his weekly [&hellip;]"}}, "movies": [], "publish_date": 1497718064.0, "source": "http://www.inquisitr.com", "summary": ""}