{"url": "https://en.wikipedia.org/wiki/Southern_Charm", "text": "American TV series or program\n\nSouthern Charm is an American reality television series that premiered on Bravo on March 3, 2014.[1][2] The series chronicles the personal and professional lives of several socialites who reside in Charleston, South Carolina.\n\nThe show focuses on the Southern culture, along with the political history of the area, and has featured local historical places including Lewisfield Plantation and Mikell House.[3]\n\nProduction [ edit ]\n\nOn July 14, 2014, Southern Charm was renewed for a second season,[4] which premiered on March 16, 2015.[5] Jenna King did not return. The second season featured Craig Conover, Shep Rose, Cameran Eubanks, Thomas Ravenel, and Whitney Sudler-Smith all returning, with Kathryn Calhoun Dennis[6] and Landon Clements joining the main cast.\n\nThe third season premiered on April 4, 2016. All cast members returned from the previous season. The fourth season was announced on February 16, 2017, and premiered on April 3.[7] Sudler-Smith left the main cast after season three, and was featured in a recurring capacity in following seasons. Conover, Rose, Eubanks, Ravenel, Dennis and Clements all returned for season four, with Austen Kroll being added to the main cast.\n\nIn February 2018, Bravo announced the fifth season and it premiered on April 5, 2018.[8] Clements did not return, and Chelsea Meissner was promoted to the main cast for season five. In August 2018, Ravenel announced his departure from the show after five seasons due to sexual assault allegations against him, as well as claiming that the show \"took advantage of him.\"[9] Bravo confirmed his departure in September 2018 after Ravenel was arrested and charged with assault and battery.[10] The sixth season premiered on May 15, 2019, with Eubanks, Rose, Conover, Dennis, Kroll, and Meissner all returning, with both Naomie Olindo and Eliza Limehouse added to the main cast.[11][12]\n\nSeason seven was announced on September 24, 2020, and premiered on October 29, 2020.[13] Filming of the seventh season was paused in spring 2020 due to the COVID-19 pandemic.[14] In May 2020, it was confirmed that Cameran Eubanks, Naomie Olindo, and Chelsea Meissner would not be returning to the show for the seventh season.[15] In August 2020, Eliza Limehouse confirmed that she too was departing the series ahead of season seven.[16] Leva Bonaparte, Madison LeCroy, and John Pringle were introduced as series regulars, joining Conover, Rose, Dennis, and Kroll in the main cast.\n\nSeason 8 premiered on June 23, 2022, with Olivia Flowers, Venita Aspen, Chleb Ravenell and Taylor Ann Green joining Conover, Rose, Dennis, Kroll, Bonaparte, and Olindo as part of the main cast. Madison LeCroy and John Pringle were reduced to recurring roles, while Marcie Hobbs was introduced as a friend of the cast. Filming for the season wrapped in December 2021, and the trailer dropped on May 16, 2022.[17]\n\nIn August 2023, it was announced that the ninth season of the show would premiere on September 14, 2023. Conover, Rose, Kroll, Bonaparte, Aspen, Flowers and Green all returned along with LeCroy who was upgraded back to a full time role. Rod Razavi, Rodrigo Reyes and Jarrett Thomas joined as new main cast members. Dennis and Olindo did not return.[18][19]\n\nCast [ edit ]\n\nTimeline of cast members [ edit ]\n\nEpisodes [ edit ]\n\nSeason Episodes Originally aired First aired Last aired 1 10 March 3, 2014 ( ) May 5, 2014 ( 2014-05-05 ) 2 12 March 16, 2015 ( ) May 25, 2015 ( 2015-05-25 ) 3 14 April 4, 2016 ( ) July 5, 2016 ( 2016-07-05 ) 4 15 April 3, 2017 ( ) July 17, 2017 ( 2017-07-17 ) 5 16 April 5, 2018 ( ) July 30, 2018 ( 2018-07-30 ) 6 16 May 15, 2019 ( ) August 28, 2019 ( 2019-08-28 ) 7 13 October 29, 2020 ( ) February 11, 2021 ( 2021-02-11 ) 8 17 June 23, 2022 ( ) October 13, 2022 ( 2022-10-13 ) 9 TBA September 14, 2023 ( ) TBA\n\nOn October 27, 2016, Bravo ordered a spin-off series to Southern Charm, titled Southern Charm Savannah. The series follows the same premise as its predecessor series but is set in Savannah, Georgia.[20] The series is produced by Haymaker Production and Aaron Rothman, Irad Eyal, Sara Nichols, Luke Neslage and Jessica Chesler, Jason Weinberg, Bryan Kestner and Whitney Sudler-Smith serve as the series' executive producers.[21] The series premiered on May 8, 2017.[22]\n\nIn April 2017, Bravo announced it was ordering two spin-offs, Southern Charm New Orleans and RelationShep.[23] RelationShep premiered on December 4, 2017, and followed the Southern Charm cast member as he looked for love.[24] Southern Charm New Orleans premiered on April 15, 2018[25] and its second season premiered on June 2, 2019.[26]\n\nIn February 2021, main castmembers Craig Conover and Austen Kroll were involved in a joint spin-off of Southern Charm and Summer House titled Winter House, in which Conover and Kroll join stars of Summer House for a trip to Stowe, Vermont.[27] A preview of the spin-off aired after the fifth-season finale of Summer House in April 2021, and it premiered in October 2021.[28] Conover and Kroll returned for the second season of Winter House, which premiered on October 13, 2022.\n\nIn May 2022, Bravo ordered a spin-off starring main cast member Leva Bonaparte titled Southern Hospitality that follows Bonaparte and the staff of her Charleston nightclub, Republic Garden & Lounge. The series debuted on November 28, 2022.[29][30]", "images": ["https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/thumb/d/db/Southern_Charm_logo.jpg/220px-Southern_Charm_logo.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Southern_Charm", "title": "Southern Charm", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/d/db/Southern_Charm_logo.jpg", "width": 640, "height": 481}, "title": "Southern Charm - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}