{"url": "www.inquisitr.com/4790273/blake-shelton-jokes-gwen-stefani-gave-birth-to-twins-yesterday-video/", "text": "Blake Shelton and Gwen Stefani are taking aim at the constant tabloid rumors claiming that they’re having children. The country star poked fun at the seemingly never-ending speculation that Gwen may be pregnant with the couple’s child (or children) during a recent performance in Oklahoma, where he joked that his girlfriend of over two years had just given birth to twins.\n\nShelton made the joke about his girlfriend – who has three children with ex-husband Gavin Rossdale – while introducing her on stage to perform with him during a recent concert in his home state last week.\n\nA video captured by concert goers, and obtained by PopCulture.com this week, shows the two teaming up to perform their 2016 duet “Go Ahead And Break My Heart” as they both stopped by Shelton’s restaurant and events space Ole Red in Tishomingo, Oklahoma, last week.\n\nAfter Blake took the stage to perform a few of his hits, the crowd could then be heard chanting “Gwen! Gwen! Gwen!” as they encouraged the No Doubt singer to join her man on stage.\n\nThat’s when Blake invited Stefani to join him as he performed for fans, introducing her by joking to the crowd that they were all “lucky” to have her perform because she’d only just given birth to their twins the day before.\n\n“You guys are very lucky that [she’s here],” Blake told the very excited crowd as he spoke about Gwen.\n\n“She actually gave birth to twins yesterday,” the country star then joked of how they’re hounded by pregnancy rumors, “and she’s here tonight to sing with me.”\n\nGwen then joined her boyfriend on stage wearing a long grey shirt and thigh-high red boots as the couple, who first met when they were both coaches on NBC’s The Voice in 2014, performed their duet together.\n\nThe twosome then sweetly clapped for one another after finishing their performance, before sharing a quick kiss on the lips as the crowd looked on.\n\nShelton, who was clearly in a playful mood as he performed for fans in his home state, then jokingly wiped his mouth and stared at his hand after sharing a kiss on the lips with Gwen as he poked a little fun at the star for the amount of lipstick she was wearing.\n\nOf course, the star was only joking when he told the crowd that Stefani had given birth to twins one day earlier, though it was just a few days later that the couple proudly put their romance on display once again.\n\nThough it appeared that they were separated for Valentine’s Day – likely due to Shelton’s busy touring schedule – Stefani gave fans a good look at how her boyfriend surprised her on February 14.\n\nGwen – who’s mom to three boys, 11-year-old Kingston, 9-year-old Zuma, and 3-year-old Apollo – shared various videos and photos on her Snapchat account of the stunning bouquet of pink flowers her boyfriend had delivered to her home in Los Angeles.\n\nStefani even gave fans a look at the message Blake wrote to her in his Valentine’s Day card, sharing a photo of the inside of the card she received from her fellow musician which read, “Happy Valentine’s Day. I love you! Blake.”", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Emily Hutchinson"], "canonical_link": "https://www.inquisitr.com/4790273/blake-shelton-jokes-gwen-stefani-gave-birth-to-twins-yesterday-video", "title": "Blake Shelton Jokes Gwen Stefani ‘Gave Birth To Twins Yesterday’ [Video]", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Blake Shelton and Gwen Stefani are taking aim at the constant tabloid rumors claiming that they&#8217;re having children. The country star poked fun at the seemingly never-ending speculation that Gwen may be pregnant with the couple&#8217;s child (or children) during a recent performance in Oklahoma, where he joked that his girlfriend of over two years [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Blake Shelton Jokes Gwen Stefani ‘Gave Birth To Twins Yesterday’ [Video]", "url": "https://www.inquisitr.com/4790273/blake-shelton-jokes-gwen-stefani-gave-birth-to-twins-yesterday-video", "type": "article", "description": "Blake Shelton and Gwen Stefani are taking aim at the constant tabloid rumors claiming that they&#8217;re having children. The country star poked fun at the seemingly never-ending speculation that Gwen may be pregnant with the couple&#8217;s child (or children) during a recent performance in Oklahoma, where he joked that his girlfriend of over two years [&hellip;]"}, "article": {"published_time": "2018-02-17T05:44:42", "modified_time": "2018-02-17T05:44:42", "author": "Emily Hutchinson"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Blake Shelton Jokes Gwen Stefani ‘Gave Birth To Twins Yesterday’ [Video]", "description": "Blake Shelton and Gwen Stefani are taking aim at the constant tabloid rumors claiming that they&#8217;re having children. The country star poked fun at the seemingly never-ending speculation that Gwen may be pregnant with the couple&#8217;s child (or children) during a recent performance in Oklahoma, where he joked that his girlfriend of over two years [&hellip;]"}}, "movies": ["https://www.youtube.com/embed/2mM4ZrkGoHs?feature=oembed"], "publish_date": 1518839082.0, "source": "http://www.inquisitr.com", "summary": ""}