{"url": "https://en.wikipedia.org/wiki/Crossover_(fiction)", "text": "Film and video terminology\n\nThis article is about combinations of separate fictional universes in new works. For unauthorised adaptations of existing works, see Mashup . For unauthorised adaptations of existing novels but set in alternative universes, see mashup novel\n\nIvan Tsarevich and cameo appearances of Pepper and Carrot in episode 4 of Morevna Project\n\nA crossover is the placement of two or more otherwise discrete fictional characters, settings, or universes into the context of a single story. They can arise from legal agreements between the relevant copyright holders (known as intercompany crossovers), common corporate ownership or unofficial efforts by fans.\n\nThis is different from a spoof, where one discrete character, setting, or universe, copies another character, setting, or universe, often in a comedic manner.\n\nBackground [ edit ]\n\nOfficial [ edit ]\n\nCrossovers often occur in an official capacity in order for the intellectual property rights holders to reap the financial reward of combining two or more popular, established properties. In other cases, the crossover can serve to introduce a new concept derivative of an older one. Another intention is to give fictional characters more emotional credibility and thus increase immersion for the fans.\n\nCrossovers generally occur between properties owned by a single holder, but they can, more rarely, involve properties from different holders, provided that the inherent legal obstacles can be overcome. They may also involve using characters that have passed into the public domain with those concurrently under copyright protection.\n\nA crossover story may try to explain its own reason for the crossover, such as characters being neighbors (notable examples being the casts from The Golden Girls and Empty Nest) or meeting via dimensional rift or similar phenomenon (a common explanation for science fiction properties that have different owners). Some crossovers are not explained at all. Others are absurd or simply impossible within the fictional setting, and have to be ignored by the series' respective continuities. Still others intentionally make the relations between two or more fictional universes confusing, as with The Simpsons and Futurama, where each show is fiction in the other.\n\nUnofficial [ edit ]\n\nIn contrast with legal crossovers, unofficial crossovers are created solely because of the artistic pleasure derived by their creators. Unofficial crossovers often take the form of fan-written fiction[1] and fan art, but the trope is increasingly prevalent in amateur films and audio. Whereas official crossovers are frequently stymied by such concerns as copyright, royalties payments, quality of writing and ownership of the characters, unofficial crossovers are unfettered by such concerns, so long as property holders do not exercise their right to enjoin the distribution of such material. A good example would be the unauthorised live action fan film Batman: Dead End which brings together the properties of Batman, Alien and Predator in one setting.\n\nUnofficial crossovers can also occur in a \"what-if\" scenario. Roger makes frequent cameo appearances in Family Guy, while Brian makes cameos on American Dad!. Roger, Rallo Tubbs, and Klaus Heissler were seen in the final Family Guy Star Wars spoof, \"It's A Trap!\", as Moff Jerjerrod, Nien Nunb, and Admiral Ackbar, respectively. Stewie also appears as an interactive hallucination of Booth on Bones when the agent has issues over possibly becoming a sperm donor, with David Boreanaz (who plays Booth) repaying the favor in \"Road to the North Pole\". An appearance by Elmo, from Sesame Street, was made, in a hallucination of Connie Ray's, on TV sitcom The Torkelsons. Fan fiction fusions between different science fiction movies and series are often created, such as Star Wars and Star Trek or Babylon 5 and Stargate. M.U.G.E.N. is a fighting game engine that features many fan-created and fictional characters and stages from various television series, movies, as well as other video games.\n\nComics [ edit ]\n\nComic book crossovers may be traced back to the Golden Age, where characters frequently teamed up on the cover (though far more rarely on the inside). Speed Comics number 32, Artwork by Alex Schomburg.\n\nAn early example of the comics crossover: Captain Marvel and Bulletman join forces to battle Captain Nazi. Master Comics number 21, Artwork by Mac Rayboy.\n\nCrossovers of multiple characters, owned by one company or published by one publisher, have been used to set an established continuity, where characters can frequently meet within one setting. This is especially true of comic book publishers, as different characters in various Marvel, DC, or Valiant comic books frequently interact with one another since they live in a \"shared universe\". For example, in the Marvel Comics universe, Spider-Man has frequent dealings with another Marvel hero, Daredevil, just as in the DC Comics Universe, the Flash and Green Lantern often collaborate. In comic book terminology, these \"guest star\" roles are common enough that they are generally not considered crossovers; rather, this short-term collaboration to fight crime is called a team-up. A crossover in comic book terms only occurs when a story spans more than one title.[citation needed] This has led to \"crossover events\" in which major occurrences are shown as affecting most or all of the stories in the shared universe; see Category:Crossover comics.\n\nThe earliest such crossover event was Gardner Fox's Zatanna's Search which took place in Hawkman #4 (October/November 1964), Detective Comics #336 (February 1965), The Atom #19 (June/July 1965), Green Lantern #42 (January 1966), Detective Comics #355 (September 1966), and Justice League of America #51 (February 1967). This story dealt with Zatanna attempting to reconnect with her father, Zatara, and seeking the aid of Hawkman, Batman, Robin, the Atom, Green Lantern, and the Elongated Man along the way.\n\nThe first major crossover event was spearheaded by the Marvel Editor-in-Chief at the time, Jim Shooter. As a way to further toy sales he devised the Secret Wars crossover which brought all the major Marvel heroes into a 12-issue miniseries to battle a common threat. After the threat was dealt with, they all returned to their regular titles. Secret Wars was hailed as both a critical and commercial success, largely because the events of the crossover had lasting effects on the characters (such as the introduction of Spider-Man's black suit which would later become the villain Venom). Jim Shooter later perfected his crossover technique at Valiant Comics with the Unity event. Unity brought all the Valiant characters together to defeat Mothergod, but was told within the existing Valiant Comics titles (and two bookend special issues). Readers were not obliged to buy all 18 chapters as the story was coherent when reading just one title, but far more layered when all were read. Like Secret Wars, the Unity crossover had lasting effects on the Valiant universe; most notably the introduction of Turok, the birth of Magnus, Robot Fighter and the death of a major Valiant hero.\n\nAnimation [ edit ]\n\nBambi Meets Godzilla, an early unofficial animated crossover film\n\nCartoon crossovers are not uncommon, and most of them – like comics or live-action TV shows – will often feature characters owned by the same company or network. One example is Cartoon Network's The Grim Adventures of the KND. It features five crossovers – Ed, Edd n Eddy, Codename: Kids Next Door, The Grim Adventures of Billy and Mandy, a reference to The Powerpuff Girls, and a quote from Scooby-Doo, which are all licensed Cartoon Network series. During the 1970s and 1980s, crossovers were particularly common among the Hanna-Barbera properties. Some of the earliest examples happened on The New Scooby-Doo Movies which featured appearances by characters from Harlem Globetrotters, Josie and the Pussycats, Jeannie, Speed Buggy, Batman and Robin, and The Addams Family. Later, the Hanna-Barbera Superstars 10 set of movies involved several crossovers, including such combinations as The Jetsons Meet the Flintstones. This was taken to an extreme in the 1977–79 series Laff-A-Lympics, which was essentially a gathering of the Hanna-Barbera characters for a regular series.\n\nCrossovers are not necessarily composed of characters under common ownership. Two of the most notable cartoon crossovers consisted of characters from different companies. Disney's movie Who Framed Roger Rabbit had characters from various companies, most notably Disney and Warner Bros. The film also includes cameos of characters from MGM.\n\nAnother cartoon crossover would occur in 1990, Cartoon All-Stars to the Rescue. This cartoon featured popular characters from children's Saturday morning cartoons, banding together to promote an anti-drug message. ABC, CBS, Fox, and NBC aired this half-hour special one Saturday morning with characters from all their networks, including Huey, Dewey, and Louie (from Disney's DuckTales), Winnie the Pooh, Tigger, Slimer (from The Real Ghostbusters and Extreme Ghostbusters), Michelangelo (from Teenage Mutant Ninja Turtles), Bugs Bunny, Daffy Duck, Alvin and the Chipmunks, the Smurfs, ALF (from his short-lived cartoon spinoff), Garfield, and the trio of Baby Kermit, Baby Piggy, and Baby Gonzo (from Jim Henson's Muppet Babies). Animation companies granted unlimited, royalty-free use of their cartoon characters for this project, a feat that has been unequalled before or since. This cartoon was also introduced by then-President George H. W. Bush and Barbara Bush, and would be distributed to schools and video stores free of charge nationwide.\n\nWebtoons (animated shows from the internet) can also have crossovers with different webtoons, franchises, YouTubers and more. Some examples are when Kate from TomSka's Crash Zoom series makes an appearance in Eddsworld as a trick or treater who possesses Matt and Edd in the episode, \"Trick or Threat\". In addition to this a couple of characters from Eddsworld make appearances in some Crash Zoom episodes such as \"Orcs and Dorks\".\n\nAnime and manga [ edit ]\n\nAnime has also participated in many crossover events featuring characters or shows from the same company or network. One of the biggest projects down would be Dream 9 Toriko x One Piece x Dragon Ball Z Super Special Collaboration as it includes three Shonen Jump franchises, being Dragon Ball Z, One Piece, and Toriko, crossed over into an hour long special-like most crossovers, this special is filler, a fan-service episode that follows the common plot line in most crossovers. What makes this crossover unique is when the characters from all three shows split into groups, where the members all share the same clichéd character archetypes, such the main characters Goku, Luffy, and Toriko falling into the dumb, good-natured, strong character archetype.[2]\n\nManga artist Leiji Matsumoto has been known to cross over the characters of his various stories and characters such as Captain Harlock, Galaxy Express 999, and Queen Millennia, all of which were originally written as separate, self-contained stories. In the Maetel Legend, Queen Promethium is revealed to be having been Yukino Yaoi, the protagonist from Queen Millennia. Matsumoto has also created various crossovers with Space Battleship Yamato, an anime on which he served as director, although the rights to Yamato are actually owned by Yoshinobu Nishizaki.\n\nFilm [ edit ]\n\nBattle sequence in King Kong vs. Godzilla showing the title characters fighting each other\n\nThe first film crossover in a series of Universal Studios monster films was Frankenstein Meets the Wolf Man, in 1943. After the comics publishing house Marvel Comics ventured into movie production, they set off to produce solitary films with popular superheroes from the Avengers team, with characters from upcoming films making cameo appearances in films starring another superhero, leading up to the crossover film The Avengers (2012). Inspired by Marvel's success, Warner Bros., who hold movie rights for DC Comics' heroes, announced the production of Batman v Superman: Dawn of Justice (2016) and further plans to develop the cinematic DC Extended Universe, while Paramount Pictures and Entertainment One announced plans to create a cinematic universe on the Transformers film series.\n\nThere have been numerous crossovers in Japanese cinema. The boom of kaiju films saw a lot of crossovers produced at Toho Studios, with some of the monsters forming teams in numerous movies, much like the Marvel movie franchise. Godzilla, Mothra and Rodan (Radon) each first appeared in standalone films before being set against each other or even teaming up against stronger enemies. Their first encounter was in 1964, first in Mothra vs. Godzilla and a few months later of all three in Ghidorah, the Three-Headed Monster. In 1962, Toho released King Kong vs. Godzilla.\n\nGames [ edit ]\n\nCrossovers in video games occur when otherwise separated fictional characters, stories, settings, universes, or media in a video game meet and interact with each other. These can range from a character simply appearing as a playable character or boss in the game, as a special guest character, or a major crossover where two or more franchises encounter.\n\nKonami made the first crossover video game featuring Simon Belmont from Castlevania, Universal Pictures' King Kong and Mikey from the Warner Bros. movie The Goonies in Konami Wai Wai World for the Famicom in 1988.\n\nMario & Sonic at the Olympic Games, released in Japan two months before Super Smash Bros. Brawl, was the first time that Mario and Sonic (as well as their associated characters) appeared in a game together.\n\nLiterature [ edit ]\n\nIn literature, some authors also engage in crossovers by including characters from different novels they have written in one.\n\nThe first popular crossover in literature was the 1885 Mark Twain novel, The Adventures of Huckleberry Finn, which had an important guest appearance by Tom Sawyer. Similarly, Lady Glencora Palliser from the Pallisers series of Anthony Trollope appears towards the end of Miss Mackenzie, a novel published between the first and second Palliser novels in 1865, a character first introduced in the novel, Can You Forgive Her? (1864). Andrew Lang's 1890 collection, Old Friends: Essays in Epistolary Parody, contains letters combining characters from different sources, including one based on Jane Austen's Northanger Abbey and Charlotte Brontë's Jane Eyre.[3]\n\nKim Newman frequently uses this device, as does Stephen King. The works of James Branch Cabell, J.D. Salinger, William Faulkner, Margaret Laurence, Thomas Pynchon, Kurt Vonnegut, Mordecai Richler, Edgar Rice Burroughs, Robert Heinlein, and Isaac Asimov also cross over with each other, linking different characters and settings together over a number of different works.\n\nIllustrator Howard Pyle conceived his work Twilight Land as one such crossover. In it, a nameless narrator is transported to \"Twilight Land\" and meets famous fairy tale characters for a soirée in an inn: Mother Goose, Cinderella, Fortunatus, Sinbad the Sailor, Aladdin, Boots, the Valiant Little Tailor, and others gather in the framing device and tell each other adventurous tales featuring other literary personages.[4]\n\nFrench author Jules Lemaître wrote a sort of sequel to Cinderella, named Princess Mimi, where Cinderella's daughter is courted by Polyphemus and Charles Perrault's Hop-o'-My-Thumb.[5][6]\n\nPublic domain [ edit ]\n\nIt is also common for authors to 'crossover' characters who have passed into the public domain, and thus do not require copyright or royalty payments for their use in other works. The League of Extraordinary Gentlemen by Alan Moore and Kevin O'Neill is another example of this, as all of the main characters and most of the secondary / background characters are fictional characters whose copyright has expired, and all are characters of different authors and creators brought together within one massive extended universe. Many of the works of Philip José Farmer's Wold Newton family sequences (which has also been explored and developed by other authors) also utilize and interweave numerous otherwise unrelated fictional characters into a rich family history by speculating familial connections between them (such as a blood-relationship between Sherlock Holmes and Tarzan). Roger Zelazny's novel A Night in the Lonesome October combines Sherlock Holmes, Doctor Frankenstein, Jack the Ripper, and the Cthulhu Mythos, although he never specifically identifies them as such (\"The Count\", \"The Good Doctor\", \"Jack\", etc.).\n\nOccasionally, authors will include into crossovers classic fictional characters whose copyright is still held by the original authors (or at least their estates), but who are nevertheless considered iconic or 'mythic' enough to be recognised from a few character traits or descriptions without being directly named (thus not requiring royalties payments to be made to the copyright holder). A prominent example occurs within The League of Extraordinary Gentlemen, Volume One, wherein a character who is clearly intended in appearance and description by other characters to be Dr. Fu Manchu appears as a significant villain; however, as this character was not in the public domain at the time of writing and the rights still held by the estate of his creator Sax Rohmer, he is not directly named as such in the work and is only referred to as 'the Devil Doctor'.\n\nTelevision series [ edit ]\n\nBetween established shows [ edit ]\n\nCrossovers involving principals can also occur when the characters have no prior relationship, but are related by time period, locale or profession. The Law and Order series, for example, afford a commonality of setting and profession which lends itself to crossovers, both within the franchise and in a wider universe. Following the cancellation of the ABC soap opera One Life to Live and its high-rated finale, several characters crossed over into the network's remaining soap opera General Hospital, remaining in the same timeline as their former show.\n\nBetween related shows [ edit ]\n\nThough most common on shows of the same production company (see, for example, \"Hurricane Saturday\"), crossovers have also occurred because shows share the same distributor or television network. A notable example of this kind of link is that between Murder, She Wrote and Magnum, P.I. These shows were made by different companies, but owned by Universal Studios and broadcast on CBS. Another case is that of Mad About You and Friends, which share the character of Ursula Buffay. Neither show shares any production or distribution commonality, but rather an actress (Lisa Kudrow), a setting (New York City) and a schedule (Friends initially followed Mad About You on NBC's Thursday night schedule).\n\nMad About You and Friends share another type of \"network crossover\". On rare occasions, networks have chosen to theme an entire night's programming around a crossover \"event\". In one case, a New York City blackout caused by Paul Reiser's character on Mad About You was experienced by the characters on Friends and Madman of the People.[7] Such \"event nights\" can also be linked by a single character's quest across multiple shows on the same evening. ABC attempted this kind of \"event night\" crossover with its Friday night programming during the 1997 season. There, they proposed that the title character of Sabrina the Teenage Witch should chase her cat, Salem, through Boy Meets World, You Wish and Teen Angel because it had run away with a \"time ball\" that was displacing each show through time.[8]\n\nIn 2013, the Canadian crime drama series Republic of Doyle and Murdoch Mysteries produced a crossover,[9] which was complicated by the shows' incompatible historical settings; Murdoch Mysteries is a historical series set in the 1890s, while Republic of Doyle is set in the present day. The problem was solved by having the actors cross over as relatives of their primary characters; Allan Hawco appeared on the November 25, 2013 episode of Murdoch Mysteries as Jacob Doyle, a 19th-century ancestor of his regular character Jake Doyle, while Yannick Bisson appeared on a January 2014 episode of Republic of Doyle as Bill Murdoch, a 21st-century descendant of his regular character William Murdoch.[9]\n\nThe earliest example of a crossover in children's television was PBS' 1971 program The Electric Company.\n\nPromotional cameos [ edit ]\n\nCrossovers can take the form of a promotional cameo appearance, used to draw attention to another work of fiction, with little rational explanation in the context of the hosting show's narrative. When not clearly presented as parody, this is frequently scorned by fans as blatant commercialism. A notable example of this is The Simpsons episode \"A Star Is Burns\", in which the character of Jay Sherman (from The Critic) appeared. It originally aired on March 5, 1995, on FOX right before The Critic began its second season, its first season having aired on ABC. This episode was largely condemned by fans of The Simpsons as existing to promote The Critic, an animated series considered inferior by comparison. Even Simpsons creator Matt Groening objected, preferring to remove his name from the credits of that particular episode in protest.[10]\n\nIn its simplest and most common form, a television crossover involves a starring character on a parent show appearing on a spin-off or vice versa because of established character relationships. An obvious example of this type of crossover occurred when Cliff Huxtable of The Cosby Show visited his daughter, Denise, on A Different World.\n\nMore complex multi-production franchises can utilize crossovers of characters to serve as a device in establishing continuity in a shared fictional universe. This crossover is common in the Star Trek universe, where minor guest stars from one series have appeared as featured guest stars later ones. A good example of this crossover is that of the Klingons Kor, Koloth, and Kang. After the passage of about a century of narrative time, the three onetime adversaries of Captain Kirk appeared together in the Star Trek: Deep Space Nine episode, \"Blood Oath\" – as the Klingons and Federation had become allies in the century between, the former villains are now portrayed as heroes.\n\nThe distinction between \"spin-off\" and \"crossover\" is sometimes narrow. The two terms can become especially conflated if two shows are linked by a guest star with a single appearance. There is debate, for instance over whether Out of the Blue is a spin-off of Happy Days, or whether the star of Out of the Blue merely crossed over into Happy Days.\n\nParodic crossovers [ edit ]\n\nOften, the problems of bringing together two shows with different narrative ambitions make the writing of a crossover burdensome. Such difficulties are encountered by situation comedies that wish to crossover with dramatic television programs. The satirical crossover—ranging in length from a cameo to a full comedy sketch or episode—is an extremely popular way of circumventing this problem. By various means, such crossovers typically avoid outcry from fans by being obvious parody or homage. However, on rare occasion, the humor of such crossovers can be used by one show make a narrative point by capitalizing on the audience's experience of the other program.\n\nParodic crossovers can be directly established as being outside the continuity of one or all of the properties being crossed over. A good example is the crossover between The Simpsons and The X-Files, which was largely accepted as being outside standard X-Files continuity.\n\nThey can occur by virtue of a dream sequence, in which the characters of one show will appear as part of a dream had by a character on another show. This method was perhaps used most famously to explain to audiences that the entirety of Newhart had been the dream of Bob Newhart's character on The Bob Newhart Show. It has more recently been used to demonstrate that cast members of The Young and the Restless appeared in a dream of a character on The King of Queens.\n\nParodic crossovers can take the form of \"gag\" cameos by characters of one property appearing on another. Crossovers of this type can also be completely wordless. This type of crossover is more common on animated programs, such as when Bender found and ate Bart Simpson's shorts on Futurama, or Milhouse had a talking Bender doll on The Simpsons. This would seem to be another case when a popular franchise is acknowledged as fiction and not a crossover of the stories.\n\nPerhaps the most obvious parodic crossover is found when characters from two series interact outside either series. This occurs most commonly on a sketch comedy show or as a humorous interlude on an award telecast. Such crossovers may sometimes involve the real actors—for example, a sketch on Royal Canadian Air Farce saw Yasir and Sarah from Little Mosque on the Prairie buying the gas station from Corner Gas, with many of the characters in the sketch being portrayed by the shows' real actors—although they may also feature one genuine star from the show amid a cast comprised otherwise of the sketch show's own stable of actors. Parodic crossovers can be used to lend verisimilitude to the fictional world of a program. Characters from a fictional television series may appear on a stylized version of an established non-fictional television series, such as game shows or reality shows. These crossovers between celebrity hosts and fictional characters are quite common on situation comedies. Mama's Family once appeared on Family Feud and the townsfolk of The Vicar of Dibley have had their heirlooms valuated on Antiques Roadshow, for instance.\n\nGerman crossover [ edit ]\n\nOne of the earlier instances of crossovers in TV productions outside the US is the episode Unter Brüdern [de] (1990), which was produced by WDR and DFF as a crossover between the West German crime series Tatort and the East German crime series Polizeiruf 110. Their respective popular heroes Horst Schimanski and Peter Fuchs join forces to solve a case in the turmoil of the time after the fall of the Berlin Wall. The episode was produced during the short transition period between the fall of the Berlin Wall and the reunification of Germany.\n\nSee also [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/KK_v_G_trailer_%281962%29.png/220px-KK_v_G_trailer_%281962%29.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Jekyll_and_Hyde_sketch_from_Penny_Illustrated.jpg/198px-Jekyll_and_Hyde_sketch_from_Penny_Illustrated.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9d/%27Twenty_Thousand_Leagues_Under_the_Sea%27_by_Neuville_and_Riou_027.jpg/93px-%27Twenty_Thousand_Leagues_Under_the_Sea%27_by_Neuville_and_Riou_027.jpg", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png/220px-Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/23/SpeedComicsNo32.jpg/220px-SpeedComicsNo32.jpg", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/9/99/Question_book-new.svg/50px-Question_book-new.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/64/MasterComicsNo21.jpg/220px-MasterComicsNo21.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ea/Ile_Mysterieuse_02.jpg/220px-Ile_Mysterieuse_02.jpg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b4/Ambox_important.svg/40px-Ambox_important.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Allan_Quatermain.jpg/85px-Allan_Quatermain.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png/1200px-Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png/1200px-Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Crossover_(fiction)", "title": "Crossover (fiction)", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png/640px-Ivan_Tsarevich_and_cameo_appearances_of_Pepper_and_Carrot_in_Morevna_Project_episode_4.png", "width": 640, "height": 360}, "title": "Crossover (fiction) - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}