{"url": "www.inquisitr.com/4811274/brad-pitt-freaks-out-over-supposed-jennifer-aniston-and-angelina-jolie-showdown-says-new-idea/", "text": "The ongoing rumors about Brad Pitt and his ex-wife, Friends star Jennifer Aniston, continue to swirl regarding a supposed reconciliation between the former couple. The claims have only intensified ever since Jennifer Aniston and her husband of two years, actor Justin Theroux, called it quits recently.\n\nWhile Brad Pitt and Angelina Jolie continue to work their way through a very challenging time, involving their own divorce and custody battle over their six children, the pair has been constantly linked to various rumored new loves. Despite Pitt having been falsely linked to a list of beauties, Jennifer Aniston has remained the most frequent female celeb to be rumored as spending time with the heartthrob.\n\nNow the focus is on how Angelina Jolie is reacting to the rumored reconciliation between Pitt and his former wife, Aniston. Reports swirl that Angelina and Jen are gearing up for a showdown over the Allied star and that Pitt is “freaking out” over the drama that his and Aniston’s supposed closeness has resulted in.\n\nNew Idea shares alleged details relayed by a source on the lengthy love triangle between the three. The insider relays that Jen and Angelina have already spoken about the big night that will see the trio in the same room, along with anyone who’s anyone in Hollywood and film. The three will all attend the Oscars and the women are said to have discussed boundaries for the occasion that could result in a “showdown” between Jen and Angelina.\n\n“Word is Jen and Angie had a major discussion about the Oscars. It’s the biggest night of the year, and they know they’ll both be party-hopping,” the insider states. “However, while Jen, 49 and Ange, 42 both want to stake out their own territory, ‘neither are willing to budge an inch,’ resulting in both ladies agreeing to do their best to avoid each other – something neither are very happy about,” the publication continues.\n\nThe star ex-husband to both these talented beauties is reportedly quite stressed out about the potential words that will be exchanged at one of the entertainment industry’s most formal and important events.\n\n“I heard he’s frantically texting Jen and Angie to ask them to avoid being in the same room at all costs – no good could possibly come from it,” the insider claims.\n\nJennifer Aniston and Justin Theroux recently announced their separation in a joint statement, within which the pair stated that they will carry on as friends and to not believe any stories that are making the rounds, reminding that what comes from them is the only truth.\n\nThis has not stopped fabrications from swirling. The rumors even now go so far as to say that Angelina Jolie and Justin Theroux have met up to find comfort and plot against Jen and Brad over their said reconciliation. This, however, has been debunked and is not to be believed, as Gossip Cop has informed readers.\n\nThis latest claim is yet to be verified, and if there is tension between the trio, the stars will likely keep their personal matters out of the prestigious event on Sunday.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Jessica Dafoe"], "canonical_link": "https://www.inquisitr.com/4811274/brad-pitt-freaks-out-over-supposed-jennifer-aniston-and-angelina-jolie-showdown-says-new-idea", "title": "Brad Pitt ‘Freaks Out’ Over Supposed Jennifer Aniston And Angelina Jolie Showdown, Says ‘New Idea’", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "The ongoing rumors about Brad Pitt and his ex-wife, Friends star Jennifer Aniston, continue to swirl regarding a supposed reconciliation between the former couple. The claims have only intensified ever since Jennifer Aniston and her husband of two years, actor Justin Theroux, called it quits recently. While Brad Pitt and Angelina Jolie continue to work [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Brad Pitt ‘Freaks Out’ Over Supposed Jennifer Aniston And Angelina Jolie Showdown, Says ‘New Idea’", "url": "https://www.inquisitr.com/4811274/brad-pitt-freaks-out-over-supposed-jennifer-aniston-and-angelina-jolie-showdown-says-new-idea", "type": "article", "description": "The ongoing rumors about Brad Pitt and his ex-wife, Friends star Jennifer Aniston, continue to swirl regarding a supposed reconciliation between the former couple. The claims have only intensified ever since Jennifer Aniston and her husband of two years, actor Justin Theroux, called it quits recently. While Brad Pitt and Angelina Jolie continue to work [&hellip;]"}, "article": {"published_time": "2018-03-03T08:42:48", "modified_time": "2018-03-03T08:42:48", "author": "Jessica Dafoe"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Brad Pitt ‘Freaks Out’ Over Supposed Jennifer Aniston And Angelina Jolie Showdown, Says ‘New Idea’", "description": "The ongoing rumors about Brad Pitt and his ex-wife, Friends star Jennifer Aniston, continue to swirl regarding a supposed reconciliation between the former couple. The claims have only intensified ever since Jennifer Aniston and her husband of two years, actor Justin Theroux, called it quits recently. While Brad Pitt and Angelina Jolie continue to work [&hellip;]"}}, "movies": [], "publish_date": 1520059368.0, "source": "http://www.inquisitr.com", "summary": ""}