{"url": "https://people.com/music/nick-jonas-priyanka-chopra-relationship-timeline/", "text": "01 of 34 2016: Nick Jonas and Priyanka Chopra start texting AP/Shutterstock Chopra told Vogue that Jonas reached out to her on Twitter, suggesting they go out on a date. \"I'm hearing from a few mutual friends that we should meet,\" he recalled writing in 2016. Chopra gave Jonas her number, and the two soon began a texting relationship, which Jonas described to Vogue as \"friendly with an eye toward flirtation.\" The pair then met in person for the first time in 2017 at the Vanity Fair Oscars party — where Jonas got down on one knee. \"This is in front of a bunch of people,\" he recalled. \"I say, 'You're real. Where have you been all my life?' Like, loud.\"\n\n02 of 34 May 2, 2017: Nick Jonas and Priyanka Chopra attend the Met Gala together George Pimentel/WireImage A week before attending the 2017 Met Gala together as Ralph Lauren's guests, Chopra and Jonas first linked up when they grabbed a drink at The Carlyle in N.Y.C. Chopra invited Jonas back to her apartment (where her mother was home watching Law & Order) but was disappointed when the singer didn't kiss her. \"It was too respectful if you ask me,\" Chopra told Vogue of the date. Despite hitting it off and attending the Met Gala together, the pair didn't become romantically involved until the following year. \"We were both wearing Ralph Lauren! And we decided to go together because it was fun,\" Chopra said on Jimmy Kimmel Live.\n\n03 of 34 2018: Nick Jonas and Priyanka Chopra start out \"casual\" The Image Direct The pair stayed in touch after their Met Gala date, but things started to heat up the following year. \"They're flirtatious and have been hanging out and text all the time,\" a source told PEOPLE of the pair in May 2018, adding that the relationship was \"very casual.\" \"Hanging out\" included attending Beauty and the Beast Live in Concert in Los Angeles before spending the rest of Memorial Day weekend at a Dodgers game and then on Jonas' friend's boat.\n\n04 of 34 June 2018: Nick Jonas and Priyanka Chopra flirt on social media Priyanka Chopra/Instagram The singer showed his affection for the Quantico star in person and online. Chopra posted a photo from a trip to In-N-Out she took with a group of friends. \"That smile,\" Jonas commented on the pic, along with a heart emoji. Instagram account Comments by Celebs later caught Chopra leaving a cheeky comment on a video her man posted. \"Who is cuter?\" she commented on the clip of Jonas posing with a koala bear at an Australian zoo.\n\n05 of 34 June 2018: Priyanka Chopra meets Nick Jonas' family in New Jersey Gotham/GC Images In early June, Chopra accompanied Jonas to his cousin Rachel Tamburelli's New Jersey wedding. The couple was seen walking arm-in-arm together at the celebration in photos obtained by the Daily Mail. They were also spotted grabbing dinner together later. \"It's a huge deal that Nick brought Priyanka to his cousin's wedding,\" a source close to the couple told PEOPLE. \"He's dated a lot over the last couple years, but it's never been anything serious, so this is a big step.\" \"Nick and Priyanka really like each other, and his family enjoyed getting to know her as well,\" the source added. \"She fit right in!\" The day after the nuptials, they were spotted laughing and mingling with friends and family over brunch.\n\n06 of 34 June 22, 2018: Nick Jonas meets Priyanka Chopra's family in India Viral Bhayani/Splash News Weeks after Chopra accompanied Jonas to his cousin's wedding, the new couple flew to India for a week-long vacation so the singer could meet the actress's family, PEOPLE confirmed exclusively in late June. \"They're very happy,\" said a source close to the couple. \"It's getting serious.\" The couple also attended Aksha Ambani and Shloka Mehta's pre-wedding bash.\n\n07 of 34 July 2018: Priyanka Chopra supports Nick Jonas on tour Splash News Following their week-long stay in India, Chopra and Jonas headed to Brazil, where Jonas performed at the VillaMix Festival alongside acts like Shawn Mendes and Jorge & Mateu. The actress shared a video from the concert on her Instagram Story, showing her affection for Jonas, writing \"Him\" alongside the clip - and adding a heart-eyes emoji.\n\n08 of 34 July 18, 2018: Nick Jonas and Priyanka Chopra get engaged Prodip Guha/Hindustan Times/Getty Images On July 27, PEOPLE confirmed the couple got engaged while in Crete, celebrating the actress's 36th birthday. Jonas closed down a London Tiffany & Co. store to buy an engagement ring, according to the insider. \"They are so happy,\" the source shared.\n\n09 of 34 August 19, 2018: Nick Jonas and Priyanka Chopra go Instagram official with their engagement Nick Jonas/Instagram Three weeks after PEOPLE broke the engagement news, the couple confirmed their relationship status on Aug. 19 by each posting the same romantic engagement photo to Instagram. \"Future Mrs. Jonas. My heart. My love,\" Jonas captioned the shot — which showed the couple embracing as she placed her hand (and massive engagement ring) on his chest.\n\n10 of 34 August 2018: Nick Jonas and Priyanka Chopra celebrate their engagement with loved ones Mushtaq Shiekh/Twitter The couple celebrated their upcoming nuptials with a party in Mumbai, India. Their respective families — who were meeting each other for the first time, plus many friends from her Bollywood circle — were in attendance.\n\n11 of 34 September 4, 2018: Nick Jonas and Priyanka Chopra go on double date with Joe Jonas and Sophie Turner Priyanka Chopra/Instagram The engaged couple enjoyed a double date with Joe Jonas and his then-fiancée, Sophie Turner, at the U.S. Open in September. \"It's a #famjam at #usopen,\" Chopra captioned the group pic on Instagram. The foursome was also spotted grabbing dinner around N.Y.C. throughout 2018.\n\n12 of 34 November 2018: Nick Jonas and Priyanka Chopra obtain their marriage license Gary Gershoff/WireImage The couple reportedly obtained a marriage license in early November, according to The Blast. Jonas and Chopra stopped by the Beverly Hills courthouse to fill out the necessary paperwork. The Blast also reported that they plan to file the license in both Chopra's native India and the United States to make their marriage official in both countries.\n\n13 of 34 November 2018: Nick Jonas and Priyanka Chopra keep flirting on Instagram Priyanka Chopra Instagram Jonas can't help but continue to Insta-stalk his fiancé. @commentsbycelebs spotted the pop star's reaction to a series of photos Chopra posted of herself in a bridal-like Georges Chakras ensemble at her bachelorette bash. He wrote, \"I am fully insta stalking you…. you are so beautiful.\"\n\n14 of 34 November 22, 2018: Nick Jonas and Priyanka Chopra spend Thanksgiving together Priyanka Chopra/Instagram The couple celebrated the holiday in Delhi, India, with their families present. Jonas sat at the head of the (very long) table, with Chopra sitting at his right. \"Happy Thanksgiving.. family.. forever..,\" Chopra wrote in the caption.\n\n15 of 34 November 28, 2018: Nick Jonas and Priyanka Chopra attend a puja ceremony Varinder Chawla/MEGA In anticipation of their nuptials, Jonas and Chopra participated in a November puja ceremony — a prayer ritual often performed to spiritually celebrate an event — at Chopra's house in Mumbai.\n\n16 of 34 December 1, 2018: Nick Jonas and Priyanka Chopra get married Nick Jonas and Priyanka Chopra. Priyanka Chopra/Instagram The couple's wedding extravaganza kicked off in India on Dec. 1 with a Western wedding officiated by the singer's dad, following a Hindu ceremony honoring Chopra's roots the next day. The newlyweds shared dozens of photos throughout the weekend, from the Mehendi ceremony to the sangeet, which included an epic sing-off from some of the pair's celebrity friends and family members.\n\n17 of 34 December 5, 2018: Nick Jonas and Priyanka Chopra walk their first red carpet as husband and wife PALLAV PALIWAL/AFP/Getty Shortly following their wedding, the newlyweds stepped out on the red carpet together for Bumble's launch party in New Delhi on Dec. 5. The event marked their red carpet debut as a married couple.\n\n18 of 34 December 25, 2018: Nick Jonas and Priyanka Chopra celebrate their first Christmas as a married couple For their first Christmas together as a married couple, Jonas and Chopra brought together both of their families in England. Those who celebrated the holiday together included Chopra's mother, Madhu Chopra, and brother, Siddharth Chopra, Jonas' parents, Paul Kevin Sr. and Denise Jonas, Jonas' younger brother, Frankie Jonas, as well as Jonas' older brother, Joe Jonas, and his then-fiancée, Sophie Turner.\n\n19 of 34 February 2019: Priyanka Chopra appears in the Jonas Brothers' \"Sucker\" music video with Nick Jonas Priyanka Chopra/Instagram When the Jonas Brothers reunited in February 2019, Chopra was front and center for the \"Sucker\" music video. The video featured the wives of Kevin, Joe and Nick.\n\n20 of 34 February 2019: Nick Jonas supports Priyanka Chopra at her film premiere Steve Granitz/WireImage In February 2019, the couple attended the Los Angeles premiere of Chopra's film Isn't It Romantic. The two shared loving looks as they walked the pink carpet together.\n\n21 of 34 May 6, 2019: Priyanka Chopra and Nick Jonas return to the Met Gala Nick and Priyanka Chopra Jonas. Neilson Barnard/Getty In May 2019, Chopra and Jonas' relationship came full circle as they returned to the Met Gala together in matching sparkly outfits.\n\n22 of 34 January 17, 2020: Priyanka Chopra appears in the Jonas Brothers' \"What a Man Gotta Do\" music video Nick Jonas, Priyanka Chopra. Jonas Brothers When the Jonas Brothers released their single \"What a Man Gotta Do\" in January 2020, they enlisted their wives for the music video. For the video, which paid tribute to several hit movies, Chopra and Jonas recreated a scene from Risky Business.\n\n23 of 34 March 2021: Nick Jonas writes a handful of songs about Priyanka Chopra for his 'Spaceman' album Nick Jonas' \"Spaceman\" music video. nick jonas/ youtube In March 2021, Jonas released a solo album titled Spaceman, which he explained was mostly just \"love letters\" to Chopra. \"I sort of started writing this record back in July. My wife was over in Germany finishing up this little movie called The Matrix,\" Jonas said on The Tonight Show Starring Jimmy Fallon. \"And I was like, 'You know, I feel very disconnected from the world, first of all, and now my person.' And I just dug in writing ... within a couple of days I was like, 'Oh, this is a solo album.' And a few days later, I was like, 'This is a kind of themed album.'\" Chopra even made a small cameo in the music video for the album's title song.\n\n24 of 34 January 15, 2022: Priyanka Chopra and Nick Jonas become parents Karwai Tang/WireImage On Jan. 15, Jonas and Chopra became parents as they welcomed a baby girl via surrogate. \"We are overjoyed to confirm that we have welcomed a baby via surrogate. We respectfully ask for privacy during this special time as we focus on our family,\" the couple wrote on Instagram. They chose the name Malti Marie for their daughter.\n\n25 of 34 December 1, 2022: Priyanka Chopra and Nick Jonas celebrate fourth wedding anniversary While Chopra and Jonas are fairly private about their relationship, they let the world know how smitten they still are after four years of marriage. \"Find yourself a guy that reminds you everyday that you're loved. Happy anniversary babe. ❤️,\" the Quantico star wrote on Instagram, alongside a photo of the pair dancing at their reception. Jonas also posted images from the couple's two-ceremony wedding with a caption that read: \"And just like that it's been 4 years. ❤️ happy anniversary my love.\"\n\n26 of 34 January 25, 2023: Priyanka Chopra reveals that she and Nick Jonas have matching tattoos During an interview with British Vogue, Chopra shared the story behind her and her husband's matching tattoos. \"I have a check and a box behind my ears,\" she said. \"My husband has them on his arms because when he proposed, he asked me, that I checked all his boxes, and would I check another one?\"\n\n27 of 34 January 30, 2023: Priyanka Chopra supports Nick Jonas at Hollywood Walk of Fame ceremony The Jonas Brothers received their star on the Hollywood Walk of Fame — and Chopra was there to witness the exciting moment. During his acceptance speech, Jonas gave his wife and daughter, Malti, a shout-out. \"To my beautiful wife, you are the calm in the crazy, the rock in the storm, and I love being married to you. It is the greatest gift,\" he said. \"I love being a parent with you. Malti Marie, I can't wait to come here with you in 15 years and embarrass you in front of your friends.\"\n\n28 of 34 March 9, 2023: Priyanka Chopra calls Nick Jonas her \"greatest champion\" While chatting with PEOPLE at the South Asian Excellence at the Oscars event in Los Angeles, Chopra gushed about Jonas. \"My husband is my greatest champion. He's just such a supporter of me,\" she said. \"[He] finished his shoot, came directly all jazzed up and ready to be here by my side. And, you know, he champions me and reminds me when I forget.\"\n\n29 of 34 March 31, 2023: Priyanka Chopra and Nick Jonas visit India SUJIT JAISWAL/AFP via Getty Chopra and Jonas traveled to Mumbai, India, for the grand opening of the Nita Mukesh Ambani Cultural Centre. The Quantico alum dazzled in a sheer gown by Elie Saab, while Jonas wore an '80s-inspired black suit.\n\n30 of 34 April 18, 2023: Nick Jonas supports Priyanka Chopra at premiere of 'Citadel' Mike Marsland/WireImage Jonas and Chopra attended the London premiere of her Amazon Prime TV series Citadel. The actress dazzled in an off-the-shoulder red gown, while Jonas looked handsome in an all-black ensemble. On Instagram, the pop star posted a video of himself gushing over Chopra at the event. The clip was set to the hit Jonas Brothers song \"Burnin' Up,\" in which Jonas sings about a \"red dress.\"\n\n31 of 34 May 1, 2023: Priyanka Chopra and Nick Jonas attend the Met Gala Nick and Priyanka Chopra Jonas. John Shearer/WireImage Chopra and Jonas walked the red carpet at the 2023 Met Gala in coordinating Valentino ensembles. The Citadel star wowed in a black strapless gown with a thigh-high slit, while Jonas channeled Karl Lagerfeld in a leather blazer and a skinny black tie. \"I think the black and white is a classic Karl look,\" the \"Jealous\" singer told Vogue.\n\n32 of 34 June 8, 2023: Nick Jonas says Father's Day is a day to celebrate Priyanka Chopra While talking to PEOPLE at the Tribeca Film Festival, Jonas shared his plans to celebrate Chopra on Father's Day — rather than make it a day all about him. “My dad did an incredible job of making sure that everyone else felt loved on Father's Day, and I'm going to try to adopt that from him,\" he said. \"We as fathers would not be where we are as fathers without incredible women to make that dream come true.\" Jonas continued: \"I'm so grateful to share this journey with my wife, who's just an absolute boss and amazing mother. It's more about her that day than me.\"\n\n33 of 34 July 18, 2023: Nick Jonas celebrates Priyanka Chopra's 41st birthday On Instagram, Jonas paid tribute to Chopra on her 41st trip around the sun. \"I love celebrating you. Happy birthday my love,” he captioned a photo of the couple lounging on a yacht.\n\n", "images": ["https://people.com/thmb/XUIgpTpiPihw-LJDlsNUHz-sKm0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(724x0:726x2)/jonas-1-be1e489bbed748f6b5a719be1b580893.jpg", "https://people.com/thmb/mHy6EzV-cVfMV6JKRdmZrV3aivQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(919x629:921x631)/kevin-danielle-jonas-1-0f4003f5133346d6a025cd4968b25cbf.jpg", "https://people.com/thmb/PkF9mBRSuPT761pxKqUp9t8Z1Rw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/nick-jonas-Met-Gala-2023-b4d22e2672cf40958cdcaa3e5779b9b8.jpg", "https://people.com/thmb/1JqlcMevB2g4B6VVyaQDmen7BkA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(798x0:800x2)/nick-jonas2-1-dc84aaf20a734d2b96b8f792e41e2939.jpg", "https://people.com/thmb/4lPe5t_E3lpWzoz8wwCBukYlgfo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/priyanka-chopra-j-2000-2a9156bddde64285b0d4cb7dffeeb378.jpg", "https://people.com/thmb/q61n028Gn5pwSVZu_4vVYJULEN8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/priyanka-2-95baedccef3a41649c31470bc2684869.jpg", "https://people.com/thmb/FsKQrpPH13sGIGD3vFMj5Bweozc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x209:736x211)/jonas-brother-families-93f77a476ea64cf5bf566285654ec051.jpg", "https://people.com/thmb/-Rrs_BjOJi5H3GiNVFSNkGaoWIs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(454x659:456x661)/nick-jonas-priyanka-chopra-d0bb879abba0494aafec12ea7a498326.jpg", "https://people.com/thmb/DIYr8788wUL1eG-vX56VTne7KfM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(590x0:592x2)/priyanka-chopra-1-12001-864e8a758ddd4105a9a2b14cc0f40b50.jpg", "https://people.com/thmb/20Ty75BEXNPXBh1vfoNwgcD0q9U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(680x199:682x201)/Priyanka-Chopra-nick-jonas-091623-6-86d9a196d1da4dd08459316894238c6f.jpg", "https://people.com/thmb/K-gS8Y-uOh8urF29wF1L7AVhG4o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x0:691x2)/nick-jonas-2-fb0004a7140a4ca2ac18caa8e567891f.jpg", "https://people.com/thmb/WWAJu5IYAp1YpDy8dwPZOPanXCM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x239:766x241)/nick-jonas-priyanka-chopra-0dd8db13464d4209882f5e912fa75c5f.jpg", "https://people.com/thmb/bZMNrtVwTbX_5OHZn4SVM7cs35Q=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(718x0:720x2)/nick-jonas1-ab57278f13924b699cc7c1032bf4374a.jpg", "https://people.com/thmb/aWau7oyDyEof7qVNvQ1LdCIU2xw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(688x299:690x301)/priyanka-chopra-2000-abad9aeb27134ebab75f072cca4a95ca.jpg", "https://people.com/thmb/HIEc066GBc2R4eUExGmBPYJs-6A=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(750x387:752x389)/priyanka-chopra-nick-jonas-091123-6-0babf047336f4b4597225aaa13f422e1.jpg", "https://people.com/thmb/f1JKnbu65mxPgwWWDOOOpmjXn2w=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(700x295:702x297)/priyanka-chopra-malti-playdate-091423-1a-a58c0d54ea554b268224d8cfa8b8841c.jpg", "https://people.com/thmb/_9hTZI2wA9hCMXDDcUxkagGb_NU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/priyanka-chopra-nick-jonas-240dc00a0c21425c905d6ab2eb961c76.jpg", "https://people.com/thmb/o7ZRX3jGOLFREyDNXhNO1Cfk1g0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/priyanka-chopra3-2000-a3335c4f9a6f47b58c89f35e59d8b605.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/oMYi-8ROFRtICIboYkL4J73X18I=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/christina-butan-bd91fd2140364d56bab4954bd159b243.jpg", "https://people.com/thmb/iGmg7CtLrFL3m5Wh5ukrp8OjLLs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(719x227:721x229)/nick-jonas-priyanka-chopra-17-b003907872c846519f3c7e262fff09c9.jpg", "https://people.com/thmb/-TLNW9SAJN5z4_9z2EOQnvI_IYc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/priyanka-chopra-nick-jonas-2nd-annual-south-asian-excellence-pre-oscars-celebration-051123-1-932781559900490abec8b9882fd40fed.jpg", "https://people.com/thmb/wfY1j9KlCnw8JmLASoI5wOgcIAA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(780x261:782x263)/Joe-Jonas-Sophie-Turner-divorce-090423-tout-70aaeb156adf408b9d56dca9551b032f.jpg", "https://people.com/thmb/Z7bToyyPbtXaVzXZLEjcP06Vdto=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/jonas-bros-1-1effca05265147459a20c146619c9d99.jpg", "https://people.com/thmb/1fMlnsc2A_6l1FPg1Ac7-i0DPbM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(797x0:799x2)/nick-jonas-priyanka-chopra-1-2000-acec333e1df143d082479026307fea14.jpg", "https://people.com/thmb/sFZfKlL8pkgi8HJqbFRSLKfj30k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(674x0:676x2)/nick-jonas-priyanka-chopra-b082017819874c808dc78a5a930c6f33.jpg", "https://people.com/thmb/zZBCgYuJ-XOLV922QRjxFJ2FoTw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/nick-jonas-vid4-34733ba1dfbd43e0bb43ef0cfe86cde0.jpg", "https://people.com/thmb/lAUjafqyXCV1h3qeLdEP_3XN7VI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(657x90:659x92)/nick-priyanka-f5e5a52b1b96470cab9ac515f9fbab03.jpg", "https://people.com/thmb/8b_eXSn1gZPDOp1QiXWeIjpMzug=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x704:981x706)/nick-jonas-priyanka-chopra-malti-1-b8fce0f928674dc6a68fa7871a86e402.jpg", "https://people.com/thmb/v-47ggLhdWE2B16KOjADGHzuiW4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(743x0:745x2)/priyanka-chopra-4-2000-b8faea3d86714b2db4507ca33814efac.jpg", "https://people.com/thmb/iw-OCVoC1wWgCC9Gvr-UU2oeEcI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(553x329:555x331)/nick-jonas-priyanka-chopra-6-7a659b624e414232a6e4937ae0959846.jpg", "https://people.com/thmb/vnxxY5qTGIiBDXJsdxlGvcIWNS8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/priyanka-chopra5-2000-a7a409d288cc4d3b9a58d87b6eed42d5.jpg", "https://people.com/thmb/VoQJrzIhbgnBoA8AFpzyOllF2yk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/priyanka-1-013023-7e2bb7389cd842dba0c9b1ece504938f.jpg", "https://people.com/thmb/0KyHqnue6sc0fAe4jYSw3vXVD-k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x358:1001x360)/jonas-wedding-6-2000-20cc2187e0c3469ab1b38eaaf9ef5f39.jpg", "https://people.com/thmb/Pd2befnASd7bLofDNI6I3Vr8XTI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/jonas-brothers-summer-tour-1-050223-e107e427f3854e7fa4409a5fa151f6e9.png", "https://people.com/thmb/rUCdaDm5hW7stJY4ISC0eRQiICA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(594x239:596x241)/Priyanka-Chopra-040123-02-2000-e11e4e427b884e6691490e2d958fe1fc.jpg", "https://people.com/thmb/O1p8lpbNzj_X3sGVqsxnGWEUD80=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(563x179:565x181)/nick-jonas-priyanka-chopra-16-1-d73fb8111cf44e18a2d29b61ab11aea1.jpg", "https://people.com/thmb/TS21kzxvHOZXvuph8IhRH7tr6mA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/priyanka-chopra1-1-634be2182b2140d5a5a24bc3d4b51aa0.jpg", "https://people.com/thmb/A1BXKdGRgKPVfTAbBdqSF22BsKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(639x0:641x2)/priyanka-chopra2-2000-de822360ed894eaf923319c3c6a28e42.jpg", "https://people.com/thmb/0mbNvXsdLA1ahBM7tzBJ3wzbc18=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/us-open-celebs-4-2000-e7bf0241798640629f02f43991d974aa.jpg", "https://people.com/thmb/owKcZCfxJ3BiWYmsqQkFbqeFqWI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(750x0:752x2)/nick-jonas3-07771e01450c4a399f4923efa2957ed6.jpg", "https://people.com/thmb/LULNVpMFzTdpBSieaSLuvGKb6dg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(899x0:901x2)/priyanka-chopra11-9caee8ce0d454448971bf2affb7579b2.jpg", "https://people.com/thmb/fniNe3tqXhTxthhX_5hNfeH1RRs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(650x0:652x2)/priyanka-chopra-3-2b377d264e474befaddcccdf81dadcb9.jpg", "https://people.com/thmb/9FoXHQ5PYct7q-Vz2hu7Xq2jxNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x151:706x153)/nick-jonas-priyanka-chopra-4-494369c8314440929e13ba3b1ec9c990.jpg", "https://people.com/thmb/us7aREu9PvhSVOJc71XbxycBA-M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(827x323:829x325)/priyanka-chopra-nick-jonas-met-gala-050123-c1c6073b7aff48d390a6fdfdd54cccbb.jpg", "https://people.com/thmb/KUrcb2NY5A6UFJkpx76_g2FNjls=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(599x0:601x2)/nick-jonas-2000-2a70bef28314449aaef6edb0e2e3d3b0.jpg"], "top_img": "https://people.com/thmb/9FoXHQ5PYct7q-Vz2hu7Xq2jxNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x151:706x153)/nick-jonas-priyanka-chopra-4-494369c8314440929e13ba3b1ec9c990.jpg", "keywords": [], "authors": ["Lydia Price", "Lydia Price Is A Former Platforms Editor At People. She Left People In", "People Editorial Guidelines", "Christina Butan Is A Senior Commerce Editor At Instyle", "With Five Years Of Experience Covering Fashion", "Beauty", "Home", "Lifestyle", "Celebrity News."], "canonical_link": "https://people.com/music/nick-jonas-priyanka-chopra-relationship-timeline/", "title": "Nick Jonas and Priyanka Chopra's Relationship Timeline", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Nick Jonas and Priyanka Chopra were married in December 2018 and welcomed their first child in January 2022. Here is a complete timeline of their relationship.", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Lydia Price", "parsely-section": "Entertainment", "parsely-tags": "Entertainment,Tags,Music,Priyanka Chopra Jonas,TV,Photos,News,Nick Jonas,Celebrity", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/music/nick-jonas-priyanka-chopra-relationship-timeline/", "title": "Nick Jonas and Priyanka Chopra's Relationship Timeline", "description": "Nick Jonas and Priyanka Chopra were married in December 2018 and welcomed their first child in January 2022. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/9FoXHQ5PYct7q-Vz2hu7Xq2jxNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x151:706x153)/nick-jonas-priyanka-chopra-4-494369c8314440929e13ba3b1ec9c990.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Nick Jonas and Priyanka Chopra's Relationship Timeline", "description": "Nick Jonas and Priyanka Chopra were married in December 2018 and welcomed their first child in January 2022. Here is a complete timeline of their relationship.", "image": "https://people.com/thmb/9FoXHQ5PYct7q-Vz2hu7Xq2jxNg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(704x151:706x153)/nick-jonas-priyanka-chopra-4-494369c8314440929e13ba3b1ec9c990.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.149.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.149.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.149.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.149.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.149.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}