{"url": "https://www.aad.org/public/skin-hair-nails/skin-care/dry-skin", "text": "How to treat dry skin: Tips for relief Dry skin can flake, itch, crack, and even bleed. To help relieve dry skin, dermatologists offer these tips.\n\nSimple changes can soothe dry skin\n\nFollowing the same skin care routine year-round may not work so well when the humidity drops. Without a change in your skin care, dry air can make fine lines and wrinkles more noticeable. Dry, itchy skin can flake, crack, and even bleed.\n\nTo help heal dry skin and prevent its return, dermatologists recommend the following.\n\nStop baths and showers from worsening dry skin. When the humidity drops or your skin feels dry, be sure to: Close the bathroom door. Use warm rather than hot water. Limit your time in the shower or bath to 5 or 10 minutes. Wash with a gentle, fragrance-free cleanser. Apply enough cleanser to remove dirt and oil, avoid using so much that you see a thick lather. Blot your skin gently dry with a towel. Slather on the moisturizer immediately after drying your skin. Baths and showers can worsen dry skin. You can prevent baths and showers from worsening dry skin by following these dermatologists' tips. Click the image above to download a PDF. Apply moisturizer immediately after washing. Ointments, creams, and lotions (moisturizers) work by trapping existing moisture in your skin. To trap this much-needed moisture, you need to apply a moisturizer within few minutes of: Drying off after a shower or bath Washing your face or hands Use an ointment or cream rather than a lotion. Ointments and creams are more effective and less irritating than lotions. Look for a cream or ointment that contains one or more of the following ingredients: Jojoba oil\n\nDimethicone\n\nGlycerin\n\nHyaluronic acid\n\nLactic acid\n\nLanolin\n\nMineral oil\n\nPetrolatum\n\nShea butter Tip To relieve dry hands, carry a non-greasy hand cream with you and apply it after each hand washing. Wear lip balm. Choose a lip balm that feels good on your lips. If your lips sting or tingle after you apply the lip balm, switch to one that does not cause this reaction. Use only gentle, fragrance-free skin care products. Some skin care products, such as deodorant soaps, are too harsh for dry, sensitive skin. Dermatologists recommend using products labeled \"fragrance-frree.\"\n\n\n\nIf you see the word \"unscented,\" the product can contain chemicals that neutralize or hide the odors of other ingredients. These chemicals can irritate dry, sensitive skin. Dry skin? Stop using skin care products that contain any of the following: Alcohol (except for hand sanitizer)\n\nAlpha-hydroxy acid (AHA)\n\nFragrance, including deodorant soaps\n\nRetinoids Avoiding these products will help your skin retain its natural oils. If you find that frequent handwashing and use of hand sanitizer dries your hands, these dermatologists' tips can bring relief, Dry skin relief from COVID-19 handwashing. Wear gloves. Our hands are often the first place we notice dry skin. You can reduce dry, raw skin by putting on gloves before you: Go outdoors in winter. Perform tasks that require you to get your hands wet. Get chemicals, greases, and other substances on your hands. Choose non-irritating clothes and laundry detergent. When our skin is dry and raw even clothes and laundry detergent can be irritating. To avoid this: Wear cotton or silk under your clothing made of wool or another material that feels rough. Use laundry detergent labeled “hypoallergenic.” Stay warm without cozying up to a fireplace or other heat source. Sitting in front of an open flame or other heat source can dry your skin. Add moisture to the air. Plug in a humidifier. If you can, check your home heating system to find out if you have a humidifier on the system — and whether it’s working.\n\nWhen to see a board-certified dermatologist\n\nYour skin should start to feel better quickly. If these changes do not bring relief, you may want to see a dermatologist. Very dry skin can require a prescription ointment or cream. Dry skin also can be a sign of a skin condition that needs treatment. A dermatologist can examine your skin and explain what can help reduce your discomfort.\n\nHave a skin, hair, or nail problem? No one understands your skin better than a board-certified dermatologist. Partner with the expert for the best care. What is a dermatologist?\n\nRelated AAD resources\n\nImages\n\nVideo and infographic property of the American Academy of Dermatology.", "images": ["https://images.ctfassets.net/1ny4yoiyrqia/1bx6cxLM2IaoNgHLxZhRPo/469b9de5881b454bdebe7da57f0c3819/GettyImages-1044939258.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/4TqfQzL19NtEC94mJYSbPu/ac4fa39260b88cb35b59c7121de570c9/gsk-casey-schukow-camper-skin-craft.png?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/65UXq0QIX1TtzLSGR88Pmd/21d7708206fe0140e029473ceb0ae250/find-a-derm-card.png?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/6XLzrcmPyVItiUBGqTZjHa/db1f3093be851e2f8d257e82dca4045d/hair-skin-nail-teaser-card.png?w=450&h=450", "https://images.ctfassets.net/1ny4yoiyrqia/7m0tFSlHyXKGX1itbqlwBt/4c75740248725676e6569c5eb8ee0be0/JAK-inhibitors.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/5AkZaRHxNK7ukhBCuv1tXb/b481bf53420960006f84fea708dcab2d/scar-removal-laser-featured.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/7fNfvpEkVRNOkF4lnZDkRA/c698a750e546e341add62a2c0c48065d/GettyImages-1030323574_edited.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/2gdL23ZZq8QnI4oaO0qnsZ/0bce05a92a8b536b809f6ad7c62a9f5f/acne-keloidalis-nuchae-symptoms-itch.png?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/3IQQrlyhNKssRgiO1eqGI9/ef9b6a0019a86e5188bb14d546e25039/flyers-posters-card.png?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/6MlW7KqNkPZRRFEmMzDztT/bb1d0a122afd52169070f7bdc15e11d6/GettyImages-1355925532.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/2AM6alD0EXDDGeleN1R4Aw/7c511fd9c9e6ea824a1d8ae4e4e6a185/botox-featured.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/2GUm77vEhKAbnXvZPBPEFF/17f702bd4102a7f8a74f3a97460a974a/ThinkstockPhotos-157869039.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/CCvgWYKMuVCzAr7EaqApI/d8f43ed72990f04d1db94b3a37e38d82/bathing-tips-dry-skin-infographic-thumbnail.png", "https://images.ctfassets.net/1ny4yoiyrqia/2064cmOdQNjTOwCcDttlrj/d0e0bb7ff68d436d86ddb25266bb04e3/hair-removal-featured.jpg?w=268", "https://images.ctfassets.net/1ny4yoiyrqia/1cb2Ci55R9OXmFVQcJ4YWT/e499d6b817f1fd1539eb80c1cf20c822/GettyImages-1427872131.png?w=268"], "top_img": "https://images.ctfassets.net/1ny4yoiyrqia/6XLzrcmPyVItiUBGqTZjHa/db1f3093be851e2f8d257e82dca4045d/hair-skin-nail-teaser-card.png?w=450&h=450", "keywords": [], "authors": [], "canonical_link": "https://www.aad.org/public/everyday-care/skin-care-basics/dry/dermatologists-tips-relieve-dry-skin", "title": "Dermatologists' top tips for relieving dry skin", "meta_data": {"viewport": "width=device-width, initial-scale=1", "og": {"title": "Dermatologists' top tips for relieving dry skin", "type": "article", "description,": "To help heal dry skin and prevent its return, dermatologists recommend these top tips.", "url": "https://www.aad.org/public/everyday-care/skin-care-basics/dry/dermatologists-tips-relieve-dry-skin"}, "description": "To help heal dry skin and prevent its return, dermatologists recommend these top tips."}, "movies": ["https://www.youtube.com/embed/V0mxRhe_9pg?rel=0"], "publish_date": null, "source": "https://www.aad.org", "summary": ""}