{"url": "https://en.wikipedia.org/wiki/Bob_Morley", "text": "Australian actor (born 1984)\n\nThis article is about the Australian actor. For the musician, see Bob Marley . For other people of the same name, see Robert Morley (disambiguation)\n\nRobert Alfred Morley (born 20 December 1984), known professionally as Bob Morley, is an Australian actor. He is known for his role as Bellamy Blake in The CW's The 100 (2014–2020).\n\nHe became known first as Drew Curtis in the Australian soap opera Home and Away (2006), appeared on the Australian music talent show It Takes Two in 2007, and joined the cast of drama series The Strip in 2008. He played Aidan Foster in Neighbours in 2011, and starred in the Australian sports drama film Blinder in 2013.\n\nEarly life and education [ edit ]\n\nRobert Alfred Morley[1] was born on 20 December 1984[2] and grew up on a farm in Kyneton, a town in Victoria, Australia. He is the son of a Filipina mother and an Australian–Irish father, who died when he was young.[3] Morley has two older sisters and one older brother.[2]\n\nHe studied drama at school all the way through to Year 11, until he was asked not to continue.[4] Morley told The Age that he was a \"naughty\" student and did not take things seriously.[4] After he completed year 12, he moved to Melbourne and began an engineering degree.[3] A year later, he decided to enrol in Creative Arts at the La Trobe University and got an agent.[2][3]\n\nCareer [ edit ]\n\nMorley was known as \"Bobby\" in his younger years and early career,[2] but is now professionally known as Bob Morley.[5] He began his career by acting in university plays, including Falling to Perfect and Tale From Vienna Woods, and short films.[2][4] He appeared in the 2005 low-budget horror film Dead Harvest, directed by Damian Scott,[2] and as an extra in the soap opera Neighbours. That year he got a part in Angels with Dirty Faces and his performance brought him to the attention of the Home and Away casting directors.[4] Morley joined the cast of Home and Away as Drew Curtis in 2006.[4] For his role as Drew, Morley was nominated for the Most Popular New Male Talent Logie Award.[6]\n\nHe appeared in the second series of the Australian celebrity singing competition series It Takes Two in May 2007. On 12 June 2007, he received his highest score but was voted off. In 2008, Morley departed Home and Away, and was cast as Tony Moretti in the Nine Network action drama series The Strip.[7] The series was cancelled due to low ratings after its first series. Morley went on to appear in Nine Network's television film Scorched (2008).[3] Morley was nominated for Cleo magazine's \"Bachelor of the Year\" award.[8] In 2009, he starred as Lorca in the play Palindrome for a Dead Poet. The following year, Morley featured in season four of Sea Patrol, in the fifth episode titled \"Paradise Lost\".[9]\n\nIn 2011, he starred in the Australian thriller Road Train, directed by Dean Francis.[10] In June 2011, it was announced that Morley had joined the cast of Neighbours as Aidan Foster, a love interest for Chris Pappas.[11] Morley and Mason's characters formed the show's first gay couple.[11] Morley took a ten-week break from the soap to appear in Blinder, a feature film about Australian rules football.[12] He returned to the set of Neighbours in early June 2012.[12] Morley joined the cast of drama film Lost in The White City in 2013.[13] That year, he was cast as Bellamy Blake in The CW's The 100.[14] In 2018, Morley completed the Warner Bros. Television Directors’ Workshop.[15] The same year, he directed episode 6:11 Ashes to Ashes of The 100.[16]\n\nHe appeared in the third season of police procedural The Rookie in 2021.[17] Morley played a supporting role in the Australian romantic drama series Love Me, a two seasons adaptation of the Swedish series Älska Mig, featuring an ensemble cast including Hugo Weaving and Bojana Novakovic.[18][19] In 2023, Morley and Eliza Taylor star together as Marcus and Julie in the sci-fi thriller film I'll Be Watching, directed by Erik Bernard. The film is released on digital platforms.[20][21][22]\n\nPhilanthropy [ edit ]\n\nOn 21 September 2016, he tweeted fans a link to purchase a shirt that he designed[23] to raise funds for Beyond Blue, an Australian organisation that provides information and support for Australians' mental health.[24][additional citation(s) needed] He designed another shirt in 2017, in which the campaign proceeds were donated to the JED Foundation, a non-profit for the protection of emotional health and the prevention of suicide.[25]\n\nIn September 2017, he joined fellow The 100 cast mates to participate in the BC Children's Hospital Benefit Soccer match in Vancouver, Canada.[26][27]\n\nPersonal life [ edit ]\n\nBob Morley and his wife, Eliza Taylor\n\nBob addressed being fat-shamed and facing depression after having knee surgery in 2018.[28]\n\nOn 5 May 2019, Morley married Eliza Taylor, his co-star on The 100. They announced the marriage on 7 June 2019.[29] In early 2020, Morley and Taylor revealed that she had a miscarriage while filming the final season of The 100.[30] In September 2019, Morley shared that he had attempted suicide several times.[31]\n\nIn February 2022, Taylor and Morley announced via Instagram that they were expecting a child,[32] and in March 2022, had a son.[33]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nYear Title Role Notes 2010 Road Train Craig 2013 Blinder Nick 2014 Lost in the White City Avi 2023 I'll Be Watching Marcus 2023 Death on the Dearborn James Lee Post-production\n\nTelevision [ edit ]\n\nAwards and nominations [ edit ]", "images": ["https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Bob_Morley_%2827468730956%29_%28cropped%29.jpg/1200px-Bob_Morley_%2827468730956%29_%28cropped%29.jpg", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Bob_Morley_%2827468730956%29_%28cropped%29.jpg/220px-Bob_Morley_%2827468730956%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg/220px-Eliza_Taylor_%26_Bob_Morley_%2825890275730%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Bob_Morley_%2827468730956%29_%28cropped%29.jpg/1200px-Bob_Morley_%2827468730956%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Bob_Morley", "title": "Bob Morley", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Bob_Morley_%2827468730956%29_%28cropped%29.jpg/640px-Bob_Morley_%2827468730956%29_%28cropped%29.jpg", "width": 640, "height": 854}, "title": "Bob Morley - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}