{"url": "https://www.lumens.com/pendant-lighting/", "text": "Versatile pieces able to be placed throughout the home, pendant lights bring a focused, downward glow to rooms as they hang from the ceiling. Ranging from mini to large and single units to linear suspensions, pendants offer a lot of options and customization to the design of the home. Whether minimalist in the form to complex, eye-catching luminaires, pendants can entirely uplift a room just like chandeliers. Explore popular styles like farmhouse pendants and industrial pendant lights from our collection.\n\nOne of the most popular spaces for pendant lighting is the kitchen and the kitchen island due to the focused nature of this light fixture. When mounted over a kitchen island either as a single unit or an arrangement of matching units, kitchen pendant lights offer an ample glow for all food prep and activities beneath. The linear suspension brings a matching arrangement of lights under one hood, perfect for islands, while a single pendant or row of pendants can be worthy enough over a round kitchen table or bar, respectively.\n\nWhat size pendant over a kitchen island? The size of the kitchen island is going to determine how many and what kind of pendants can be placed above. As a general rule regardless of size, any hanging kitchen island pendants should be 24 to 36 inches above the surface and at least 24 inches apart.\n\n\n\nThe design and size of the pendants will matter depending on the length and width of the island and the style already present in the surrounding kitchen. One solution is to use an arrangement of mini pendants which can bring an ample glow while remaining minimal. A lengthy linear suspension is also a worthy choice if the island is long enough to accommodate it on both sides. Empty space is desirable on the ends of the island so that the linear suspension and island have some room to breathe. The options for kitchen island pendants are numerous, so proper research into the size, style, and mood desired is a requirement.\n\nBedroom Pendant Lights\n\nThe bedroom is one of the most frequented rooms of the home and as such the lighting fixtures need to be on point. Home to ceiling fans and table lamps and wall sconces, the bedroom can also be home to pendant lights when installed correctly. As following the rule above, pendants in the bedroom should hang 24 to 36 inches above any surface.\n\nIs a pendant light good for a bedroom? The advantage to having mini pendant lights illuminate this space over wall sconces and table lamps comes down to how the space is used and the surfaces (or lack, thereof) available. Pendants require only the ceiling to hang down from and the only disadvantage is the visible cord. The use of a pendant light, however, will save space on end tables for more bedtime reading or device storage and save space on the wall for artwork or mirrors.\n\nDining and Living Room Pendant Lights\n\nThe dining room and living room are perfect places for pendant lighting due to the frequency these rooms are used as social gathering spaces. An arrangement of dining room pendants across the length of the table or a linear suspension are both viable options depending on personal preference. Sometimes a repeating motif elevates the décor of the dining room, although linear suspensions come in several luxury options as well.\n\nThe living room can be a welcoming place for pendant lights when they are placed in certain locations. Like in the bedroom, pendant lights can be installed over end tables in reading corners of the living room or over smaller tables for casual drinks, games, or conversation. Living room pendants are also ideal for hanging in the center of a sectional over a coffee or cocktail table. In a location like over a sectional, luxury pendant lights can offer the same appeal as a larger chandelier.\n\nHow High to Hang Pendant Lights Over a Dining Room Table Hanging height of pendants are dependent on the ceiling height, but for the average ceiling height of 8 feet, keep pendant lights hanging 24 to 36 inches above the surface. If the pendant is set higher than 36 inches, the intention of the more focused glow may not be achieved and a linear suspension or chandelier may be a better option.\n\n\n\nA lower mount is also not ideal for pendant lighting because the hanging lights may reach eye-level for some guests, creating unsightly glare or a potential piece to bump heads into. The height of 24 to 36 inches ensures a cozy feel while keeping the space well-lit and the fixture out of the way. To achieve a cozy feel with a smaller table, consider a dome pendant, which will keep the focus downward while providing an inviting touch to the surface.\n\nHow large should a living room pendant light be? The size of any fixture will be dependent on the size of the room, so make sure proper measurements are done before deciding on a particular light fixture. Living rooms can have small tables for gatherings or larger sectionals or even bar areas, so the size of the pendant will depend on the size of these spaces or how the lighting arrangement will be in the home. For instance, globe pendants can act as centerpieces like chandeliers or as minimal accent pieces. In general, pendants can accent sections of a room or act as the main light source when placed in the center, so the preference is entirely subjective.", "images": ["https://intelligentpixel.modernimpact.com/px?id=877504&t=2", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 30 30'%3E%3C/svg%3E", "https://www.facebook.com/tr?id=996708593722720&ev=PageView&noscript=1", "https://images.lumens.com/is/image/Lumens/uu396212", "https://www.lumens.com/on/demandware.static/-/Sites-lumens-site-catalog/default/dw9e39d249/images/subdept/thumbs/lu-pendant-lighting-multi-light.jpg", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 400 400'%3E%3C/svg%3E", "data:image/svg+xml,%3Csvg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 320 320'%3E%3C/svg%3E"], "top_img": "https://images.lumens.com/is/image/Lumens/uu396212", "keywords": [], "authors": [], "canonical_link": "https://www.lumens.com/pendant-lighting/", "title": "Pendant Lighting at Lumens", "meta_data": {"description": "Add elegance to your home with Pendant Lighting from Lumens. Browse our selection of design-minded hanging Pendant Lights in the latest styles.", "viewport": "width=device-width, initial-scale=1", "apple-mobile-web-app-title": "Lumens.com", "og": {"description": "Add elegance to your home with Pendant Lighting from Lumens. Browse our selection of design-minded hanging Pendant Lights in the latest styles.", "title": "Pendant Lighting at Lumens", "url": "https://www.lumens.com/pendant-lighting/", "image": "https://images.lumens.com/is/image/Lumens/uu396212", "type": "website", "site_name": "Lumens"}, "msvalidate.01": "C5C1CB53DD449DDE3F9F3DE637701095", "referrer": "no-referrer-when-downgrade"}, "movies": [], "publish_date": null, "source": "https://www.lumens.com", "summary": ""}