{"url": "https://www.inquisitr.com/4464429/game-of-thrones-stars-kit-harington-and-emilia-clarke-react-on-incestuous-finale-ewwww/", "text": "Game of Thrones fans still can’t get over the bombshell revelation during season 7’s finale, but what really drew the attention of many was the incestuous pairing between Jon Snow (Kit Harington) and Daenerys Targaryen (Emilia Clarke).\n\nSunday night’s finale finally confirmed that Jon Snow is the legitimate son of Rhaegar Targaryen and Lyanna Stark, making him the rightful heir to the Iron Throne. The episode also revealed that Jon’s real name is actually Aegon Targaryen and that Daenerys is his aunt.\n\nSo when Jon Snow and Daenerys Targaryen made love on their boat ride to the North, fans were freaked out by the incestuous scene. The same goes for the actors that played the characters, Kit Harington and Emilia Clarke.\n\nThe Game of Thrones stars admitted that they were blown away by the revelation that complicates their budding romance.\n\nIn an interview with Entertainment Weekly, Emilia Clarke shared her thoughts on how Daenerys will react when she finds out that Jon is her nephew. The 30-year-old actress predicted that the Mother of Dragons will probably be grossed out by the incestuous pairing.\n\n“Ewwwww! I think that’s how it’s going to go. I get the toothbrush—”\n\nWhen asked about Jon (Aegon) being the rightful heir to the throne, Emilia Clarke insisted that she has no plans to give up or share it.\n\n“I’ve worked so hard, I don’t want to share that throne. No. The throne’s big enough for one dragon bum, and that’s mine. That’s it!”\n\nAs for how the truth will impact Jon (Aegon) and Daenerys’ relationship, Kit Harington admitted that he cannot predict that part yet. The 30-year-old actor shared his opinion as to what could possibly happen to the couple.\n\n“That part of it, I can’t predict. It could be them walking off into the sunset. It could be them killing each other.”\n\nThe showrunners of Game of Thrones appeared to agree that the revelation would change Jon (Aegon) and Daenerys’ relationship. D.B. Weiss revealed that the truth “will inevitably, if not tear them apart, at least cause real problems in their relationship.”\n\nDavid Benioff backed up the claims, adding that it complicates something that would’ve been “perfect.”\n\nIn the same interview, Kit Harington also talked about Jon (Aegon) and Daenerys’s chemistry despite not working together for six years. The actor admitted that the length of their time together in Game of Thrones has helped a lot in delivering their scenes effectively.\n\n“We’re both kind of freaking out about it. I would be like, ‘What’s the sexual tension in this scene?’ and she’s like, ‘Stop talking about sexual tension!’ It’s a unique experience to be in as an actor and you know the world is watching.”\n\nEmilia Clarke then quipped, “Yeah [I would say], ‘Would you just stop? Just give me some sexy eyes, don’t keep talking about sexual chemistry all the time.'”\n\nThe actress also added that she actually preferred that it was all action and fewer words. “I love that when we get to the saucy stuff it’s a beautiful acceptance of a wordless … yep.”\n\n[Featured Image by Frazer Harrison/Getty Images]", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Van Bermudez"], "canonical_link": "https://www.inquisitr.com/4464429/game-of-thrones-stars-kit-harington-and-emilia-clarke-react-on-incestuous-finale-ewwww", "title": "‘Game Of Thrones’ Stars Kit Harington And Emilia Clarke React To Finale: ‘Ewwww!’ [Spoilers]", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Game of Thrones fans still can&#8217;t get over the bombshell revelation during season 7&#8217;s finale, but what really drew the attention of many was the incestuous pairing between Jon Snow (Kit Harington) and Daenerys Targaryen (Emilia Clarke). Sunday night&#8217;s finale finally confirmed that Jon Snow is the legitimate son of Rhaegar Targaryen and Lyanna Stark, [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "‘Game Of Thrones’ Stars Kit Harington And Emilia Clarke React To Finale: ‘Ewwww!’ [Spoilers]", "url": "https://www.inquisitr.com/4464429/game-of-thrones-stars-kit-harington-and-emilia-clarke-react-on-incestuous-finale-ewwww", "type": "article", "description": "Game of Thrones fans still can&#8217;t get over the bombshell revelation during season 7&#8217;s finale, but what really drew the attention of many was the incestuous pairing between Jon Snow (Kit Harington) and Daenerys Targaryen (Emilia Clarke). Sunday night&#8217;s finale finally confirmed that Jon Snow is the legitimate son of Rhaegar Targaryen and Lyanna Stark, [&hellip;]"}, "article": {"published_time": "2017-08-28T10:11:24", "modified_time": "2017-08-28T10:11:24", "author": "Van Bermudez"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "‘Game Of Thrones’ Stars Kit Harington And Emilia Clarke React To Finale: ‘Ewwww!’ [Spoilers]", "description": "Game of Thrones fans still can&#8217;t get over the bombshell revelation during season 7&#8217;s finale, but what really drew the attention of many was the incestuous pairing between Jon Snow (Kit Harington) and Daenerys Targaryen (Emilia Clarke). Sunday night&#8217;s finale finally confirmed that Jon Snow is the legitimate son of Rhaegar Targaryen and Lyanna Stark, [&hellip;]"}}, "movies": [], "publish_date": 1503904284.0, "source": "https://www.inquisitr.com", "summary": ""}