{"url": "https://web.archive.org/web/20171012050125/http://www.today.com/health/christina-applegate-reveals-she-had-her-ovaries-fallopian-tubes-removed-t117380", "text": "share tweet pin email\n\nSince actress Christina Applegate was diagnosed with breast cancer in 2008 and had a double mastectomy thereafter, she’s taken steps to change her entire lifestyle, from the food she eats to the rest she gets. She also founded the Right Action for Women, which helps at-risk women pay for MRI screenings and testing.\n\nBut the actress revealed in a TODAY.com exclusive that she recently took an additional step to prevent another cancer diagnosis: She had her ovaries and fallopian tubes removed. Read on for our conversation with the actress, who’s busy raising her daughter Sadie, 6, with musician hubby Martyn LeNoble.\n\nStacie McChesney / Getty Images Christina Applegate\n\nFirst off, let’s catch up on your health. How are you doing?\n\nYou're the first person I'm telling this. Two weeks ago, I had my ovaries and [fallopian] tubes removed. My cousin passed away from ovarian cancer in 2008. I could prevent that. That’s how I’ve taken control of everything. It’s a relief. That’s one other thing off the table. Now, let’s hope I don’t get hit by a bus.\n\nWhat message do you want to send to women?\n\nIf you’re BRCA positive, it’s highly possible you’ll develop cancer in your lifetime. The first thing is to be really diligent about what you’re putting into your body, as far as what kind of food you’re eating. Organic is expensive. I get that. I don’t want to alienate anyone who can’t pay for that. But maybe skip your morning latte and get organic vegetables for the week. Try to stay away from the foods that are filled with chemicals. Be a little more diligent and carve out as much of the bad stuff that you can. The other big killer is stress. That’s a hard thing to say to people especially right now. We’re living in a bizarre time. We’re bombarded by what’s going on in our world. Breathe deeper. That’s a big one for me. I used to be a stressed out person. I’m not anymore. I try to find the lining in everything in life.\n\nI know you eat super clean.\n\nWe grow our own vegetables. That’s not an option for everyone. But just get a tomato plant! We’re a 100 percent organic house. My daughter is a vegetarian and practically vegan. That’s her choice. That’s how she eats. We’re really conscious about what we buy. Get some kale! Plant some green kale in your backyard and throw it into everything.\n\nClosed Captioning ON OFF apply | reset x Text Display\n\nBackground\n\nEnhancements font\n\nTimes New Roman Arial Comic Sans\n\nT T T T size\n\n\n\ncolor share link Doctor shows how to perform a breast self-exam live on Megyn Kelly TODAY Play Video - 4:53 Doctor shows how to perform a breast self-exam live on Megyn Kelly TODAY Play Video - 4:53\n\nIt’s pretty impressive that you founded Right Action for Women, because these tests cost a fortune and most women can’t afford them.\n\nWe’re at this place where we need to sit down and figure out the future of what it is that we’re doing and get into more of the BRCA tests for women. That’s a huge cost for a lot of people who don’t have perfect insurance. If you do know you have the gene, it gives you an empowerment about your lifestyle. I’ve been a stay-at-home mom and focusing on my daughter the last two years. We’re moving forward now.\n\nIt must weigh on you that you have a daughter, and it must make breast cancer that much more of a personal issue\n\nOf course. The chances that my daughter is BRCA positive are very high. I look at her and feed her the cleanest foods. I try to keep her stress levels down. I’m doing everything I can on my end knowing that in 20 years, she’ll have to start getting tested. Hopefully by then there will be advancements. It breaks my heart to think that’s a possibility.\n\nClosed Captioning ON OFF apply | reset x Text Display\n\nBackground\n\nEnhancements font\n\nTimes New Roman Arial Comic Sans\n\nT T T T size\n\n\n\ncolor share link Breast cancer Q and A: How often should you have a mammogram? Play Video - 3:31 Breast cancer Q and A: How often should you have a mammogram? Play Video - 3:31\n\nDo you get checked out regularly?\n\nI don’t need mammograms anymore. I don’t have breasts. I go every six months to my oncologist. It used to be every three months. They still check me out as if I had all my parts. That’s never going to go away. If you know you’re high risk, you need to go start as soon as possible.\n\nOtherwise, what’s your life like these days?\n\nI feel good. I keep my life really simple. I’m very fortunate right now to have that freedom to not work. I love being my daughter’s mother and being 24/7 here with her, doing what I need to do, making her meals, taking her to soccer. I work at her school six or seven hours a week. I’m all in. That is my job. I love my life right now. I’ve been very fortunate to be able to take a minute and it’s been wonderful.", "images": ["https://web.archive.org/web/20171012050902im_/https://media2.s-nbcnews.com/i/newscms/2017_41/1288343/christina-applegate-today-171011-tease_35a9f96eed9864f427b8fb7e37d2f493.jpg", "https://web.archive.org/web/20171012050902im_/https://media1.s-nbcnews.com/j/MSNBC/Components/Video/201710/tdy_mk_exam_171004_1920x1080.today-inline-vid-featured-desktop.jpg", "https://web.archive.org/web/20171012050902im_/https://c.betrad.com/pub/icon1.png", "https://web.archive.org/web/20171012050902im_/https://media2.s-nbcnews.com/j/newscms/2017_41/1288343/christina-applegate-today-171011-tease_35a9f96eed9864f427b8fb7e37d2f493.today-inline-large.jpg", "https://web.archive.org/web/20171012050902im_/https://media2.s-nbcnews.com/j/MSNBC/Components/Video/201710/tdy_mk_qa_171004_1920x1080.today-inline-vid-featured-desktop.jpg", "https://web.archive.org/web/20171012050902im_/https://nodeassets.today.com/cdnassets/today-images/tdy-header-logo.png", "https://web.archive.org/web/20171012050902im_/https://media4.s-nbcnews.com/j/newscms/2017_30/1231002/donna_byline_final_a8a2c5c3d910c252fce53c48b71e8bb4.today-byline.jpg"], "top_img": "https://web.archive.org/web/20171012050902im_/https://media2.s-nbcnews.com/i/newscms/2017_41/1288343/christina-applegate-today-171011-tease_35a9f96eed9864f427b8fb7e37d2f493.jpg", "keywords": [], "authors": ["Donna Freydkin"], "canonical_link": "https://web.archive.org/web/20171012050902/https://www.today.com/health/christina-applegate-reveals-she-had-her-ovaries-fallopian-tubes-removed-t117380", "title": "Actress Christina Applegate reveals she had her ovaries, fallopian tubes removed", "meta_data": {"viewport": "width=device-width initial-scale=1 maximum-scale=1 user-scalable=no", "msvalidate.01": "43434ADDF3F60D7897F819F388E2FADF", "author": "Donna Freydkin", "og": {"description": "The actress revealed to TODAY that she recently took an additional step to prevent another cancer diagnosis.", "title": "Actress Christina Applegate reveals she had her ovaries, fallopian tubes removed", "site_name": "TODAY.com", "type": "article", "image": "https://web.archive.org/web/20171012050902im_/https://media2.s-nbcnews.com/i/newscms/2017_41/1288343/christina-applegate-today-171011-tease_35a9f96eed9864f427b8fb7e37d2f493.jpg", "url": "https://web.archive.org/web/20171012050902/https://www.today.com/health/christina-applegate-reveals-she-had-her-ovaries-fallopian-tubes-removed-t117380"}, "description": "The actress revealed to TODAY that she recently took an additional step to prevent another cancer diagnosis.", "twitter": {"title": "Actress Christina Applegate reveals she had her ovaries, fallopian tubes removed", "card": "summary_large_image", "site": "@TodayShow", "description": "The actress revealed to TODAY that she recently took an additional step to prevent another cancer diagnosis.", "creator": "@TodayShow", "domain": "TODAY.com", "image": {"src": "https://media2.s-nbcnews.com/j/newscms/2017_41/1288343/christina-applegate-today-171011-tease_35a9f96eed9864f427b8fb7e37d2f493.today-inline-vid-featured-desktop.jpg"}}, "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 157687092983}, "parsely-post-id": 117380, "news_keywords": "Health & Wellness,Megyn Kelly TODAY,Breast Cancer", "google-site-verification": "uDRXhvw8LRHhorJhIUmXCkUPjqGebM6KFh9jZGwH6VA", "DC.date.issued": "2017-10-11T20:02:00.000Z", "apple-itunes-app": "app-id=416357699, affiliate-data=ct=todaycom_sb&pt=211554, app-argument=https://www.today.com/health/christina-applegate-reveals-she-had-her-ovaries-fallopian-tubes-removed-t117380"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}