{"url": "https://www.grammy.com/grammys/news/kelly-clarkson-dave-chappelle-more-present-2018-grammys", "text": "Since the 2021 release of SOUR, critics and listeners alike have touted Olivia Rodrigo for her knack to eloquently pen the relatable woes of adolescence and the pitfalls of falling in love too hard. Her latest single, \"vampire,\" is no different. Despite trading in her \"drivers license\" teenage loverboy for an older man, the perfectly executed expression of agony remains. As Rodrigo wails on the chorus, \"You made me look so naïve/ The way you sold me for parts/ As you suck your teeth into me/ Bloodsucker, famef—er/ Bleeding me dry like a g——n vampire.\" But before there was Rodrigo, there was Avril Lavigne, Taylor Swift, and Alanis Morissette — none of which would be where they were without pioneers of diaristic songwriting, Carole King and Carly Simon. Thanks to the immortalization of their music, we can relive the shift from poetic disclosures of hurt, which King exemplifies on \"It's Too Late,\" to more unrepentant, straightforward jabs (like Kate Nash says on \"Foundations,\" \"Don't want to look at your face 'cause it's making me sick\") and harrowing battle cries (as Miley Cyrus roars, \"I came in like a wrecking ball\"). Below, revisit 15 songs by empowered women, from 1971 all the way to 2021, who reclaimed the breakup narrative with their fervent sentences of damnation — because, as the age-old saying goes, hell hath no fury like a woman scorned. Carole King — \"It's Too Late\" (1971)\n\nWhen Carole King released \"It's Too Late\" in 1971, it marked a new era of songwriting. Discussions about divorce were generally unheard of, but even more so when initiated by a woman. Yet, King carried on to unapologetically release \"It's Too Late,\" which later won a GRAMMY for Record of the Year and is lauded by Rolling Stone as one of the 500 Greatest Songs of All Time. On this folky track, King and her husband's inevitable parting is on the horizon, but she isn't resentful per se. Instead, she's more troubled by the embarrassment of her husband's growing discontent, admitting, \"I feel like a fool.\" And at this point, she's ready to move on and can be grateful for the times they've shared. Carly Simon — \"You're So Vain\" (1972)\n\nIn her '70s chart-topper, Carly Simon narrates the tale of an arrogant man who believes every woman is enchanted by his aura. But the folk songstress wants to make it very clear she's not impressed by his embellished stories or luxurious closet. Usually, it's easy to guess the subject of a breakup song, but \"You're So Vain\" has led to decades of speculation. Many have assumed it could be about James Taylor, who Simon married in 1972 and divorced in 1983, or Mick Jagger, who provided vocals to the track (a theory that was later debunked). To this day, she has only revealed the track's inspiration to a select few, including Taylor Swift, who names Simon as one of her role models. Joan Jett And The Blackhearts — \"I Hate Myself For Loving You\" (1986)\n\nJoan Jett might not give a damn about her bad reputation, but she despises nothing more than her ex-lover making her look like a lovesick fool. On \"I Hate Myself for Loving You,\" the '80s chanteuse wraps herself around a classic glam rock beat, unveiling her contempt for a man who's neglected her. Stripped of her pride, Jett begins to resent herself for holding onto her feelings — as evidenced by the song's title. She tries to hide her dwelling desires (\"I want to walk, but I run back to you\") but ultimately fails to rid herself of the emotions, leaving her to fantasize about the sweet justice of one day roping him back in, just to leave him. Alanis Morissette — \"You Oughta Know\" (1995)\n\nIt's impossible to talk about scathing breakup songs without acknowledging Alanis Morissette's quintessential heartbreak anthem, \"You Oughta Know.\" At the time of its release, the Jagged Little Pill single contained some of the most honest and vitriolic lyrics in existence. Morissette begins with an illusive statement, \"I want you to know that I'm happy for you,\" which, by the second verse, crumbles into a revelation, \"I'm not quite as well, you should know.\" As she culminates into her most confessional, the instrumental rises into an addicting ruckus, with Morissette revealing the thoughts most of us would be too ashamed to admit: \"It was a slap in the face how quickly I was replaced/ And are you thinkin' of me when you f— her?\" Shania Twain — \"That Don't Impress Me Much\" (1997)\n\nShania Twain has a particular superpower of delivering each of her lyrics with an air of lightheartedness and confidence. So, when you hear a track like \"That Don't Impress Me Much,\" her disappointment and irritation becomes undetectable. A quick examination of Twain's story proves — despite the song's bouncy melodies — she's jaded by her ex's preoccupation with his vehicle, appearance and intelligence. Sure, he might be perfect on paper, but he lacks the qualities of a forever lover, and his unmerited ego should be reserved for true big shots like Elvis Presley and Brad Pitt. Michelle Branch — \"Are You Happy Now?\" (2003)\n\nIn the opening verse of \"Are You Happy Now?,\" Michelle Branch pleads, \"No, don't just walk away/ Pretending everything's okay, and you don't care about me.\" At first, she is in disbelief that her once admirer would swiftly brush her off, but as she reaches the chorus, she begins to question whether his actions were a lie all along. Her mind racing, Branch teeters between shameless questions of \"Do you really have everything you want?\" and \"Could you look me in the eye and tell me you're happy now?\" But by the song's end, she gets the most satisfying payback of all — peace without him: \"I'm not about to break/ 'Cause I'm happy now.\" Avril Lavigne — \"My Happy Ending\" (2004)\n\n\"My Happy Ending\" finds 2000s pop-punk maven Avril Lavigne grasping onto the shards of a broken relationship and trying to pinpoint where everything went wrong. She could have said the \"wrong\" thing, or her partner's misfit friends might have spoken negatively about her. But there is one thing she does know with certainty: there is no way to pick up the pieces. Coming to terms with the truth, Lavigne repositions her anger toward the other person for stripping her of her fairytale ending, sarcastically acknowledging him for their time spent together over a somber piano: \"It's nice to know you were there/ Thanks for acting like you care/ And making me feel like I was the only one.\" Kelly Clarkson — \"Gone\" (2004)\n\nKelly Clarkson has traversed almost every emotion in love, from her epic breakup anthems like \"Behind These Hazel Eyes\" to her most recent LP chemistry. But \"Gone\" may just be her most unrelenting to date. Introduced by its Breakaway counterpart \"Since U Been Gone,\" the mononymous \"Gone\" extends Clarkson's journey of healing — this time, with a more explicit and mature diatribe against her ex's character. Rather than using trivial attacks, Clarkson instead chooses to call out his assumption she'd run back into his arms, later declaring an end to her toleration: \"There is nothing you can say/ Sorry doesn't cut it, babe/ Take the hit and walk away, 'cause I'm gone.\" Lily Allen — \"Smile\" (2006)\n\nWith \"Smile,\" Lily Allen gets her sweet revenge through the sight of her former flame's tears and misfortune. But the lyrics of Allen's breakthrough single doesn't exactly clarify the specifications of her antics, only an explanation for its origins. After a cheating scandal ends her relationship, her mental health plummets — until he comes crawling back for her mercy. Upon hearing his pleas, she comes to a realization: \"When I see you cry, it makes me smile.\" And as the conniving music video shows, anyone who cheats on her will get their karma — perhaps in the form of organized burglary, beatings, and a laxative slipped into their morning coffee. Kate Nash — \"Foundations\" (2007)\n\nFollowing in the footsteps of her mentor Lily Allen, Kate Nash vividly paints the tragedy of falling out of love, made prismatic by her plain-spoken lyrics (\"Your face is pasty 'cause you've gone and got so wasted, what a surprise!\") and her charming, thick London accent. In this story, Nash has not quite removed herself from the shackles of her failing relationship. In fact, she'd like to salvage it, despite her boyfriend's tendency to humiliate her and her irresistible urge to sneer back with a sarcastic comment. By the end of the track, Nash, becoming more restless, packs on new ways to inconvenience him — but in the end, still wonders if there's any saving grace to preserve their once blazing spark out of a fear of loneliness. P!nk — \"So What\" (2008)\n\nThe year P!nk wrote \"So What,\" she already had a bevy of platinum singles under her belt. With a gleaming social status and peaking career, she was apathetic to the temporary separation from her now husband, Carey Hart. Feeling the highs of newfound singlehood, P!nk was ready to incite personal tyranny, whether that meant not paying Hart's rent, drinking her money, or starting a fight. Ironically, Hart appears as the antagonist in the music video, which P!nk revealed via her official fan website was a testament of their growth: \"Carey hadn't heard the song before he did the video. That's how much he trusts and loves me [...] He gets it. He gets me,\" she said. Taylor Swift — \"Picture To Burn\" (2006)\n\nTaylor Swift has long solidified herself as the reigning queen of love songs, from ballads honoring the most committed relationships to diss tracks of heartbreaking adolescent flings. The latter houses one of the earliest (and most twangy) hits in Swift's sweeping catalog: \"Picture to Burn.\" In this deceivingly upbeat tune, Swift vows to seek vengeance on a boyfriend after he leaves her to date one of her friends — from getting with his friends to having her father give him a piece of his mind. And along the way, she will gladly dish out a few insults: \"You're a redneck heartbreak who's really bad at lying/ So watch me strike a match on all my wasted time/ As far as I'm concerned, you're just another picture to burn.\" Miley Cyrus — \"Wrecking Ball\" (2013)\n\nClosing the door on her Hannah Montana days, Miley Cyrus' \"Wrecking Ball\" saw the childhood pop star in her most grown-up and vulnerable state to date. Months before the release, Cyrus had called off her engagement to her longtime boyfriend, Liam Hemsworth, paving the way for her thunderous performance on the Bangerz single. Just as affecting as Cyrus' belting vocals is the track's iconic music video. Cyrus climaxes with a deafening cry — \"All you did was wreck me\" — as she swings across the screen on an actual wrecking ball, breaking down all her physical and metaphorical walls. Halsey — \"You should be sad\" (2020)\n\nBy the mid-2010s, the industry had put angst on the back burner in exchange for feel-good EDM and trap beats. Well, that is, at least, until Halsey entered the picture. After just two years in the limelight, Halsey had cultivated a vibrant assortment of sonic melodrama — from the dirt and grime of toxic, failed love on tracks \"Bad at Love\" and \"Colors\" to the Bonnie and Clyde-esque heated passion of \"Him & I.\" In 2020, Halsey rounded out her discography with the genre-bending, introspective Manic, where a track like \"You should be sad\" commands your attention with matter-of-fact, vindictive comments: \"I'm so glad I never ever had a baby with you/ 'Cause you can't love nothing unless there's something in it for you.\" GAYLE — \"abcdefu\" (2021)", "images": ["https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://i8.amplience.net/i/naras/gettyimages-870327426.jpg.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/search", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://i8.amplience.net/i/naras/gettyimages-870327426.jpg", "https://i8.amplience.net/i/naras/HH50_GR_Kendrick_Hero_1920x1080.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/TWolters Headshot.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Miley-Cyrus-GettyImages-1387109340.jpg?w=821&sm=c", "https://www.facebook.com/tr?id=338622743242551&ev=PageView&noscript=1", "https://i8.amplience.net/i/naras/KateBush-GettyImages-1250100440.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://cdn.media.amplience.net/i/naras/2024-grammys-66G_CBS_Tune_In_Logo_2045x793.webp?w=175", "https://naras.a.bigcontent.io/v1/static/connected", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v3_KeyArt_1644x925", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v1_KeyArt_1644x925"], "top_img": "https://i8.amplience.net/i/naras/gettyimages-870327426.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/kelly-clarkson-dave-chappelle-more-present-2018-grammys", "title": "Kelly Clarkson, Dave Chappelle, More To Present At 2018 GRAMMYs", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "Kelly Clarkson, Dave Chappelle, More To Present At 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/kelly-clarkson-dave-chappelle-more-present-2018-grammys", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/gettyimages-870327426.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, Kelly Clarkson, Dave Chappelle, More To Present At 2018 GRAMMYs | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/kelly-clarkson-dave-chappelle-more-present-2018-grammys", "title": "Kelly Clarkson, Dave Chappelle, More To Present At 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/gettyimages-870327426.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 33}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}