{"url": "https://www.bankrate.com/finance/savings/winona-ryder-net-worth.aspx", "text": "At Bankrate we strive to help you make smarter financial decisions. While we adhere to strict editorial integrity , this post may contain references to products from our partners. Here's an explanation for how we make money .\n\nThe investment information provided in this table is for informational and general educational purposes only and should not be construed as investment or financial advice. Bankrate does not offer advisory or brokerage services, nor does it provide individualized recommendations or personalized investment advice. Investment decisions should be based on an evaluation of your own personal financial situation, needs, risk tolerance and investment objectives. Investing involves risk including the potential loss of principal.\n\nOur investing reporters and editors focus on the points consumers care about most — how to get started, the best brokers, types of investment accounts, how to choose investments and more — so you can feel confident when investing your money.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. All of our content is authored by highly qualified professionals and edited by subject matter experts , who ensure everything we publish is objective, accurate and trustworthy.\n\nFounded in 1976, Bankrate has a long track record of helping people make smart financial choices. We’ve maintained this reputation for over four decades by demystifying the financial decision-making process and giving people confidence in which actions to take next.\n\nBankrate’s editorial team writes on behalf of YOU – the reader. Our goal is to give you the best advice to help you make smart personal finance decisions. We follow strict guidelines to ensure that our editorial content is not influenced by advertisers. Our editorial team receives no direct compensation from advertisers, and our content is thoroughly fact-checked to ensure accuracy. So, whether you’re reading an article or a review, you can trust that you’re getting credible and dependable information.\n\nWe value your trust. Our mission is to provide readers with accurate and unbiased information, and we have editorial standards in place to ensure that happens. Our editors and reporters thoroughly fact-check editorial content to ensure the information you’re reading is accurate. We maintain a firewall between our advertisers and our editorial team. Our editorial team does not receive direct compensation from our advertisers.\n\nBankrate follows a strict editorial policy , so you can trust that we’re putting your interests first. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions.\n\nBankrate.com is an independent, advertising-supported publisher and comparison service. We are compensated in exchange for placement of sponsored products and services, or by you clicking on certain links posted on our site. Therefore, this compensation may impact how, where and in what order products appear within listing categories, except where prohibited by law for our mortgage, home equity and other home lending products. Other factors, such as our own proprietary website rules and whether a product is offered in your area or at your self-selected credit score range, can also impact how and where products appear on this site. While we strive to provide a wide range of offers, Bankrate does not include information about every financial or credit product or service.\n\nWe’re transparent about how we are able to bring quality content, competitive rates, and useful tools to you by explaining how we make money.\n\nBankrate follows a strict editorial policy , so you can trust that our content is honest and accurate. Our award-winning editors and reporters create honest and accurate content to help you make the right financial decisions. The content created by our editorial staff is objective, factual, and not influenced by our advertisers.\n\nYou have money questions. Bankrate has answers. Our experts have been helping you master your money for over four decades. We continually strive to provide consumers with the expert advice and tools needed to succeed throughout life’s financial journey.\n\nWhen diagnosing your financial health, there are a number of indicators to use, from your credit score to the size of your retirement portfolio. However, one measure that many overlook is net worth.\n\nYour net worth represents how much wealth you have, measured by assets like a house, cars, 401(k), jewelry or cash in the bank, minus the debt obligations you have, or what you owe. When you understand your net worth, you can make better decisions about what you do with your money, as well as get a clearer picture of how close you are to accomplishing your goals.\n\nWhat is net worth?\n\nIn general, your net worth is your personal balance sheet. It’s a way for you to get a snapshot of where your finances stand right now. Basically, it’s a measure of what you own minus what you owe to others.\n\n“Tracking it gives you a good measure of whether you’re headed in the right direction with a growing net worth,” says Crystal Rau, CFP, founder of Beyond Balanced Financial Planning.\n\nAs you move forward in your financial journey, the goal should be to increase your assets while decreasing your liabilities. The greater your assets, the greater your wealth — and this is especially true if you have fewer debt obligations weighing you down.\n\nHow to figure out net worth\n\nThe basic formula to calculate your net worth is to add up all of your assets, and then add up all of your liabilities. Once you have those two numbers, subtract your liabilities from your assets. That number is your net worth.\n\nAssets\n\nYour assets are the things you own. They are items of value, as well as items that can potentially provide income down the road.\n\nAssets that you should add up include:\n\nCurrent market value of real estate: This includes the market value of your home, as well as any rental properties or other properties you own.\n\nThis includes the market value of your home, as well as any rental properties or other properties you own. Current market value of your vehicles: Current value of all your vehicles, including cars, boats, motorcycles and other vehicles.\n\nCurrent value of all your vehicles, including cars, boats, motorcycles and other vehicles. Value of your items of significant value: Consider any fine artwork, collectibles, antiques and jewelry that you have.\n\nConsider any fine artwork, collectibles, antiques and jewelry that you have. Cash value of your bank accounts: Tally up all the money you have in your savings and checking accounts, as well as certificates of deposit.\n\nTally up all the money you have in your savings and checking accounts, as well as certificates of deposit. Market value of your investment accounts: Balances of your brokerage accounts. Your 401(k) and IRA should be included in your net worth calculation.\n\nYou can find information about the current market value of some of the assets you own, such as collectibles, by looking on eBay, and using Edmunds or Kelley Blue Book to determine the current value of your vehicles.\n\nLiabilities\n\nLiabilities represent what you owe to others. You should add these up and subtract them from your assets.\n\nMortgages: Outstanding balances on all your property loans, including what you owe on the mortgage of your primary residence, home equity loans, as well as what you owe on rental properties.\n\nOutstanding balances on all your property loans, including what you owe on the mortgage of your primary residence, home equity loans, as well as what you owe on rental properties. Vehicle loans: Any money you owe on a car, boat or other vehicle.\n\nAny money you owe on a car, boat or other vehicle. Credit card debt: Total all of your credit card balances.\n\nTotal all of your credit card balances. Personal loans: Any loan you have from an online lender, payday lender, bank or other financial institution.\n\nAny loan you have from an online lender, payday lender, bank or other financial institution. Student loans: Everything you owe on private and federal student loans.\n\nEverything you owe on private and federal student loans. Medical debt: Unpaid medical bills, or a payment plan for medical bills — even if you aren’t paying interest.\n\nUnpaid medical bills, or a payment plan for medical bills — even if you aren’t paying interest. Back taxes and liens: If you owe back taxes, have a payment plan with the IRS or have a lien against any of your property, those amounts should be considered liabilities.\n\nAs you might expect, it’s possible that you might have more liabilities than assets after making this calculation. If this is the case, you have a negative net worth. Your goal should be to pay down debt and boost savings to help you bring your net worth above zero.\n\nIf you want a little guidance as you figure out your net worth, a net worth calculator can help you include all the relevant assets and liabilities — and do the math on your behalf.\n\nWhat is a good net worth?\n\nAccording to the most recent Survey of Consumer Finances from the Federal Reserve, the median net worth for an American family is $192,900. However, for households headed by someone age 35 or younger, the median net worth was just $39,000. It grew to $335,600 for those age 75 and older. However, the “average” net worth of a U.S. family was $1,063,700, the Fed survey found.\n\nDuring your lifetime, your net worth will fluctuate, depending on what kind of debt you have, how much your home has grown in value and how much you have in your retirement account. As your finances improve and as you pay down debt, you should see an increase in net worth.\n\nBut what makes a good net worth?\n\nA 2023 Charles Schwab survey points out that many Americans believe a net worth of $2.2 million is needed to be considered “wealthy.” However, not everyone thinks you need to have more than $2 million to have a good net worth.\n\n“Really, it’s about the experiences you want to have and the freedom to pursue those experiences,” says Todd Tresidder, a former hedge fund manager, financial coach and founder of Financial Mentor. “A good net worth is one that allows you the flexibility to live your life comfortably and in a way that enriches you.”\n\nYou can compare yourself to others using net worth, Tresidder continues, but tracking your net worth should be more about comparing your current self with your past self. “It’s a way to measure your own financial progress, and you’re the only person you should be competing with,” he says.\n\nThere are some time-tested ways to boost your net worth.\n\n“A growing net worth is a sign that you are making smart decisions,” Rau says. “Decisions like saving a portion of your paycheck, growing your investments or paying down debt are all going to improve your net worth.”\n\nHow to use your net worth\n\nKnowledge of your net worth can be a useful tool to help you see where you stand today as compared to where you were a year ago or a decade ago. Additionally, net worth can also provide you with a reality check when it comes to determining whether you’re on track to reach your financial goals.\n\nTresidder suggests that you calculate your net worth on a regular basis. “Decide how often you want to measure your net worth, whether it’s monthly, twice a year or annually,” he says. “The key is to check your net worth at the same time in the cycle. If you look at it at the first of the month, your next calculation should also be the first of the month.”\n\nFor many people, income, investment contributions and debt payments are all made on a schedule, so checking in at the same point in the schedule makes sense. It allows you to compare apples to apples.\n\nIf your assets and liabilities don’t show you what you want to see, you can use that information to change course and improve your financial picture. When you see a lot of liabilities dragging your net worth down, working on growing your assets or reducing your debt can help you improve your financial health.\n\nYou can also use your net worth to reinforce good habits. When you’re hitting your goals, you can see what you’re doing right — and feel encouraged to keep pressing forward.\n\n— Bankrate’s Brian Baker contributed to an update of this story.", "images": ["https://www.bankrate.com/f/102997/1440x1440/5a53191033/best-cards-for-building-credit-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/d1a328a134/auto-loan-refinancing-guide-nav.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/4b0ced533f/how-to-invest-with-cds.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/4c26764452/how-to-start-saving.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/3d6f458d84/how-to-start-investing-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/a6b1dc15ca/how-to-save-for-retirement-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/f61af7d73a/term-life-insurance-nav.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg", "https://www.bankrate.com/f/102997/1440x1440/4037e1299d/how-to-get-a-mortgage.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/3cfd293f15/passive-income-ideas-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/3b255b330e/selling-a-home-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/234a1d1f05/how-much-is-home-insurance.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/8b7ce45a3a/whole-life-insurance-nav.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/2e8651b174/how-to-build-credit-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/e9e92b7729/home-equity-heloc-guide-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/8af9dfc8a2/home-insurance-by-state-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/59a3f533a8/best-worst-states-for-retirement-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/38750a2d5a/what-is-a-certified-financial-planner-s.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/4f02ac6944/cardmatch-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/6efbd0a01f/savings-basics.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg?auto=webp&optimize=high&crop=16:9", "https://www.bankrate.com/2022/04/28180244/what-is-net-asset-value-nav.jpg?auto=webp&fit=crop&width=230&height=150", "https://www.bankrate.com/f/102997/1440x1440/1cdbf65950/what-is-wealth-management-s.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/10ad7295ae/card-comparison-tool-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/20e5cbc3e7/how-much-is-car-insurance-nav.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/8889d553d1/best-mortgage-lenders-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1442x1440/f7ea06d7d2/heloc-lender-reviews.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/43548bf9cd/spender-type-tool-nav-imagery.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/d50369eb56/capital-one-review.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/08fb8be334/buying-a-home.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/2022/05/04084255/GettyImages-685807664.jpg?auto=webp&fit=crop&width=230&height=150", "https://www.bankrate.com/f/102997/1440x1440/4564d4d5c5/how-to-get-the-best-quote-nav.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/5bfb00cc0b/auto-insurance-by-state.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/f/102997/1440x1440/a7b9c5207a/cd-basics.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/2022/02/02140053/GettyImages-1355479583-1.jpg?auto=webp&fit=crop&width=230&height=150", "https://www.bankrate.com/f/102997/1440x1440/d121fa8bad/marcus-review.png/m/50x50/filters:quality(90):format(webp)", "https://www.bankrate.com/2023/03/03164407/GettyImages-1302887835-1.jpg?auto=webp&fit=crop&width=230&height=150"], "top_img": "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg", "keywords": [], "authors": ["Miranda Marquit", "Written By", "Contributing Writer", "Miranda Marquit Is A Contributing Writer For Bankrate. Miranda Writes About Topics Related To Investing", "Saving", "Edited By", "Managing Editor", "Brian Beers Is The Managing Editor For The Wealth Team At Bankrate. He Oversees Editorial Coverage Of Banking", "Investing", "The Economy"], "canonical_link": "https://www.bankrate.com/investing/how-to-determine-net-worth/", "title": "How to determine your net worth", "meta_data": {"viewport": "width=device-width,initial-scale=1", "description": "Your net worth represents the relationship between the decisions you make regarding your assets and those that affect your liabilities.", "fb": {"app_id": 1832579506973262}, "pageuid": "5cd36465160941e892993d71b6db3891", "articleId": 211250, "PageType": "article", "ContentType": "article", "Author": "Miranda Marquit", "Category": "Investing", "Published": 20231121, "Modified": 20231121, "FunnelStage": "upper", "TargetPersona": "Industry Insider", "Objective": "education, seo", "robots": "index, follow", "og": {"type": "article", "site_name": "Bankrate", "title": "How To Determine Your Net Worth | Bankrate.com", "description": "Your net worth represents the relationship between the decisions you make regarding your assets and those that affect your liabilities.", "url": "https://www.bankrate.com/investing/how-to-determine-net-worth/", "image": "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg"}, "twitter": {"card": "summary", "site": "@bankrate", "title": "How To Determine Your Net Worth | Bankrate.com", "description": "Your net worth represents the relationship between the decisions you make regarding your assets and those that affect your liabilities.", "image": "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg"}, "image": "https://www.bankrate.com/2018/08/31134127/how-to-determine-your-networth.jpg", "type": "article", "title": "How To Determine Your Net Worth | Bankrate.com", "url": "https://www.bankrate.com/investing/how-to-determine-net-worth/", "author": "Miranda Marquit", "published_at": "2023-11-21T14:11:20-05:00", "updated_at": "2023-11-21T14:11:20-05:00", "category": "Investing"}, "movies": [], "publish_date": null, "source": "https://www.bankrate.com", "summary": ""}