{"url": "https://www.byrdie.com/makeup-with-spf", "text": "This is a tricky category, so to take the guesswork out of selecting the right makeup with SPF for you, we handpicked 23 of the most popular options and asked our testers to try them out in our Manhattan lab and at home. After using the makeup for two weeks, testers judged each one based on the color payoff and longevity, the amount of SPF, and whether or not the formula actually performed well as a makeup product. The highest-rated products made the list.\n\nIt’s worth noting that the SPF found in makeup won’t be enough for you to meet the dermatologist-recommended level of protection and should act as more of a bonus. It’s important to lean on an SPF of 30 or higher before you layer it in order to achieve optimal levels of coverage.\n\nSun damage, skin cancer, and premature aging are just a few of the reasons we are major proponents of year-round sunscreen usage. And, while we have our go-to face sunscreens , we’ve decided to take a little extra precaution by adding makeup with SPF into the mix. After all, you can never have too much sun protection. From protective lip balms that add just the right amount of hydration to high SPF foundations that offer full coverage, there are plenty of products that fulfill their purpose while also protecting skin from the sun’s harsh rays.\n\nWhat to Look for When Buying Makeup with SPF\n\nBest Full-Coverage Foundation IT Cosmetics CC+ Cream Full Coverage Color Correcting Foundation with SPF 50+ Sephora View on Sephora View On Amazon View On Ulta What We Like Evens out skin tones\n\nDoesn't clog pores\n\nContains beneficial ingredients What We Don't Like Hard to find an exact match For quick, flawless coverage and a heaping dose of SPF, check out this catch-all product from IT Cosmetics. This CC Cream offers a full-coverage finish that blurs the look of imperfections and helps even out an uneven skin tone while also boasting SPF 50+ sun protection. It’s buildable, easy to layer, and doesn’t clog pores. Best of all, it contains a load of beneficial ingredients like hyaluronic acid, niacinamide, and vitamin E to hydrate and condition the skin during wear. Despite being a cream, it’s not very thick and actually settles beautifully into the skin, giving it a lit-from-within glow without looking cakey. During testing, we found that wears well throughout the day, and although it transfers a tiny bit when using blotting paper or a tissue, it re-sets nicely with powder and setting spray. It can be hard to find an exact match, but we recommend taking a look at the warm, neutral, and cool undertones to find one that pairs with your skin tone the best. Price at time of publish: $44 Type: Chemical | SPF: 50+ | Additional Ingredients: Hyaluronic acid, Niacinamide, Vitamin E | Size: 0.41 oz. or 1.08 oz. Byrdie / Leticia Almeida\n\nByrdie / Tembe Denton-Hurst\n\nByrdie / Jhett Thompson\n\nByrdie / Tembe Denton-Hurst\n\n\n\n\n\n\n\nBest Lightweight Foundation bareMinerals Original Loose Powder Mineral Foundation SPF 15 bareMinerals View on Sephora View On Amazon View On Ulta What We Like White cast-free\n\nLightweight, skin-like feel\n\nMattifying What We Don't Like Can be hard to open at first Not everyone loves the feeling of a cream foundation. If you’re team powder or simply just like a light touch of product (as opposed to a heavier application), you’ll enjoy this loose powder foundation from bareMinerals. The formula is designed to sit atop your skin and provide SPF 15 sun protection and sheer-to-full (depending on how you build it) coverage with a naturally luminous finish. In just a few swipes of a brush, you can expect pores and imperfections to look less obvious and oily areas like the T-zone to be less shiny. During testing, we noticed that the packaging has a handy locking mechanism that closes the powder off from spilling everywhere—aka a great choice if you’re frequently traveling or prone to messes. The only downside: We found the packaging (plastic wrap with a pull tab) tricky to open upon arrival. Try to utilize scissors or call on someone with extra nimble hands for help. Price at time of publish: $38 Type: Mineral | SPF: 15 | Additional Ingredients: Responsibly sourced mica | Size: 0.28 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\nByrdie / Tamara Staples\n\n\n\n\n\n\n\nBest Splurge Foundation La Mer The Soft Moisture Powder Foundation La Mer View On Sephora View On Walmart View On Nordstrom What We Like Blurs pores\n\nMedium coverage\n\nMattifying What We Don't Like Shades skew light At 140 dollars, this foundation from La Mer does cost a pretty penny, but we swear it contains some type of sorcery. Allow us to explain; it goes on like a powder and has the payoff and coverage of a thicker cream while mitigating oiliness. We were so surprised by how little this formula settled into pores during testing. Oftentimes, powders like this one make pores look more obvious, but we were pleased to discover that this had the opposite effect—in fact, it blurred the look of enlarged pores and skin texture. Coverage that doesn’t quit, paired with the fact that it helps curb shininess throughout the day, sold this formula for us. The only caveat: The shade options skew on the lighter end. We wish there were darker options so that those with deeper skin tones could find a more perfect match. Price at time of publish: $140 Type: Hybrid | SPF: 30 | Additional Ingredients: Miracle Broth, Lime tea concentrate, Sea ferment | Size: 0.33 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\n\n\n\n\n\n\nBest Dewey Finish Dior Dreamskin Fresh & Perfect Cushion Broad Spectrum SPF 50 Sephora View On Sephora View On Nordstrom View On Dior.com What We Like Applies beautifully\n\nDelivers a more balanced-looking skin tone What We Don't Like Only 3 shades available This light-coverage foundation compact from Dior is radiance you can hold in your hand. All you need is just two or three pats of the subtly pigmented formula to brighten up your complexion and protect your skin from the sun. It’s loaded with SPF 50 and longoza flower, an ingredient renowned for its anti-aging properties, among a whole slew of other ingredients that help disguise the look of an uneven complexion (think: dark spots, enlarged pores, and redness). After testing, we found that skin looked more luminous, smoothed, and dewy, making it the perfect option for those who love a fresh-faced glow. The only downside is that it comes in three shades. Price at time of publish: $45 Type: Hybrid | SPF: 50 | Additional Ingredients: Glycerin, Palmaria palmata extract | Size: 0.33 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\n\n\n\n\n\n\n\n\nBest Multi-Purpose Foundation PÜR 4-in-1 Pressed Mineral Makeup PÜR View On Amazon View On Ulta View On Target What We Like 26 shade options\n\nActs as foundation, concealer, powder, and SPF What We Don't Like Can settle into large pores Lightweight and easy to apply on the go, this pick from PÜR is great for stowing in your bag. Whether you use it as your first round of defense or as a way to re-apply as the day goes on, the mineral sunscreen-based product has a lot to offer. For one, it’s a concealer, foundation, pressed powder, and SPF, so you’re saving some space by keeping this one on hand. Secondly, we found that it does a wonderful job of soaking up oil and adding more sunscreen without an annoying white cast. Best of all, it soaks in right away, so you don’t have to worry about transfer or a powdery finish. Just be aware that some say it can settle into enlarged pores around the nose. Price at time of publish: $30 Type: Mineral | SPF: 15 | Additional Ingredients: Waltheria extract, Shea butter, Vitamin E | Size: 0.28 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\n\n\n\n\n\n\n\n\nBest Eyeshadow Supergoop! Shimmershade Illuminating Cream Eyeshadow SPF 30 Supergoop! View On Amazon View On Sephora View On Dermstore What We Like Shimmery and creamy\n\nComes in a cute little pot What We Don't Like The color payoff could be more bold We’ll be the first to admit that we often forget about protecting our eye skin from the sun. However, give us an eyeshadow with SPF infused into it, and we’ll never forget it again. Say hello to the very first eyeshadow with SPF 30: Supergoop!’s Shimmershade Illuminating Cream Eyeshadow. The creamy formula adds a subtle wash of shimmer across eyelids while simultaneously keeping them protected from harmful UV rays with SPF 30. It contains a unique hybrid of mineral and clean chemical sunscreen actives and blends perfectly across the delicate eyelid skin without creasing, flaking, or fading. During testing, we especially loved how dreamy and finger-friendly it is to use—you just swipe a bit of formula across your lids for a lit-from-within, glowy finish. It feels buttery to the touch and thanks to the super cute little pot packaging, it travels well, too. The only con worth noting is that the three different shade offerings are very natural and don’t have a bold payoff. Price at time of publish: $24 Type: Hybrid | SPF: 30 | Additional Ingredients: Mica, Sunflower seed oil, Jasmine flower extract | Size: 0.18 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\n\n\n\n\nBest Blush Colorescience Sunforgettable Total Protection Color Balm SPF 50 Colorscience View On Amazon View On Dermstore View On Walmart What We Like Smooth, creamy consistency\n\nEasy glide\n\nA little goes a long way What We Don't Like Can be very pigmented if you press too hard We’re all for a multi-use product, especially if it contains SPF 50 like this one. Highly pigmented and extra creamy, this flush-colored balm from Colorescience can be used to hydrate and protect lips, lids, and cheeks. The all-mineral formula contains zinc oxide, except without the white cast. In fact, each of the three shades—blush, berry, and bronze—is gorgeously pigmented and leaves behind a nice wash of blush or bronzer to warm up the skin. We tried using it in a few ways during testing (swiping it directly onto the skin, using a brush to blend it out, and even dabbing it on with a finger), and we can promise it lays beautifully no matter what. The only caveat: It can be very pigmented, so if you press too hard, the color payoff might be a little too much. Price at time of publish: $26 Type: Mineral | SPF: 50 | Additional Ingredients: Squalane, Candelilla wax, Mica | Size: 0.32 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\nByrdie / Jhett Thompson\n\n\n\n\n\n\n\n\n\nBest Tinted Lip Balm MDSolarSciences Hydrating Sheer Lip Balm SPF 30 MDSolarSciences View On Amazon View On Dermstore View On Target What We Like Creamy, non-sticky texture\n\nApplies evenly\n\nSubtle What We Don't Like Not for those who want bold or glossy lips It’s really hard to find a great tinted lip balm in general; when you throw SPF in the mix, it’s like looking for a needle in a haystack. This pick from MDSolarSciences pleasantly surprised us during testing and ended up coming out on top because of how subtle yet gorgeous it looked on lips. It’s not shiny—so it’s not a great option for those looking for a gloss, but it—and actually coats lips with comfortable hydration that lasts for hours. Not to mention, the color is subtle but lovely nonetheless. There are seven shades to choose from, ranging from clear and an apricot sheer tint called “Bare” to coral pink and ruby red. Price at time of publish: $23 Type: Mineral | SPF: 30 | Additional Ingredients: Shea butter, Avocado oil, Olive oils | Size: 0.15 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\n\n\n\n\n\n\n\n\nBest Plumping Lip Balm Sunnie Skin Plump It Lips Hyaluronic + SPF 30 Lip Plumper Sunnie Skin View On Sunnieskin.com What We Like Plumping and volumizing\n\nMoisturizing feel What We Like Can feel tingly If you’re looking for a lip balm to slightly plump and hydrate your lips, you can’t go wrong with the Sunnie Skin Plump It Lips. It contains chemical sunscreen filters, hyaluronic acid, and a proprietary complex of stimulating ingredients to double down on UV rays and dryness. In just a few swipes during testing, we noticed that lips looked softer and more voluptuous. The formula does tingle upon contact with the skin (so if you don’t like that feeling, this one may not be for you), but it does help lips appear more plump and rosy as a result. Price at time of publish: $45 Type: Chemical | SPF: 30 | Additional Ingredients: Shea butter, Avocado oil, Olive oils | Size: 0.15 oz. Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\nByrdie / Jhett Thompson\n\n\n\n\n\n\n\n\n\nBest Glossy Lip Balm Cay Skin Isle Lip Balm SPF 30 with Sea Moss and Aloe Stem Cells Cayskin View On Sephora View On Cayskin.com What We Like Imparts a pretty sheen\n\nHelps soften chapped lips What We Don't Like Can feel tacky A lip gloss that doubles as sun protection? Sign us up. This long-lasting formula from Cay Skin leaves a glossy sheen on the lips (in either clear, rose, or berry) that protects, softens, and tastes like vanilla brown sugar. During testing, we found that it compares to top lip oils on the market like the Clarins Lip Oil or the Dior Lip Oil because of how smoothly it goes on. It doesn’t require much reapplication, and even after eating and drinking, lips feel soft and supple. It can feel tacky and sticky (we noticed some flyaway hairs get stuck in the gloss while in the testing lab), but for this amount of shine, we’d say it’s entirely worth it. Price at time of publish: $14 Type: Chemical | SPF: 30 | Additional Ingredients: Shea butter, Aloe stem cells, Sea moss | Size: .35 oz Byrdie / Tamara Staples\n\nByrdie / Tamara Staples\n\nByrdie / Jhett Thompson\n\nByrdie / Jhett Thompson\n\n\n\n\n\n", "images": ["https://www.byrdie.com/thmb/LETmhymMgpfywpXhPog2-Yi9bQQ=/fit-in/1500x3366/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-la-mer-soft-moisture-powder-foundation-tstaples-11605-b2267ad33cf7454a930cb4ffae2b892a.jpg", "https://www.byrdie.com/thmb/BawHnJFTKm96ztuQHhBGqh-RJ4A=/fit-in/1500x4668/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-mdsolarsciences-hydrating-sheet-lip-balm-jthompson-0543-035d4002359f4c548f49707bb42bbbfc.jpg", "https://www.byrdie.com/thmb/GYQkCPhL0s6-nFa_2auQTIoh40Q=/fit-in/1500x3755/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-sunnie-skin-plump-it-lips-hyaluronic-acid-tstaples-11985-7f663230c22446419b19f8fe022fa04c.jpg", "https://www.byrdie.com/thmb/8dDmMv9FC8Va6uL2XwN8RJuOdoQ=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/Supergoop-PLAY-Lip-Balm-SPF-30-with-Acai-5c6a6c18f4204840994e24519def983f.jpg", "https://www.byrdie.com/thmb/0pIkZQfRdSIQ6ARHezVW5upUqk4=/fit-in/1500x4276/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-la-mer-soft-moisture-powder-foundation-tstaples-11603-05c41c67da11414f8b7dc963a11ae142.jpg", "https://www.byrdie.com/thmb/jCHfVsobuj-JU8YNQvtSiE_kDeA=/fit-in/1500x3932/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-supergoop-shimmershade-illuminating-cream-eyeshadow-tstaples-12833-ef0132a07f154b46a92fb302fe0af165.jpg", "https://www.byrdie.com/thmb/IobTraBvMcWxTYJ223VSolsz49E=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/mdsolarsciences-hydrating-sheer-lip-balm-spf-30--76bfac4aef8d4204baf67744afa4f948.jpg", "https://www.byrdie.com/thmb/SD-y_PqWs-2mEt_ZeTWR0Z8d2qc=/fit-in/1500x3827/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-colorscience-sunforgettable-total-protection-color-balm-50-tstaples-11826-26a166a4cf094ad4beca6735e414820c.jpg", "https://www.byrdie.com/thmb/MAC303Bsb6AK2sdK31SEt_lkWEs=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/bareminerals-original-loose-powder-foundation-05f91999d9a145bf8f239a438a7c7db1.jpg", "https://www.byrdie.com/thmb/S1hQnTL6z-Vc00i0OH4LN_IMaxE=/fit-in/1500x5657/filters:no_upscale():max_bytes(150000):strip_icc()/byr-product-sunnie-skin-plump-it-lips-hyaluronic-acid-jthompson-0418-202472099ccf40e98c59225c7247b26e.jpg", "https://www.byrdie.com/thmb/-UrMH6xI1OFKSrAbXKppEC6VPDM=/fit-in/1500x3827/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-dior-dreamskin-fresh-perfect-cushion-broad-spectrum-50-tstaples-12457-d12141b76d7f45d7b1da540c1d9faef2.jpg", "https://www.byrdie.com/thmb/QyWHn1mqpCPhk58IzYFj_YRGjCQ=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-supergoop-unseen-sunscreen-jkim-0361-5f579125044443a5b6c7afbf38881f96.jpg", "https://www.byrdie.com/thmb/GBgSf-jVy5TDa2ZMBmZniPvHvR8=/fit-in/1500x3957/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-cay-skin-isle-lip-balm-30-sea-moss-aloe-stem-cells-tstaples-11910-4485ff6842504ba2aea5d09e9a21348c.jpg", "https://www.byrdie.com/thmb/q4v0pvkhP91oysyQRv5cBGRX8O4=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/IT-Cosmetics-Your-Skin-But-Better-CC-Cream-3-30c10d082b904f828226eaa77a7e8e79.jpg", "https://www.byrdie.com/thmb/Ge1OeBOqmVYjZzhN5OMdQ1Qs6Ew=/fit-in/1500x5621/filters:no_upscale():max_bytes(150000):strip_icc()/byr-product-supergoop-play-lip-balm-spf-30-acai-jthompson-0490-626589e5c5534c8cacf81b799838b366.jpg", "https://www.byrdie.com/thmb/1OTJOo37cWvaK_wcqpQIt_RyP5s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/byr-primary-makeup-spf-jthompson-0602-f20c6037f3d34e569a778e60cf4d54d8.jpeg", "https://www.byrdie.com/thmb/JKJR8vqckf0VCgZ_MJJKKgi16Ps=/fit-in/1500x3871/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-bareminerals-original-loose-powder-foundation-jthompson-0590-1d35341a05e14a83a671eea654492e2d.jpg", "https://www.byrdie.com/thmb/I_Ce3pFTND0KtxLC-wTQobuOs5Q=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/best-lip-tints-and-stains-of-2023-tout-eac39748e3f24627987888bda3503c57.jpg", "https://www.byrdie.com/thmb/YFBUruj9XWkR9IogcZN6PRMctgw=/fit-in/1500x3957/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-cay-skin-isle-lip-balm-30-sea-moss-aloe-stem-cells-tstaples-11905-95661ec5b3504c76937f76a921f47e61.jpg", "https://www.byrdie.com/thmb/CPDSadYBm-H2EFGLJhSP-_QPMCA=/fit-in/1500x5124/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-cay-skin-isle-lip-balm-spf-30-with-sea-moss-aloe-stem-cells-jthompson-0584-601e9b1c4d0843f7a6edd9c9ea658e5f.jpg", "https://www.byrdie.com/thmb/cl4Gk3xO6zWGgr6Qv1uOI9SjRhc=/fit-in/1500x3780/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-dior-dreamskin-fresh-perfect-cushion-broad-spectrum-50-tstaples-12414-dcb5f49120094d769c221d5ce1c0b1f3.jpg", "https://www.byrdie.com/thmb/zQcPat7KiV7f6mMu8zYguQsJFK0=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/the-best-affordable-sunscreens-tout-e1986437785c4f2f8736bf3e2048c6c7.jpg", "https://www.byrdie.com/thmb/-qCtfEjP6mOZBSqiyEYMUKFZQTo=/fit-in/1500x3823/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-bareminerals-original-loose-powder-foundation-tstaples-11799-34267fb7186b487f9ffa40fd2a1bb6b6.jpg", "https://www.byrdie.com/thmb/-NjfJQSX6ETO2lbtnyspqjUEWl4=/fit-in/1500x3600/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-mdsolarsciences-hydrating-sheet-lip-balm-tstaples-11814-544cb05354c343349a20bb1f85d3a43b.jpg", "https://www.byrdie.com/thmb/QyBIkHnA5ZrpyuCMeIjPndvdDCQ=/fit-in/1500x4376/filters:no_upscale():max_bytes(150000):strip_icc()/BYR-it-cosmetics-cc-cream-with-spf-50-jhett-0080-db180f3dec6c4bc7ba71c023150497d1.jpg", "https://www.byrdie.com/thmb/iLrPh4NIrcwz6WN9i-lAMtP_IOE=/fit-in/1500x3823/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-mdsolarsciences-hydrating-sheet-lip-balm-tstaples-11785-24a153ddd4124459a9544200bc4e274d.jpg", "https://www.byrdie.com/thmb/yx6xk027Ut9mvmMf5ht_9VZn1oE=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/BYR-Group-Tinted-MoINSterizers-tamara-staples-2.jpg-e28c9fa029a042b9aa5e04aecb7e267d.jpg", "https://www.byrdie.com/thmb/uWx3JX8K3lMzmAfaGptYpHduP0c=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/la-mer-the-soft-moisture-powder-foundation-daad922ad87e4ed296fc55168ee98943.jpg", "https://www.byrdie.com/thmb/TSKBhAh3YSoaIOVDjPJkti87wWE=/fit-in/1500x3843/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-la-mer-soft-moisture-powder-foundation-tstaples-11600-c8a2dfbc81c24756b068b9e8229a5540.jpg", "https://www.byrdie.com/thmb/9n3PJiaGDt3t-JlTBc2PJubTedI=/fit-in/1500x3827/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-dior-dreamskin-fresh-perfect-cushion-broad-spectrum-50-tstaples-12458-2cbe0e84289a4cb59bda3cc4072af3d4.jpg", "https://www.byrdie.com/thmb/QGr0AKd11PWtj5XIs9hEz6AdG4U=/fit-in/1500x5274/filters:no_upscale():max_bytes(150000):strip_icc()/byr-product-dior-dreamskin-fresh-perfect-cushion-broad-spectrum-spf-50-jthompson-0488-85d3d87e8eee4691b272e95522a6dc9e.jpg", "https://www.byrdie.com/thmb/rUW23whGI8kjvPOTwWoEIKQmI5A=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/supergoop-tout-497637cc902145b0a3b8463d12327e83.jpg", "https://www.byrdie.com/thmb/UV1hqktpMcFWdZG6c67N0AeWFoQ=/fit-in/1500x5095/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-sunnie-skin-plump-it-lips-hyaluronic-acid-jthompson-0533-213dbbc79a59437d81761b430fdcf202.jpg", "https://www.byrdie.com/thmb/PF3Kwg-87_Dhr80LZP4oBhIJzn4=/fit-in/1500x3932/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-supergoop-shimmershade-illuminating-cream-eyeshadow-tstaples-12828-88f30377155046ffaa1adb6bec17446f.jpg", "https://www.byrdie.com/thmb/uIoOhXwm1Tg0Rr1-9JeFmoLNypc=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byrdie-update-best-drugstore-moisturizers-with-spf-tout-d6760656fac947218e34489afa736d06.jpg", "https://www.byrdie.com/thmb/rTuAoHXKAeGj1cgp0bPGuDQuJcw=/fit-in/1500x5636/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-supergoop-play-lip-balm-spf-30-acai-jthompson-0586-2407552af162473ea4477432bbc2f913.jpg", "https://www.byrdie.com/thmb/GblbXtmk18ynTQ8AN2apro9YMvY=/fit-in/1500x3932/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-supergoop-shimmershade-illuminating-cream-eyeshadow-tstaples-12825-e93802b62a4c4f0999077088a4c4b20d.jpg", "https://www.byrdie.com/thmb/3JEk5KX3AwNc-Ig6fyqqBSNLIhQ=/fit-in/1500x3194/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-mdsolarsciences-hydrating-sheet-lip-balm-tstaples-11973-dcf87176571147e8a224e072c27e34e8.jpg", "https://www.byrdie.com/thmb/qsVOs98xc19PfkQcEf9deZKmn5I=/fit-in/1500x2604/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-pur-4-1-pressed-mineral-tstaples-12279-e5d4140d67ae41afa308b2664db20f01.jpg", "https://www.byrdie.com/thmb/-rJ2YvZ8lxSw3DxtmJ63kHJlvbc=/fit-in/1500x3479/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-pur-4-1-pressed-mineral-tstaples-12274-45b3de9bb8754cec960386453a6cb9ce.jpg", "https://www.byrdie.com/thmb/hDel7lwns2v6zTMsBEjsm7jSF0w=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/lip-balms-tout-b0300a93c0b44aa59aab74e86ed2dbc5.jpg", "https://www.byrdie.com/thmb/scK7mJAMYAAi1kj6GGB-EFVqKmI=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/colorscience-sunforgettable-total-protection-color-balm-spf-50-b735089675b0421fac5a3183db9cd74b.jpg", "https://www.byrdie.com/thmb/jHjMfPXvlJB5rGWjX8ks2lOgkgA=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/it-cosmetics-cc--cream-393d2ab65c6545ed993e7edb915bf5bc.jpg", "https://www.byrdie.com/thmb/99nqdhrPg-ebp029ml5ZErjpIr4=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/Best-Powder-Sunscreens-Byrdie-Tout-f3ac81390c204b8b8eabfa243a83e516.jpg", "https://www.byrdie.com/thmb/XLR2Rj9KdseTQv3MYbd4j0MmqJU=/fit-in/1500x3757/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-supergoop-play-lip-balm-spf-30-acai-tstaples-11751-7cac7dc96b6241b380aad32bbe31673a.jpg", "https://www.byrdie.com/thmb/HGNX5EOQn85K9LKm6SbF2yanZIg=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/Web_1500-testing-cc-creams-IT-Cosmetics-CC-Cream-with-SPF-50-leticia-almeida-1008-a4a210bb695a4fa69fd01060d695365e.jpg", "https://www.byrdie.com/thmb/C8gyxH2Syqxlcnu_43IhJ7pKALc=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/supergoop-shimmershade-illuminating-cream-eyeshadow-e7b89205a9fd4301bfb969955fcd2f81.jpg", "https://www.byrdie.com/thmb/kexrUYVRcFd5PN0IsDjOqck6d9M=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byrdie-update-best-face-moisturizers-for-men-tout-8bf79f55aeeb4d7dbcc1ea390ddc77ae.jpg", "https://www.byrdie.com/thmb/jgq71MkDQRu1yj62PI3ROieEtGs=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/IT-Cosmetics-Your-Skin-But-Better-CC-Cream-2-f5d8f033c2a347cf9f2774c052f343b8.jpg", "https://www.byrdie.com/thmb/iWSojd-3-b3ZaydyXxL8wIS71Q8=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/ScreenShot2021-06-09at5.08.21PM-44a830fbe12c47dfa332f895c05b6358.png", "https://www.byrdie.com/thmb/KG6p6p3KKRktPTG0JCnjPQfOV9s=/fit-in/1500x3823/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-mdsolarsciences-hydrating-sheet-lip-balm-tstaples-11780-2849b51ce74848bda675a7316e9885e3.jpg", "https://www.byrdie.com/thmb/D38zaK_NqKYvDQAYwMhSE9USmtM=/fit-in/1500x3780/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-dior-dreamskin-fresh-perfect-cushion-broad-spectrum-50-tstaples-12413-e12c7fb566d64ea9b81b1472af94d66f.jpg", "https://www.byrdie.com/thmb/0Qh5VmB3jwD2Q7K4DRvwPImZXwU=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/cay-skin-isle-lip-balm-spf-30-2a8ca1e8230c48da86b32ca41cfb038a.jpg", "https://www.byrdie.com/thmb/ep5JqExOGF06oxf-H_HfKSzK6yE=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-hero-cosmetics-superlight-sunscreen-jkim-0105-a775f9f29c4145188c36b01fa52c187b.jpg", "https://www.byrdie.com/thmb/lNFXV4R3qRSSKoXcw5ccIt4zaWo=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byrdie-update-best-korean-sunscreens-tout-61412b68f1e147dbbfe0d87f21cd8065.jpg", "https://www.byrdie.com/thmb/Oin666r3N0Fjscb_QSks8lsg3tg=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/best-lip-balms-with-spf-tout-b8e9fa8005cc4ef09b44909700856b7e.jpg", "https://www.byrdie.com/thmb/7B0yzLvw6n5KyKn5OVr5-WcFe_k=/fit-in/1500x4196/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-colorscience-sunforgettable-total-protection-color-balm-50-tstaples-11715-fbb76527805f4c3294b58216cba2215c.jpg", "https://www.byrdie.com/thmb/Klw-7NW7jjDIrNJBnnUA2fYjBT8=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/8-best-sunscreens-for-dark-skin-tout-505c337ac43f4ced8d115f5c18d914a1.jpg", "https://www.byrdie.com/thmb/nDrRWtGjvfvR9_qKc3JyZUOK47E=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/byr-primary-face-moisturizer-spf-tstaples-144-b7038a9d321e4861b950a914adfb463f.jpg", "https://www.byrdie.com/thmb/c9Oif1TiHEqq2BUtJu8Tk83bm7M=/fit-in/1500x5074/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-colorscience-sunforgettable-total-protection-color-balm-spf-50-jthompson-0597-c82180b5ee77425291fe1eaa581c4153.jpg", "https://www.byrdie.com/thmb/p42Uz6PR-QNMIhH9dpyJUfvB_IA=/fit-in/1500x3769/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-sunnie-skin-plump-it-lips-hyaluronic-acid-tstaples-11980-a2ad3c63952048dba27267078ca7cd49.jpg", "https://www.byrdie.com/thmb/IbzJfzmPjphBcHRhE9qzNrbsEwU=/fit-in/1500x3504/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-bareminerals-original-loose-powder-foundation-tstaples-11812-f17a18b148b441658e07e371efe80089.jpg", "https://www.byrdie.com/thmb/3YwVXNqRJtRsF2TWcb73u1nJuOY=/fit-in/1500x5621/filters:no_upscale():max_bytes(150000):strip_icc()/byr-product-cay-skin-isle-lip-balm-spf-30-with-sea-moss-aloe-stem-cells-jthompson-0498-cd0937b4dfea449caa70f39dd64a4bf4.jpg", "https://www.byrdie.com/thmb/pFDc89mRSLD-Loqts6146gsNQk0=/200x200/filters:no_upscale():max_bytes(150000):strip_icc()/Caitlyn-Martyn-2000-27cb36b5187f4a88aff33510d3f11587.jpg", "https://www.byrdie.com/thmb/nKUYkYZ7imiHRp0CatJGXgyfyOc=/fit-in/1500x3321/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-supergoop-play-lip-balm-30-acai-tstaples-11760-aaa243361255401f9a5b91318250d80e.jpg", "https://www.byrdie.com/thmb/30XWInLfJOfaO9Av3LD8cXjp-XA=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/pur-4-in-1-pressed-mineral-makeup-86482f8e2632473da975d49eddb0a651.jpg", "https://www.byrdie.com/thmb/dajzrv1uLVy0G6lfMVsqkPoq3yY=/fit-in/1500x3821/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-pur-4-1-pressed-mineral-tstaples-12217-444f47514017487a9db2491f48a3bd51.jpg", "https://www.byrdie.com/thmb/EU03ObCfS65A5m8Ea3MRjSVGEhI=/fit-in/1500x3236/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-colorscience-sunforgettable-total-protection-color-balm-50-tstaples-11859-e4f591a9b5c84a84bde55139e1c99476.jpg", "https://www.byrdie.com/thmb/2hubz78q8GcDxSo_iAPC5Mnk1QM=/fit-in/1500x3755/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-sunnie-skin-plump-it-lips-hyaluronic-acid-tstaples-11987-4b937588dde24c2a82a25c6df4cdc430.jpg", "https://www.byrdie.com/thmb/SQ81wqksaiq78htUx8NqflEk7ek=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/best-zinc-oxide-sunscreens-4687640-recirc-bbb67d8e3a4246b98f89281630e7592b.jpg", "https://www.byrdie.com/thmb/9CxRpX6acIm5zI7clPWCGbGcJns=/fit-in/1500x5115/filters:no_upscale():max_bytes(150000):strip_icc()/byr-product-colorscience-sunforgettable-total-protection-color-balm-spf-50-jthompson-0529-8a0ffc6bd91942cca790a59b2b9db547.jpg", "https://www.byrdie.com/thmb/RC4BwI56QcvkSSBb-Kb3k732dHQ=/fit-in/1500x3823/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-bareminerals-original-loose-powder-foundation-tstaples-11791-59f5e8b7c2e84807ae6a018ef22e265f.jpg", "https://www.byrdie.com/thmb/lBoXXHDquYnwY_aW_5903Sm4EP8=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/sunnie-skin-plump-it-lips-w-hyaluronic-acid-b429359a1a9649ca91acffacf68023ae.jpg", "https://www.byrdie.com/thmb/Fk-TqFPoUd9-XHZHCrL5yg8d9Lw=/fit-in/1500x4779/filters:no_upscale():max_bytes(150000):strip_icc()/byr-detail-pur-4-1-pressed-mineral-makeup-jthompson-0553-1b0d84e6e14b4d3597f712fb311ec26d.jpg", "https://www.byrdie.com/thmb/RhbqBCJ1gp1ANFSzTOJZgXTXWWQ=/fit-in/1500x3484/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-la-mer-soft-moisture-powder-foundation-tstaples-11619-602ebcfb49e24ce5afb01cf16dc39262.jpg", "https://www.byrdie.com/thmb/ZGVbKVSQAqJaa9ksdbWTii1F_r4=/fit-in/1500x4233/filters:no_upscale():max_bytes(150000):strip_icc()/byr-makeup-spf-test-pur-4-1-pressed-mineral-tstaples-12219-6d7d0add35b042b48270287edc242797.jpg", "https://www.byrdie.com/thmb/wq47reYY7W0NivWzTPBakvOkyfA=/fit-in/1500x1000/filters:no_upscale():max_bytes(150000):strip_icc()/Dior-Dreamskin-Fresh--Perfect-Cushion-Broad-Spectrum-SPF-50-0a977ae7e359413fa9c958b1f72dc2b2.jpg", "https://www.byrdie.com/thmb/gY0jrnXjeQA_28f3N9i0DnNovDA=/300x240/filters:no_upscale():max_bytes(150000):strip_icc()/update-byrdie-best-skincare-products-for-men-tout-e2a0d86c67794527a98700fcaae7fd47.jpg"], "top_img": "https://www.byrdie.com/thmb/1OTJOo37cWvaK_wcqpQIt_RyP5s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/byr-primary-makeup-spf-jthompson-0602-f20c6037f3d34e569a778e60cf4d54d8.jpeg", "keywords": [], "authors": ["Caitlyn Martyn", "Caitlyn Martyn Is A New York-Based Beauty", "Style Writer For Byrdie. Before Joining Byrdie", "Caitlyn Was The Associate Beauty Editor At L Oréal S Makeup.Com", "Skincare.Com", "Where She Wrote Articles", "Learned Everything There Is To Know About Makeup", "Skincare", "Byrdie'S Editorial Guidelines"], "canonical_link": "https://www.byrdie.com/best-makeup-with-spf-7370381", "title": "The 11 Best Makeup Products with SPF of 2023", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Makeup products with SPF offer all the benefits of regular makeup, except with added SPF protection. We tested 23 of the most popular options, spanning foundation, eyeshadow, blush, and lip products, to land on the 11 best makeup products with SPF.", "emailcontenttype": "LISTSC", "emailvertical": "BYRDIE", "sailthru.author": "Caitlyn Martyn", "sailthru.tags": "makeup", "parsely-section": "Makeup", "parsely-tags": "News,Celebrities,What to Buy ,Makeup,Product Reviews,affiliate", "revenuegroup": "COMMERCE", "article": {"section": "Byrdie"}, "fb": {"app_id": 166036133580911}, "og": {"type": "article", "site_name": "Byrdie", "url": "https://www.byrdie.com/best-makeup-with-spf-7370381", "title": "The 11 Best Makeup Products with SPF of 2023", "description": "Makeup products with SPF offer all the benefits of regular makeup, except with added SPF protection. We tested 23 of the most popular options, spanning foundation, eyeshadow, blush, and lip products, to land on the 11 best makeup products with SPF.", "image": "https://www.byrdie.com/thmb/1OTJOo37cWvaK_wcqpQIt_RyP5s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/byr-primary-makeup-spf-jthompson-0602-f20c6037f3d34e569a778e60cf4d54d8.jpeg"}, "twitter": {"card": "summary", "site": "@ByrdieBeauty", "title": "The 11 Best Makeup Products with SPF of 2023", "description": "Makeup products with SPF offer all the benefits of regular makeup, except with added SPF protection. We tested 23 of the most popular options, spanning foundation, eyeshadow, blush, and lip products, to land on the 11 best makeup products with SPF.", "image": "https://www.byrdie.com/thmb/1OTJOo37cWvaK_wcqpQIt_RyP5s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/byr-primary-makeup-spf-jthompson-0602-f20c6037f3d34e569a778e60cf4d54d8.jpeg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.331.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.331.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.331.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.331.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.331.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.byrdie.com", "summary": ""}