{"url": "en.wikipedia.org/wiki/Dennis_Quaid", "text": "American actor (born 1954)\n\nDennis William Quaid (born April 9, 1954)[1] is an American actor. He is known for his leading man roles in film and television. The Guardian named him one of the best actors never to have received an Academy Award nomination.[2]\n\nQuaid is known for his starring roles in Breaking Away (1979), The Right Stuff (1983), The Big Easy (1986), Innerspace (1987), Great Balls of Fire! (1989), Dragonheart (1996), The Parent Trap (1998), Frequency (2000), The Rookie (2002), The Day After Tomorrow (2004), In Good Company (2004), Yours, Mine & Ours (2005), and Vantage Point (2008). He received a Golden Globe Award nomination for his role in Far from Heaven (2002).\n\nQuaid also acted in Jaws 3-D (1983), Come See the Paradise (1990), Any Given Sunday (1999), Traffic (2000), American Dreamz (2006), Footloose (2011), Playing for Keeps (2012), Truth (2015), Midway (2019), and Strange World (2022). He portrayed President Bill Clinton in the HBO film The Special Relationship (2010) for which he earned nominations for a Primetime Emmy Award, Golden Globe Award and Screen Actors Guild Award. He also portrayed Deputy US Marshal Sherrill Lynn in the Paramount+ western series Lawmen: Bass Reeves(2023).\n\nEarly life and education [ edit ]\n\nDennis William Quaid was born in Houston, Texas, the son of Juanita Bonnie Dale \"Nita\" (née Jordan), a real estate agent, and William Rudy Quaid (1923–1987), an electrician. He has English, Irish, Scots-Irish, and Cajun (French) ancestry.[3] Through his father, he is a first cousin, twice removed, of cowboy performer Gene Autry.[4] Quaid attended Paul W. Horn Elementary School in Bellaire and Pershing Middle School in Houston. He studied Mandarin and dance at Bellaire High School in Bellaire, Texas, and later in college, at the University of Houston, under drama coach Cecil Pickett, who had previously taught at Bellaire High and whose daughter is actress Cindy Pickett. Quaid was raised in the Baptist faith.[5][6] He is the younger brother of actor Randy Quaid.\n\nCareer [ edit ]\n\n1979–1982: Early roles [ edit ]\n\nQuaid dropped out of the University of Houston before graduating and moved to Hollywood to pursue an acting career.[3] He made his film debut in an uncredited role in the action comedy film Crazy Mama (1975) starring Cloris Leachman. He then acted in the psychological drama I Never Promised You a Rose Garden (1977) and the drama September 30, 1955 (1977). He initially had trouble finding work but began to gain notice after appearing in the comedy Breaking Away (1979) and the musical drama The Night the Lights Went Out in Georgia (1981),[7] During this time he appeared in numerous films such as the drama film Our Winning Season (1978), the comedy film The Seniors (1978), the romantic comedy All Night Long (1981), and the slapstick comedy Caveman (1981). He portrayed outlaw Ed Miller in the Walter Hill directed Western drama The Long Riders (1980). He had an extra at a graduation ceremony in the Ivan Reitman directed comedy Stripes (1981) starring Bill Murray.\n\n1983–2002: Stardom and acclaim [ edit ]\n\nKnown for his grin,[8] Quaid has appeared in both comedic and dramatic roles.[3] Quaid's breakout role was for his portrayal of astronaut Gordon Cooper in the critically acclaimed Philip Kaufman directed historical epic The Right Stuff (1983).[3] The film received positive reviews earning an Academy Award for Best Picture nomination. Critic Roger Ebert praised the film writing, \"It contains uniformly interesting performances\" naming Quaid, Ed Harris, Scott Glenn, and Fred Ward. Also that year He had starring roles in the films such as the horror film Jaws 3-D (1983) and romantic sports drama Tough Enough acting alongside Pam Grier. He later acted in the science fiction films Dreamscape (1984) and Enemy Mine (1985) and Innerspace (1987).\n\nIn 1987 he starred in the neo-noir romance thriller The Big Easy (1987) opposite Ellen Barkin. Hal Hinson of The Washington Post praised his performance comparing him to Jack Nicholson writing, \"The same is true for Quaid. A gator grin spreading over his face, Quaid is so unabashedly full of himself that you get swept up in his enthusiastic high spirits. He's a life-giver, like Nicholson.\"[9] For his performance he received a nomination for the Independent Spirit Award for Best Male Lead. He also achieved acclaim for his portrayal of Jerry Lee Lewis in Great Balls of Fire! (1989) acting alongside Winona Ryder.[3] In 1989, Quaid also appeared throughout the Bonnie Raitt music video for the song \"Thing Called Love.\"[10]\n\nQuaid's career lost steam in the early 1990s after he fought anorexia nervosa brought on when he lost 40 pounds to play the tuberculosis-afflicted Doc Holliday in the Western drama Wyatt Earp (1994) [11] and recovered from a cocaine addiction.[3] However, Quaid continued to garner positive reviews in a variety of films.[3] He was also the guest star of a season 2 episode of Muppets Tonight (1997). He starred in the lead role in the 1996 adventure film Dragonheart, the remake of The Parent Trap (1998) directed by Nancy Meyers, playing the part of the twins' father, and as an aging pro football quarterback in Oliver Stone's Any Given Sunday (1999) and in the science fiction film Frequency (2000). In 1998, Quaid made his debut as a film director with Everything That Rises, a television movie western in which he also starred.[12]\n\nIn 2000 he acted in Steven Soderbergh's crime drama Traffic which received critical acclaim. Quaid earned a nomination for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture along with the ensemble. Quaid gained acclaim for his role in the Norman Jewison directed HBO film Dinner with Friends (2001). The film is based on the Donald Margulies play of the same name. He acted alongside Andie MacDowell, Greg Kinnear, and Toni Colette. In 2002 he portrayed former baseball pitcher Jim Morris in the Walt Disney sports drama The Rookie (2002). Also that year he earned acclaim for his role as the closeted husband Frank Whitaker during the 1950s in the Todd Haynes directed romantic period film. Quaid acted alongside Julianne Moore and earned a nomination for the Golden Globe Award for Best Supporting Actor – Motion Picture after winning the Independent Spirit Award and the New York Film Critics Circle Award.\n\n2003–present: Established actor [ edit ]\n\nHe then acted in films of various genres such as the thriller Cold Creek Manor (2003), the survival drama Flight of the Phoenix (2004), the war film The Alamo (2004), the romantic comedy In Good Company (2004), the disaster film The Day After Tomorrow (2004), and the family comedy Yours, Mine & Ours (2005). He played the president in the political comedy American Dreamz (2006) with Hugh Grant, Mandy Moore, Marcia Gay Harden, and Willem Dafoe. In 2008 he acted in the political action thriller Vantage Point (2008) alongside Sigourney Weaver, William Hurt, and Forest Whitaker. That same year he portrayed football coach Ben Schwartzwalder in the sports drama The Express: The Ernie Davis Story (2008). In 2009 he portrayed General Clayton M. Abernathy / Hawk in G.I. Joe: The Rise of Cobra (2009). He also acted in Pandorum (2009) and guest starred in an episode of SpongeBob SquarePants, playing Mr. Krabs' grandfather, Captain Redbeard.\n\nQuaid with cast from Midway in 2019\n\nQuaid returned to television portraying U.S. President Bill Clinton, alongside Michael Sheen as Tony Blair and Hope Davis as Hillary Clinton, in the HBO film The Special Relationship (2009). He received acclaim as well as nominations for the Primetime Emmy Award for Outstanding Lead Actor in a Limited or Anthology Series or Movie as well as a Golden Globe Award and a Screen Actors Guild Award. In 2012 and 2013, Quaid played Sheriff Ralph Lamb in the CBS TV drama series Vegas. In 2015 he made guest appearances playing Lucky Luciano in Drunk History and a Chief and a Judge in Inside Amy Schumer. From 2015 to 2016 he played Samuel Brukner in the Crackle series The Art of More. He played Michael Lennox in the British series Fortitude in 2017 and Wade Blackwood in the Amazon Prime legal series Goliath in 2019.\n\nIn 2017, Quaid starred in A Dog's Purpose as Ethan Montgomery, billed as \"a celebration of the special connection between humans and their dogs\".[13] The following year, Quaid starred in I Can Only Imagine, where he played Arthur Millard, the father of singer and songwriter Bart Millard, and Kin, where he plays Hal, the father of the film's two protagonists. In 2019, he portrayed Vice Admiral William 'Bull' Halsey in the war drama Midway. In 2023 he voiced a leading role in the Walt Disney Animated film Strange World. That same year he starred in the sports drama The Hill (2023).\n\nIn March 2018, it was confirmed by director Sean McNamara that Quaid would portray President Ronald Reagan in an upcoming biopic, titled Reagan,[14] this would be the second time Quaid portrayed a U.S. president.[15] The film was slated to have a summer 2019 release; however, it is still in pre-production [14] and was scheduled to begin filming in May 2020, but was stopped and postponed due to the COVID-19 pandemic.[16]\n\nPersonal life [ edit ]\n\nRelationships and children [ edit ]\n\nQuaid has been married four times and has three children.\n\nHe met his first wife, actress P. J. Soles, on the set of the film Our Winning Season.[17] They were married in 1978 and divorced in 1983.[18]\n\nOn February 14, 1991, he married actress Meg Ryan. Quaid and Ryan fell in love during the shooting of their second film together, D.O.A.[19] They have a son, Jack Henry Quaid (born 1992).[20] Quaid and Ryan announced their separation on June 28, 2000, saying they had been separated six weeks by then.[19] Their divorce was finalized in July 2001.[21]\n\nQuaid dated model Shanna Moakler from February to October 2001.[22][23]\n\nHe married Texas real-estate agent Kimberly Buffington on July 4, 2004, at his ranch in Paradise Valley, Montana.[24] They have fraternal twins who were born via a surrogate on November 8, 2007, in Santa Monica, California.[25][26]\n\nOn November 18, 2007, hospital staff mistakenly gave Quaid's ten-day-old twins a dosage of heparin (a blood thinner) that was 1,000 times the common dosage for infants.[27][28] The babies recovered, but Quaid filed a lawsuit against the drug manufacturer, Baxter Healthcare, claiming that packaging for the two doses of heparin are not different enough.[29] In May 2008, the Quaids testified before the United States House Committee on Oversight and Government Reform, asking U.S. Congress not to preempt the right to sue drug manufacturers for negligence under state law.[30] This incident led Quaid to become a patient-safety advocate, producing a series of documentaries on preventable medical errors that aired on the Discovery Channel[31][32] as well as co-authoring a medical journal article addressing the positive influence of patient stories in motivating change in healthcare.[33] The first documentary, Chasing Zero: Winning the War on Healthcare Harm, aired on the Discovery Channel in 2010,[31][32] and the second documentary, Surfing the Healthcare Tsunami: Bring Your Best Board, aired on the Discovery Channel in 2012.[34][35][36][37]\n\nBuffington filed for divorce from Quaid in March 2012.[38] Buffington's attorney then withdrew the divorce papers on April 26, 2012.[39] That summer, Quaid and Buffington moved to California.[40] In October 2012, he and Buffington again decided to separate, and Buffington filed for legal separation, seeking joint legal and sole physical custody of the twins.[41] After waiting to establish the required six months of residency in California, Quaid filed for divorce on November 30, 2012, asking for joint legal and physical custody of the children and offering to pay spousal support to Buffington.[40] They then reconciled and the divorce was dismissed by September 2013.[42] On June 28, 2016, the couple announced in a joint statement that they were divorcing, with Buffington asking for full physical custody and joint legal custody.[43] The divorce was finalized on April 27, 2018.\n\nFollowing his separation from Buffington, Quaid dated model Santa Auzina from July 2016 to 2019.[44][45][46]\n\nOn October 21, 2019, Quaid confirmed his engagement to Laura Savoie.[47] After postponing their original wedding date due to the COVID-19 pandemic,[16] they got married on June 2, 2020, in Santa Barbara.[48]\n\nReligion [ edit ]\n\nQuaid is a Christian, writing the Christian song \"On My Way to Heaven\" dedicated to his mother and included in the film I Can Only Imagine, in which he starred.[49]\n\nInterests [ edit ]\n\nIn addition to acting, Quaid is a musician and plays with his band, the Sharks. He wrote and performed the song \"Closer to You\" in the film The Big Easy (1987). He also has a pilot's license and owned a Cessna Citation.[50] He is also a one-handicap golfer, and in 2005, he was named as the top golfer among the \"Hollywood set\" by Golf Digest magazine.\n\nQuaid is a fan of the Houston Astros, and after the team's 2005 National League Championship-winning season, he narrated their commemorative DVD release. After the filming of The Express: The Ernie Davis Story, Quaid went to Cleveland Browns Stadium to dedicate Davis's jersey.\n\nQuaid began podcasting in 2020. He started The Pet Show with Dennis Quaid and Jimmy Jellinek. Its first episode premiered on July 10, 2020.[51] During that podcast, Quaid learned of a cat in Lynchburg, Virginia also named Dennis Quaid.[52] He adopted the cat and flew it out to California to live at his recording studio.[53]\n\nSubstance use [ edit ]\n\nThere have been extensive stories about Quaid's past abuse of cocaine. In a candid 2002 interview with Larry King on his talk show, after King asked about his motives for using drugs, Quaid responded, \"Well, you got to put it in context. Back in the late 1960s, early 1970s. That was back during the time where, you know, drugs were going to expand our minds and everybody was experimenting and everything. We were really getting high, we didn't know it. And cocaine at that time was considered harmless. You know. I remember magazine articles in People Magazine of doctors saying it is not addicting. It is just—alcohol is worse. So I think we all fell into that. But that's not the way it was.\"\n\nWhen asked if he believed he had ever been addicted to the drugs, Quaid responded, \"It was a gradual thing. But it got to the point where I couldn't have any fun unless I had it. Which is a bad place to be.\" Later in the interview, he said, \"But I saw myself being dead in about five years if I didn't stop.\"[54]\n\nPolitical views [ edit ]\n\nIn a 2018 interview with the New York Post, Quaid stated he was a registered Independent and has voted for both Democratic and Republican candidates, saying that he did not consider himself an adherent to any particular ideology; though he did opine that Ronald Reagan was his favorite president of his lifetime.[55] In April 2020, during the COVID-19 pandemic, Quaid stated that President Donald Trump was handling the pandemic well, calling him \"involved\".[56] Quaid subsequently recorded an interview with infectious disease expert Anthony Fauci as part of an advertising campaign by the Department of Health and Human Services to \"defeat despair\" surrounding COVID-19.[57]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nTheatre [ edit ]\n\nAwards and nominations [ edit ]\n\nFor his role in Far from Heaven (2002) he won the New York Film Critics Circle Award for Best Supporting Actor, the Chicago Film Critics Association Award for Best Supporting Actor, the Online Film Critics Society Award for Best Supporting Actor and the Independent Spirit Award for Best Supporting Male. He received nominations for Best Supporting Actor from the Golden Globe Awards, the Phoenix Film Critics Society Awards and the Screen Actors Guild Awards. Quaid was also honored with a Distinguished Alumni Award from his alma mater, the University of Houston, in April 2012.[citation needed]\n\nReferences [ edit ]\n\nFurther reading [ edit ]", "images": ["http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/1c/Wiki_letter_w_cropped.svg/20px-Wiki_letter_w_cropped.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/220px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7b/Jobeth_Devera%2C_Dennis_Quaid%2C_Woody_Harrelson%2C_Jennifer_Lahmers_and_Patrick_Wilson.jpg/220px-Jobeth_Devera%2C_Dennis_Quaid%2C_Woody_Harrelson%2C_Jennifer_Lahmers_and_Patrick_Wilson.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/1200px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/1200px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Dennis_Quaid", "title": "Dennis Quaid", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Dennis_Quaid_2020_by_Glenn_Francis.jpg/640px-Dennis_Quaid_2020_by_Glenn_Francis.jpg", "width": 640, "height": 960}, "title": "Dennis Quaid - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}