{"url": "https://web.archive.org/web/20220901032841/https://www.amazon.com/Ken-Commandments-Search-God-Hollywood-ebook/dp/B01N7Q88GZ", "text": "was released as the major motion picture \"The Late Bloomer.\" The author of nine books of non-fiction and fiction, Ken is the founder of The Mindful Writing Center (mindfulwritingcenter.com), an online learning academy that teaches writers how to enhance their creativity and communication skills through mindfulness and meditation.\n\nKen Baker is an award-winning author and journalist currently serving as Senior Correspondent for E! News and E! Online. His memoir\n\nI\n\nThou Shall Have No False Idols Before the Kardashians\n\nSome might begin their spiritual journey in a church, sanctuary, temple, or some other traditional house of worship. Others might kick-start their spiritual quest by reading books, going on a retreat with a guru, starting a meditation or yoga practice, or perhaps participating in a Bible study with a rabbi or pastor.\n\nNot me. My search for God begins in Las Vegas while I am keeping up with the Kardashians.\n\nThis is not a joke. This really is my life. So how did I get to the point where I am on my knees crying in a hotel room near the Vegas Strip, praying to God for the first time in seemingly forever in an effort to bring a troubled reality star out of a coma?\n\nI’ll start my explanation for my peculiar spiritual behavior with a description of what I do for a living: I am the senior correspondent for E! News and E! Online. While my former professors at Columbia University Graduate School of Journalism might throw up a little in their mouths knowing that I’m using my degree to report on the frivolity of Hollywood entertainment and celebrity, the truth is that the Kardashian clan is the most important beat I cover. My journalistic identity has become so intertwined with Kris, Kim, Khloe, Kourtney, Kendall, Kylie, Rob, Caitlyn, and the cast of satellite family characters that my E! News cohost, Jason Kennedy, has razzed me on the air by calling me Ken Kardashian.\n\nI’ve been an entertainment journalist for twenty years. It’s been a mostly amazing, sometimes maddening (more on that later) career that has taken me from my mid-1990s debut as a wet-behind-the-ears correspondent for People magazine, to an Us Weekly writer and editor, to a correspondent at E! News--the ultimate celebrity-obsessed news organization. Along the way, I’ve managed to get married, have a son and daughter (and coach both their hockey teams), and succeed (thanks to that anti-tumor medication) in keeping a skull-base pituitary gland tumor I had removed in 1998 from growing back. I also have written many books, one of which was a memoir that was made into the movie The Late Bloomer. One of my younger E! coworkers recently observed, “Ken, on paper you have it all.”\n\nBut paper is easy to shred, burn, or crumple. Only in Hollywood does paper make a soul.\n\nWhile it may be true that my personal and professional résumé isn’t filled with the stuff of crisis, my spiritual résumé tells a much darker story. That document, if I had ever actually spent the time to reflect on the subject long enough to write it, would look more like a maze of meandering lines, dead ends, and blank spaces marking the years that I stopped even pondering my spiritual self, let alone seeking deeper meaning.\n\nA job hazard of doing what I do (really of just leading a busy, modern life like so many other people do even in places far from the Hollywood sign) has been focusing on others rather than on myself.\n\nDespite all my professional accomplishments and personal adventures, all the incredible life experiences I’ve racked up, all the people I’ve met who have influenced my life--highest among them two exceptional children, Jackson and Chloe, and the greatest mom for them in my wife of sixteen years, Brooke--for far too many years my spiritual cup has been evaporating.\n\nMy current state is no one’s fault but my own. I’ve chosen to dedicate myself to a strange TV career in which I get paid to gossip about celebrities, live in a hyperactively car-clogged city, and pile on book-writing projects that make me money and give me creative satisfaction but that probably also make my hair fall out.\n\nMy life has turned far too frenetic and stressful for me to fully enjoy the beauty and love all around me. In my increasingly scarce “free” time, I have tucked myself away and written book after book (eight in the last sixteen years) in which I tell stories about others, rather than living my own. I need inner rewards, not more book awards. Like many other parents I know, I have chosen to consign my most fundamental health needs and desires to dormancy while I help guide my kids, nurture their budding talents, and create an environment to make their dreams a reality. Empty cup, hollow vessel. Whatever the metaphor, I am it.\n\nMy job at E! News is to report on the gamut of entertainment news--the most popular TV shows and movies, musicians, as well as the daily hookups, breakups, and screw-ups of the world’s biggest stars. The story I’ve come to cover in Vegas falls firmly into the category of screw-ups. In fact, it involves a celebrity who, after a painfully rapid decline, has just hit rock bottom--mentally, physically, and spiritually.\n\nThis latest cautionary tale comes courtesy of former reality star and retired NBA player Lamar Odom, who for the last twenty-four hours has lain in a coma in an intensive care unit a mile from the Vegas Strip.\n\nNo media outlet has yet confirmed a detailed explanation for his hospitalization, though there are plenty of rumors--from a suicide attempt to an overdose to an attempted murder at the hands of a prostitute. It’s the kind of tabloid-ready mystery that I’ve come to specialize in solving with the help of my network of in-the-know sources. Fortunately, I’ve just found out from a coworker that someone I’ve known for more than ten years is holding vigil at Lamar’s bedside.\n\nSince seemingly no one in Hollywood (or seemingly anywhere) actually likes to “talk” on the phone anymore, my calls to her keep going to voice mail. I email her.\n\nHope you’re hanging in there . . . What happened???? xo\n\nI drop onto the bed in my hotel room and kill some time scanning emails. A few minutes later, my source who’s inside the hospital replies:\n\nDrugs found in his system . . . coke and opiates. He was doing crack all weekend. And choked on his mucous.\n\nIt’s shortly after nine a.m. on a Wednesday in mid-October. I checked into the Vegas Hilton just after midnight, sent here by my bosses back in Los Angeles as soon as word leaked that Lamar had lost consciousness at a brothel.\n\nThe thirty-five-year-old former Olympian had fallen into a major funk some three months earlier after his ex, Khloe Kardashian, signed divorce papers. Khloe and Lamar’s divorce hadn’t been your run-of-the-mill celebrity split. In fact, it was really ugly, even by Hollywood standards. It offered the salacious tabloid spice of Khloe almost instantly beginning to date another handsome pro basketball player--only he was younger, richer and, perhaps most relevant, not a drug abuser.\n\nLamar’s spiral eventually led him to the Love Ranch, a legal brothel in the scrub-brush-scattered desert an hour outside of Vegas, where the 6-foot-10-inch former Lakers forward, who also dabbled in reality TV after he married a Kardashian sister, plunked down $75,000 to spend a few days with two blond prostitutes--one by the professional name of Ryder Cherry and the other Monica Monroe. On Lamar’s fourth day of frolicking, which included a liberal intake of “herbal Viagra” pills, a worker found him unconscious in his suite at the bordello and called 911, telling the operator that there was “white stuff coming out of his mouth and blood out of his nose.”\n\nThe story, as my source reveals to me via email, features the trifecta of tabloid clichés--sex, drugs, and hookers. My years covering celebrity have taught me that the juiciest true Hollywood stories always read far more scandalous than any fiction ever could. Lamar’s drama would have been titillating if it weren’t all so depressing.\n\nSleep-deprived and strung out on coffee, I pace the spacious suite, gripping my iPhone as I pepper my source with more questions. The source says she is writing me from the visitor’s lounge outside the ICU. I stand rapt as the information from her hits my inbox in bits and pieces:\n\nL’s condition = “critical”\n\nUnresponsive . . . several strokes\n\nposbl brain damage\n\non ventilator\n\n50-50 chance\n\nMy source has asked for her anonymity in exchange for sharing the facts, to counteract the rumor mill of speculation about what is happening inside that ICU. I know Lamar, though not nearly as well as my source does. A seemingly ever-smiling jock I have interviewed many times and socialized with at Kardashian family events, Lamar has a reputation in Hollywood as a nice guy who treats everyone--except, sadly, himself--with respect.\n\nLamar’s self-destructive descent rings familiar to anyone who follows the travails of celebs even in the most casual way. Charlie Sheen, Britney Spears, Lindsay Lohan--all had major issues and somehow they survived. Meanwhile, Whitney Houston, Michael Jackson, Heath Ledger, Amy Winehouse, Cory Monteith, and Philip Seymour Hoffman have died. And this is just a very partial list of celebrity overdoses and/or drug-fueled meltdowns I have covered in recent years. The list is, sadly, quite long. After all, infamous overdoses by famous people date back even to well before Marilyn Monroe’s in 1962. Lamar, however, is the current leader in the race to achieving that ignominious distinction.\n\nMy friends who follow the Hollywood fame game at a safer, healthier distance often ask me what it is that makes so many celebrities so messed up. I usually give a pat answer like, “Mo’ money, mo’ problems,” or, “Too many options,” or “They’re insecure narcissists.”\n\nPerhaps the difference between me and “them,” a profound one when I began working in Hollywood in the mid-1990s fresh from a little newspaper in Virginia, has grown less and less. That is to say, I fear that I have begun falling into some of the same celebrity-like traps I previously witnessed only from the outside looking in.\n\nEnough reflecting and navel gazing, I tell myself. Back to work.\n\nI keep emailing with my hospital source.\n\nStill unconscious?\n\nyes and no updates. Now having to fix all the damage that was done.\n\nI quickly write my story on my phone; I want to break the news first, before the TMZs of the world. Less than fifteen minutes after I email it back to the E! News room, the exclusive story goes live on E! Online: “Drugs Found in Lamar Odom’s System; Condition Being Treated as ‘Overdose’ as Brain Damage ‘Likely.’ ”\n\nE! tweets the post out to its 10 million-plus followers and the story zaps its way through the web, becoming one of the most viewed stories in the history of our website (second only to the 2014 death of my late E! Network colleague Joan Rivers).\n\nAs users click, scroll, and share it with friends, I stare out my window at the white concrete Stratosphere Tower punching into the clear blue Nevada sky. The tallest building in Vegas, the Stratosphere is topped by an observation deck nearly nine hundred feet above the ground, from which is perched a bungee-jumping platform. I watch as tourist after tourist jumps off the tower and falls toward the pavement, until they dangle death-defyingly to a bouncy and anticlimactic stop. It doesn’t look fun to me. The image reminds me of those haunting ones of people desperately leaping to their death from the flaming windows of the World Trade Center on September 11.\n\nLife is so damn fragile.\n\nThe word “love” pops into my mind. Things I’ve loved: My family, my friends, my job, and my lovers. But do I love myself ?\n\nBack to work, really.\n\nOnce again, I email my source:\n\nLMK if there’s anything I can do.\n\nPlease pray for Lamar.\n\nOK, I will.\n\nThat’s when it hits me like a body crashing to concrete: I can’t remember the last time I prayed.\n\nPray for Lamar.\n\nI am frozen. I want to pray, but I am not sure where to begin, as my thoughts are as mushy as the oatmeal I just ate. I can’t pray. Not now. I would be a fraud. I don’t want to be one of those people who only talks to God when he needs something. I’m not gonna sit here in Vegas and suddenly dial up God. He’d probably hang up on me anyway.\n\nI’m so tired. The last fifteen hours have passed in a blur.\n\nEarlier that day, watching my eleven-year-old daughter Chloe’s ice hockey practice in Long Beach, I got a call from Maureen on the E! News desk. Maureen told me to drive straight to Vegas to cover the breaking news--and to call anyone and everyone close to Lamar. Things looked grim. She said to get there fast; Lamar could be dead before I arrived.\n\nSoon, I found myself speeding in my black Mercedes SUV eastward on I-15 toward the California–Nevada line, the moonlight casting shadows on the cacti lining the road. I didn’t even have time to pack a bag, let alone reflect on my feelings about someone I knew lying in a coma, or worse.\n\nNow I stand here in silence, but for the meditative hum of the hotel room’s air conditioner. A deep question squeezes into the micro-space between my busy thoughts: When will I die?\n\nSadly, men haven’t lived very long in my family. My father, who had type-2 diabetes and heart disease, passed from lung cancer (thanks to cigarettes) at age fifty-one. My uncle Jerry was in his late thirties when he died from heart disease and the effects of diabetes. My father’s dad, Grampa Wally, died in his sixties from a heart attack. My older brother, who had just turned fifty-one, suffered heart failure recently and was walking around with a portable defibrillator strapped to his body for over a month.\n\nExperience has taught me life’s fragility. Though I didn’t exactly need this message hammered into me, three years after my father died in 1998 I underwent cranial base surgery to have a chestnut-size tumor removed from my pituitary gland. I then wrote a memoir about how having my hormone levels return to normal gave me a second chance in life, which I celebrated two years later by taking leave from magazine writing to live my dream of playing professional hockey.\n\nI had gotten the mortality message: Life is short, we all die, so carpe fucking diem. But the euphoria, zest, gratitude, and momentary spiritual grace I experienced after surviving my health scare had worn off long ago. The peace that I had made with the uncertainty of life, possessing a fearlessness that can come from facing death down, of dancing with the devil and living to tell about it, seems so distant and removed from life today.\n\nIn my late twenties and early thirties, I felt blessed for each moment and, as such, did my best to embrace it. I ran marathons for charities, revealed a very personal story about my short-circuited sex life in the book Man Made: A Memoir of My Body, approached daily life on a mission to live up to the Jack London quote that filled the very first page of my hockey memoir: “The proper function of man is to live, not to exist. I shall not waste my days in trying to prolong them. I shall use my time.”\n\n--This text refers to the\n\nhardcover\n\nedition.", "images": ["https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/scheduleWithEaseImage._CB409113670_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/poppin/AmazonLive/2022_Jan_Mar/220831_AuthorQA_JennetteMcCurdy_ILM_Desktop_1x_650x45._CB630154817_.jpg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/dp/nfcx/Apple._CB461894282_.png", "https://web.archive.org/web/20220901032841im_/https://m.media-amazon.com/images/I/41MVoM7Zm1L._SY346_.jpg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/gno/sprites/nav-sprite-global-1x-hm-dsk-reorg._CB405937547_.png", "https://web.archive.org/web/20220901032841im_/https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:135-3904951-7344365:JD4TQMWTDNFG0WKHSET2$uedata=s:%2Frd%2Fuedata%3Fnoscript%26id%3DJD4TQMWTDNFG0WKHSET2:0", "https://web.archive.org/web/20220901032841im_/https://fls-na.amazon.com/1/batch/1/OP/ATVPDKIKX0DER:135-3904951-7344365:JD4TQMWTDNFG0WKHSET2$uedata=s:%2Frd%2Fuedata%3Fstaticb%26id%3DJD4TQMWTDNFG0WKHSET2:0", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/dp/nfcx/PersistentWidget-Ruby-Large._CB485955431_.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/3ed00923-88b6-42e0-9eec-ee78f426b346/HQP_75x75_Baby_Sloth._SS75_CB633843950_.jpg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/ABC_Detail_Page_logo._CB634617474_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/chooseBooksImage._CB409113671_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/7a1ae437-6b74-46d9-af29-4402ff72a0f4._CR40,0,240,240_SX48_.jpg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/joinClubsImage._CB409113671_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/amazonbookclub/ABC_Detail_Page_Widget_Blue_Flag._CB631694394_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/Audible/Homestead/samplePlayer/Pause._CB655354636_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/Audible/Homestead/logo/audiblelogo._CB482869198_.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/S/amazon-avatars-global/default._CR0,0,1024,1024_SX48_.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/dp/nfcx/Android._CB461894282_.png", "https://web.archive.org/web/20220901032841im_/https://m.media-amazon.com/images/S/amzn-author-media-prod/629fcg7nh3hhk1o8cs4dqqj5hp._SY600_.jpg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/dp/2015/UDP_KCP_Ad_w_border._CB485949181_.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/personalization/ybh/loading-4x-gray._CB485916920_.gif", "https://web.archive.org/web/20220901032841im_/https://assoc-na.associates-amazon.com/abid/um?s=135-3904951-7344365&m=ATVPDKIKX0DER", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/app/QR-store-link-kindle-app._CB626291935_.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/Audible/Homestead/samplePlayer/Play._CB655354636_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/Audible/Homestead/samplePlayer/Spinner._CB670196651_.svg", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/digital/video/merch/2018/TV/Originals/HNNA/Looping_GIF_._CB612091965_.gif", "https://web.archive.org/web/20220901032841im_/https://m.media-amazon.com/images/G/01/digital/sitb/sticker/sitb-sticker-v3-xsmall.png", "https://web.archive.org/web/20220901032841im_/https://images-na.ssl-images-amazon.com/images/G/01/kindle/app/kindle-app-logo._CB668847749_.png"], "top_img": "", "keywords": [], "authors": ["Follow The Author", "Abqa"], "canonical_link": "https://web.archive.org/web/20220901032841/https://www.amazon.com/Ken-Commandments-Search-God-Hollywood-ebook/dp/B01N7Q88GZ", "title": "Kindle edition by Baker, Ken. Religion & Spirituality Kindle eBooks @ Amazon.com.", "meta_data": {"description": "The Ken Commandments: My Search for God in Hollywood - Kindle edition by Baker, Ken. Religion & Spirituality Kindle eBooks @ Amazon.com.", "title": "The Ken Commandments: My Search for God in Hollywood - Kindle edition by Baker, Ken. Religion & Spirituality Kindle eBooks @ Amazon.com.", "csrf": "1@g59MasSnbebf2irrY7RTlKnTBgUQiBPInl8t6SN486r+AAAAAQAAAABjECbqcmF3AAAAABVX8CwXqz42z+J7i/ABqA==@NLD_L8KSDJ"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}