{"url": "https://wikicelebinfo.com/shahs-of-sunset-cast-net-worth-2018-age/", "text": "Since its premium on 11th March 2012, Shah of sunset remains a hit reality TV series. The show airs on Bravo TV station and is currently in its eighth season in case you want to start catching up with this impressive reality piece. If you are a loyal fan of the show, you must be familiar with the characters Mike Shouhed, Reza Farahan, Golnesa Gharachedaghi “GG”, Lilly Ghalichi, Destiny Rose, Asa Soltan Rahmati, Shervin Roohparvar, and Mercedes Javid “MJ”. Here is the net worth and age for all celebs.\n\nMike Shouhed from Shah of sunset’s net worth, age\n\nOfficially known as Michael Shouhed, Mike is a TV personality as well as a real estate developer. Mike Shouhed net worth is estimated at $3 million form these two sources of income.\n\nThe handsome star is born 1978 hence Mike Shouhed age is 43 years and still looks very young. He was born in Tehran, Iran and celebrates his birthday on 12th October. Mike had been married to Jessica Parido but are currently divorced due to his extension of playboy role into reality. Current news based on is recent interviews is that she has a new lover, but she is yet to be introduced to the public.\n\nReza Farahan from Shahs of Sunset’s Net Worth, Age\n\nYou can better describe him as advocacy of homosexuality, and yes he is gay and married to Adam Neely. The two tied the knot on November 2015 after Reza decided to surprise Neely with a wedding ring on their trip to Palm Springs, California.\n\nTheir relationship as of now seems the perfect type of relationship as they are ideally seen getting cozy with each other in serene environments such as the Miami Beach. He is just from turning 48 years as he came into existence on August 5,1973. According to Celebrity Net worth, Reza Farahan net worth is about $8 million. Apart from acting, Reza just like Mike has involvements in real estate businesses.\n\nGolnesa Gharachedaghi ‘GG’ from Shahs of Sunset’s Net Worth, Age\n\nShe is the true beauty and brains and was on November 27, 1981. Although Golnesa Gharachedaghi age is almost 40, Golnesa net worth is $12 million.\n\nYes, that must have shocked you. She does not attain this from Shah of Sunset but other t shows as well as her fashions and beauty business which she runs with her sister. On January 25, 2017, GG got married Shalom Yeruoshalmi. The married was short lived because they are currently divorced because of infidelity cases of Shalom. Golnesa is however not interested in any relationship unless that which will only give her a child and nothing more.\n\nLilly Ghalichi from Shahs of Sunset’s Net Worth, Age 2022\n\nLilly is another queen of Shah of sunset who amazed the internet on August 2016 with her plus wedding. Dara Mai is the lucky guy who managed to put a ring on her finger. The wedding was not much of a surprise because Lilly has already shown off her wedding dress designed by Ryan & Walter on Instagram before the D-day.\n\nCredible sources indicate Lilly Ghalichi’s net worth as $50-55 million which she gets from the show as well as her fashion design business, blogging activity an attorney career.\n\nShe was born in Houston on April 30 1983 hence 38 years. Watch out for news about her baby because she recently made a pregnancy announcement.\n\nDestiny Rose from Shahs of Sunset’s Net Worth, Age\n\nYou know she is part of Shah of sunset team if you have been following the series keenly. Destiny joined the show during its 6th season. Not much is known about her because she is the secret type of celebrity. Destiny Rose age is not known, but she was born in 1981. Rose net worth that is slightly above $1.4 million.\n\nShah of the sunset is not the only show she has featured, but as made appearances on various shows like People Couch which gave her the fame, she is enjoying. The shows are believed to be her primary sources of income.\n\nAsa Soltan Rahmati from Shahs of Sunset’s Net Worth, Age\n\nBorn on September 1, 1976, Soltan is among the oldest ladies in the show. This means that Asa Soltan’s age is 44, but she looks so much younger. Thanks to the show and her cloth line, Asa Soltan net worth is $250k.\n\nThe beauty is dating the nephew of the famous singer Michael Jackson-Jermaine Jackson. Asa and Michael did not know each other through the show but have known one another since Asa was 15 years old. Jackson and Asa have been in a relationship for over eight years and even have a son (Soltan Jackson), but they are not engaged live alone being married. They must be waiting for the ideal moment.\n\nShervin Roohparvar from Shahs of Sunset’s Net Worth, Age\n\nAlso known as AlphaSherv, Shervin Roohparvar is one of the guys in the show that is making ladies heads to turn. It is unfortunate that she is dating Annalise Vanessa Carbone whose beauty complements the good looks of Shervin. They live in different countries hence over a long distance relationship.\n\nAs of now Shervin and Annalise are yet to have children. Although he is American, the star was born in Iran on 21st of August 1980. Shervin age is therefore 41. About salary and net worth, the salary is not known, but Shervin’s net worth is about $12 million which is attributed to the show as well as his multiple technology companies earthed in Silicon Valley, California.\n\nMercedes Javid ‘MJ” from Shahs of Sunset’s Net Worth, Age\n\nOtherwise known as MJ, Mercedes Javid tops the list of the cast members in Shah of sunset. Javid’s net worth is estimated to be between $5 million.\n\nHer major sources of income are the show and her real estate business. Javid Mercedes’s age is 49 years as she was born on the 16th August 1972. The queen got married to Tommy Feight on 21st April, 2018. The couple met on social media and thing flowed swiftly. It is not understood why she feels that Tommy married her out of love for her money and not because she truly loved her.", "images": ["https://celebritydig.com/wp-content/uploads/2018/08/Reza-Farahan-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Shahs-of-sunset-cast.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Javid-Mercedes’.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Lily-Ghalichi-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Golnesa-Gharachedaghi-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Asa-Soltan-Rahamati-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Mike-Shouhed-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2019/02/Nema-Vand-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Shervin-Roohpavar-150x150.jpg", "https://celebritydig.com/wp-content/uploads/2018/08/Mercedes-Javid-MJ-150x150.jpg"], "top_img": "https://celebritydig.com/wp-content/uploads/2018/08/Shahs-of-sunset-cast.jpg", "keywords": [], "authors": ["Sid Vyper"], "canonical_link": "https://celebritydig.com/shahs-of-sunset-cast-net-worth-2018-age/", "title": "Shahs of Sunset Cast Net Worth (2022) & Age", "meta_data": {"viewport": "width=device-width, initial-scale=1, minimum-scale=1", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Shahs of Sunet is a popular American tv series. Check out Shahs of Sunset cast's Net Worth and salary. Also, check out their age.", "og": {"locale": "en_US", "type": "article", "title": "Shahs of Sunset Cast Net Worth (2022) & Age - Celebritydig", "description": "Shahs of Sunet is a popular American tv series. Check out Shahs of Sunset cast's Net Worth and salary. Also, check out their age.", "url": "https://celebritydig.com/shahs-of-sunset-cast-net-worth-2018-age/", "site_name": "Celebritydig", "image": {"identifier": "https://celebritydig.com/wp-content/uploads/2018/08/Shahs-of-sunset-cast.jpg", "width": 770, "height": 430, "type": "image/jpeg"}}, "article": {"published_time": "2023-08-01T04:55:50+00:00", "modified_time": "2023-08-01T04:56:21+00:00"}, "author": "sid vyper", "twitter": {"card": "summary_large_image", "label1": "Written by", "data1": "sid vyper", "label2": "Est. reading time", "data2": "5 minutes"}, "msvalidate.01": "A9258CDF601E8C6E40E837CD4BF0F7EF", "google-site-verification": "mSa9EPzqm6spZ8KUhQTjHzV6CSDnC4kKu3UuWEG1PhI"}, "movies": [], "publish_date": 1690865750.0, "source": "https://wikicelebinfo.com", "summary": ""}