{"url": "www.biography.com/people/mariah-carey-9542177", "text": "1970-present\n\nWho Is Mariah Carey?\n\nAt 18, Mariah Carey signed with Columbia Records, and her first album had four No. 1 singles, including “Vision of Love” and “I Don’t Wanna Cry.” Carey went on to generate several more albums (later with other studios) and top singles, becoming one of the most commercially successful artists of all time with 19 No. 1 hits and more than 200 million records sold.\n\nQuick Facts\n\nFULL NAME: Mariah Carey\n\nBORN: March 27, 1970\n\nBIRTHPLACE: Huntington, New York\n\nSPOUSES: Tommy Mottola (1993-1998) and Nick Cannon (2008-2016)\n\nCHILDREN: Moroccan and Monroe\n\nASTROLOGICAL SIGN: Aries\n\nEarly Life\n\nMariah Carey was born March 27, 1970, in Huntington, New York, on Long Island to Alfred Roy Carey, a Venezuelan aeronautical engineer; and Patricia Carey, a voice coach and opera singer. She has two older siblings: a brother, Morgan, and a sister, Alison.\n\nCarey’s parents divorced when she was 3 years old. She stunned her mother by imitating her operatic singing as early as age 2, and was given singing lessons starting at age 4. Eventually, Carey developed a voice that spanned five octaves. Few singers have achieved this vocal feat; David Lee Roth and Yma Sumac are among the handful of others to have done so.\n\nAfter graduating in 1987 from Harborfields High School in Greenlawn, New York, Carey moved to Manhattan where she worked as a waitress and a coat check girl and studied cosmetology, while writing songs and actively pursuing a music career at night.\n\nEarly Music Career: Mariah Carey and Emotions Albums\n\nWhen she was 18 years old, Carey and her friend, singer Brenda K. Starr, went to a party hosted by CBS Records. Starr convinced Carey to bring along one of her demo tapes. She intended to give the tape to Columbia’s Jerry Greenberg, but Tommy Mottola, the president of Columbia Records (later Sony), intercepted it before she could hand it to Greenberg. After listening to the tape on the way home from the party, Mottola signed Carey immediately and set her to work on her first album, Mariah Carey (1990), which included four No. 1 singles: “Vision of Love,” “Love Takes Time,” “Some Day,” and “I Don’t Wanna Cry.”\n\nHer second album, Emotions, was released in 1992; the title track became her fifth No. 1 single, and included the hits “Can’t Let Go” and “Make it Happen.”\n\nMusic Box, Daydream, and Butterfly\n\nIn March 1992, Carey appeared on MTV’s Unplugged. This performance was released as an album and a home video, resulting in another No. 1 single (a cover of The Jacksons’ “I’ll Be There”). Her next album, Music Box (1993), cut back a bit on the lavish studio production techniques heard in her previous albums, and included the No. 1 singles “Dreamlover” and “Hero.”\n\nHer November 1994 release, Merry Christmas, combined traditional Christian hymns with new songs. In 1995 she released Daydream; its first single, “Fantasy,” debuted at No. 1. It also included collaborations with R&B and hip-hop artists such as Wu-Tang Clan and Boyz II Men (“One Sweet Day”).\n\nHer 1997 album, Butterfly, included 11 compositions written by Carey, and demonstrated her continued interest in hip-hop and R&B, including the Sean “Puffy” Combs-produced “Honey,” her 12th No. 1 hit. Carey’s 1998 album, #1's, featured her 13 previous chart-topping singles as well as the Academy Award-nominated “The Prince of Egypt (When You Believe),” a duet with fellow pop diva Whitney Houston.\n\nGlitter, Hospitalization, and New Record Deal\n\nIn July 2001, Carey was admitted into a New York-area hospital and put under psychiatric care after suffering what her publicists called a “physical and emotional collapse.” Carey had been preparing to promote her upcoming feature film debut, Glitter, and its accompanying soundtrack album, but cancelled all public appearances. The release of Glitter was subsequently pushed back from late August to late September 2001. Carey was released from the hospital after two weeks.\n\nIn January 2002, Carey and EMI (the corporate owner of Virgin Records, with whom Carey had signed a reported $80 million contract in April 2001) severed their relationship. Though the film and soundtrack for Glitter failed to generate the desired box office and sales totals, Carey reportedly walked away from Virgin with nearly $50 million as part of her severance agreement. In May 2002, she signed a deal with Universal Music Group's Island/Def Jam Records.\n\nMore Albums: Charmbracelet to Caution\n\nIn December 2002, Carey released her eighth album, Charmbracelet, which debuted in third place on the charts. The record's accompanying tour, her first in more than three years, launched in June 2003.\n\nShe followed up with her 10th studio album, The Emancipation of Mimi, which became the best-selling album in the U.S. in 2005. With 2008’s Touch My Body (from her 11th studio album, E=MC²), Carey surpassed Elvis Presley to become second only to the Beatles for the most No. 1 hit singles in the United States. Other albums include Memoirs of an Imperfect Angel (2009), Merry Christmas II You (2010), her second holiday album, and Me. I Am Mariah . . .The Elusive Chanteuse (2014).\n\nThe singer proved she remained one of the top acts in the business with the release of her 15th studio album, Caution (2018), which debuted at No. 5 in the U.S. and earned mention on numerous albums of the year lists.\n\nIn December 2019, Carey achieved another milestone when her enduring holiday song, “All I Want for Christmas Is You,” hit No. 1 on the Billboard Hot 100, the 25 years between its release and arrival at the top spot setting a new Billboard record for longevity.\n\nCarey has sold more than 200 million albums worldwide. She is the third best-selling female artist of all time, according to the Recording Industry Association of America.\n\nAmerican Idol, Vegas Residency, and Mariah’s World\n\nIn 2012, Carey was chosen as a new judge for season 12 of the popular FOX television show American Idol, taking a seat alongside Randy Jackson, Nicki Minaj and Keith Urban. In 2013, she appeared in a small role in The Butler, Lee Daniels’ biopic about White House butler Eugene Allen, and she voiced a character on the animated television series American Dad!\n\nIn January 2015, Carey inked a deal to to take up residency in Las Vegas beginning in May 2016. To coincide with her Vegas show, #1 to Infinity, at Caesar’s Palace, she released a greatest hits collection, featuring her No. 1 tracks. In 2015, she also starred in and directed A Christmas Melody, a holiday movie on the Hallmark Channel.\n\nIn 2016, Carey launched The Sweet Sweet Fantasy Tour and Mariah's World, a television docu-series on E!, which followed her European tour. She took on another movie role, voicing the mayor in 2017’s animated The Lego Batman Movie.\n\nBipolar Admission\n\nIn an April 2018 cover story for People, Carey shared the story of her longtime, secretive battle with bipolar II disorder. First diagnosed in 2001, after being hospitalized for her breakdown, the singer said she refused to acknowledge it for years. “Until recently I lived in denial and isolation and in constant fear someone would expose me,” she said. “It was too heavy a burden to carry, and I simply couldn’t do that anymore.”\n\nCarey said she turned things around after finally reaching out for help, and that she began undergoing therapy and taking medication regularly. “I’m just in a really good place right now, where I’m comfortable discussing my struggles with bipolar II disorder,” she told People. “I’m hopeful we can get to a place where the stigma is lifted from people going through anything alone. It can be incredibly isolating. It does not have to define you and I refuse to allow it to define me or control me.”\n\nMemoir and The Rarities\n\nCarey released her memoir, The Meaning of Mariah Carey, on September 29, 2020. “I want to tell the story of the moments – the ups ad downs, the triumphs and traumas, the debacles and the dreams that contributed to the person I am today,” she said. In addition to the memoir, Carey released the 32-track album The Rarities on October 2.\n\nPersonal Life\n\nIn June 1993, Carey married Tommy Mottola in a spectacular ceremony at Manhattan’s St. Thomas Episcopal Church. The couple divorced in 1998. Carey then dated Latin singer Luis Miguel for three years, but their relationship reportedly ended in the summer of 2001.\n\nCarey began a relationship with rapper/actor Nick Cannon after he appeared in her music video for “Bye Bye.” After dating for less than two months, the couple married on April 30, 2008, in a secret ceremony in the Bahamas. In 2011, Carey and Cannon welcomed twins Moroccan and Monroe. The couple announced their separation in August 2014, after six years of marriage, and their divorce was finalized in 2016.\n\nIn January 2016, Carey became engaged to Australian businessman James Packer in New York City, but in October of that year, it was announced that the couple had split. After Carey’s engagement with Packer ended, she began a relationship with backup dancer Bryan Tanaka, who was also featured in her reality show Mariah’s World.\n\nOutside of her music career, Carey is active in fundraising for The Fresh Air Fund, a nonprofit agency that provides free summer vacations to disadvantaged children in New York City, and is the co-founder of Camp Mariah, one of the organization’s initiatives.\n\nQuotes\n\nNever, never listen to anybody that try to discourage you.\n\nForget the image, forget the ensemble, forget the rumors, forget the short skirts, the big hair, whatever! I owe this to the fans, and I will never forget you.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!", "images": ["https://hips.hearstapps.com/hmg-prod/images/leonard-bernstein-attends-jackie-mason-opening-on-december-news-photo-1693403011.jpg?crop=1.00xw:0.583xh;0,0.0377xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/dolly-parton-speaks-during-a-press-conference-to-launch-her-news-photo-1695409383.jpg?crop=0.915xw:0.610xh;0.0417xw,0.0545xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-performs-oh-santa-from-her-25th-anniversary-news-photo-1699289243.jpg?crop=0.724xw:0.543xh;0.141xw,0.106xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/the-live-coast-to-coast-three-hour-season-finale-features-news-photo-1697206971.jpg?crop=0.712xw:0.892xh;0.142xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-arrives-to-the-bros-screening-at-the-whitby-news-photo-1699470737.jpg?crop=0.831xw:0.681xh;0.111xw,0.0439xh&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/attends-the-60th-annual-grammy-awards-at-madison-square-news-photo-1700068963.jpg?crop=0.853xw:0.644xh;0.0734xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/american-composer-and-conductor-leonard-bernstein-and-his-news-photo-1693421241.jpg?crop=1.00xw:0.776xh;0,0.0730xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sean-combs-aka-diddy-attends-the-celebration-for-diddys-news-photo-1700172387.jpg?crop=0.909xw:0.607xh;0.0433xw,0.0374xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/olivia-rodrigo-attends-the-2023-vanity-fair-oscar-party-news-photo-1699910451.jpg?crop=1.00xw:0.737xh;0,0.0353xh&resize=360:*", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=120:*", "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.511xw:0.384xh;0.231xw,0.201xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/phil-collins-attends-a-photocall-as-he-announces-his-not-news-photo-1700147281.jpg?crop=0.678xw:1.00xh;0.162xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/the-edge-guitarist-of-u2-performs-on-stage-at-womens-march-news-photo-1700149573.jpg?crop=0.670xw:1.00xh;0.303xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/promotional-portrait-of-american-country-music-singer-and-news-photo-1701190707.jpg?crop=0.770xw:0.757xh;0.0943xw,0.0624xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "http://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/rover/profile_photos/b50d4909-0f39-4b73-b482-46d0a9078d40_1682363012.file?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-attends-taylor-swift-the-eras-tour-concert-news-photo-1697236739.jpg?crop=1.00xw:0.718xh;0,0.0700xh&resize=360:*", "http://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/singer-sza-performs-on-stage-during-her-the-sos-north-news-photo-1699635503.jpg?crop=0.707xw:0.982xh;0.159xw,0.0179xh&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.511xw:0.384xh;0.231xw,0.201xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/musicians/mariah-carey", "title": "Age, Songs & Kids", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Mariah Carey - Age, Songs & Kids", "description": "With hits such as \"Vision of Love\" and \"I Don't Wanna Cry,\" singer Mariah Carey holds the record for most No. 1 debuts in Billboard Hot 100 history.", "keywords": "Astrological Sign: Aries, Birth City: Huntington, Birth Month/Day: March 27, Birth Month: 3, Birth State: New York, Birth Year: 1970, Death Month: 2, Death Year: 2012, Life Events/Experience: Grammy, Life Events/Experience: Self-Made Millionaire, Long Island", "og": {"type": "article", "site_name": "Biography", "title": "Mariah Carey - Age, Songs & Kids", "description": "With hits such as \"Vision of Love\" and \"I Don't Wanna Cry,\" singer Mariah Carey holds the record for most No. 1 debuts in Billboard Hot 100 history.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.511xw:0.384xh;0.231xw,0.201xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/musicians/mariah-carey"}, "theme-color": "#000000", "article": {"publisher": "https://www.facebook.com/Biography", "section": "Famous Musicians", "modified_time": "2023-11-08T19:29:20Z", "published_time": "2020-10-02T14:43:00Z"}, "twitter": {"site": "@biography", "image": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.511xw:0.384xh;0.231xw,0.201xh&resize=640:*", "card": "summary_large_image"}, "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.526xw:0.787xh;0.221xw,0.168xh&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.511xw:0.384xh;0.231xw,0.201xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/mariah-carey-at-la-pride-in-the-park-held-at-los-angeles-news-photo-1699470843.jpg?crop=0.526xw:0.787xh;0.221xw,0.168xh", "auto-publish": "never", "sailthru.excerpt": "1970-presentWho Is Mariah Carey?At 18, Mariah Carey signed with Columbia Records, and her first album had four No. 1 singles, including “Vision of Love” and “I Don’t Wanna Cry.” Carey went on to generate several more albums (later with other studios) and top singles, becoming one of the most commercially", "sailthru.tags": "musicians,Famous Musicians", "sailthru.date": "2020-10-02 14:43:00", "sailthru.socialtitle": "Mariah Carey - Age, Songs & Kids", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 42}, "movies": [], "publish_date": 1601649780.0, "source": "http://www.biography.com", "summary": ""}