{"url": "https://web.archive.org/web/20180425021740/https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "text": "Defense attorneys portrayed Constand as lying about the sexual encounter, which Cosby has claimed was consensual. The prosecution said that Cosby, famous for his role as Dr. Cliff Huxtable on \"The Cosby Show,\" preyed on Constand and that all the women who testified against him had \"strikingly similar stories.\"\n\nIn two hours of closing arguments, Cosby's defense team painted Constand as a \"con artist\" and a \"pathological liar\" seeking fame and fortune and willing to extort Cosby in pursuit of those goals.\n\nDefense attorney Kathleen Bliss began closing arguments by suggesting that Constand and the other women who testified were \"were motivated by a common movement, many of them represented by the same attorney,\" she said, referring to Gloria Allred and her daughter, Lisa Bloom, who is also a lawyer. Bliss emphasized a proposal from Allred for a $100 million settlement fund in 2014.\n\n\"You heard about the $100 million fund,\" she reminded jurors.\n\nTom Mesereau, Cosby's lead attorney, repeatedly emphasized what he said were discrepancies in Constand's testimony. Mesereau told the jury that the case was about a \"blind 80-year-old man with a successful career facing absolute ruin.\"\n\n\"This woman will say anything. She will absolutely say anything. She's a pathological liar,\" he added.\n\nMesereau walked the jury through a PowerPoint presentation, pointing to what he characterized as 12 inconsistent statements about the nature of Constand's relationship with Cosby, including whether they had flirted before the alleged assault, whether they were ever alone together and whether she had been in bed with him. He said her statements were not simply \"inconsistencies ... they are lies.\"\n\nBliss also questioned the prosecution's decision to bring in witnesses to testify that Cosby assaulted them more than 30 years ago.\n\n\"How unfair is that — digging up stuff from three decades ago?\" she asked. She also told the jurors that they shouldn't allow the #MeToo movement, which has exposed scores of men in the media, entertainment and business worlds as sexual harassers, to sway their decision.\n\n\"Don't get me wrong, bad things definitely happen. But, ladies and gentleman, not every accusation is true. Your common sense tells you that,\" Bliss said. \"We do have to deal with sexual assault. It's a worldwide problem, just like we do with sexual harassment, pay disparity, social inequality.\n\n\"But questioning an accuser is not shaming them,\" she added.\n\nBut Assistant Montgomery County District Attorney Kristen Feden told jurors that it was Cosby, not Constand, who was the con artist and that all of the women who testified against him had \"all strikingly similar stories.\"\n\n\"He preyed on Andrea Constand the same way he preyed on all those five women,\" she said.\n\nFeden accused Cosby of selecting victims he believed he could silence. He used his image to \"gain confidence of young, aspiring, unsuspecting women so he could sexually assault them and strip them of their very autonomy,\" she said.\n\nThe prosecutor also lambasted Bliss for \"character assassination\" of the accusers.\n\n\"That character assassination that Ms. Bliss put those women through was utterly shameful,\" she said. \"She's the exact reason why women, victims of sexual assault and men don't report these crimes.\"", "images": ["https://web.archive.org/web/20180425021740im_/https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1200;630;7;70;5.jpg", "https://web.archive.org/web/20180425021740im_/https://c.betrad.com/pub/icon1.png", "https://web.archive.org/web/20180425021740im_/https://media1.s-nbcnews.com/i/MSNBC/Components/Video/201804/nn_sgo_cosby_trial_180423_1920x1080.jpg", "https://web.archive.org/web/20180425021740im_/https://media4.s-nbcnews.com/i/MSNBC/Components/Video/201804/d_ov_feature_Cosby_180417.jpg", "https://web.archive.org/web/20180425021740im_/https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.focal-760x380.jpg"], "top_img": "https://web.archive.org/web/20180425021740im_/https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1200;630;7;70;5.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180425021740/https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "title": "Closing arguments heard in Bill Cosby's sexual assault retrial", "meta_data": {"fb": {"app_id": 10150138890205613}, "og": {"site_name": "NBC News", "locale": "en_US", "url": "https://web.archive.org/web/20180425021740/https://www.nbcnews.com/storyline/bill-cosby-scandal/closing-arguments-begin-bill-cosby-s-sexual-assault-retrial-n868686", "title": "Closing arguments heard in Bill Cosby's sexual assault retrial", "description": "A defense lawyer told the jury that the case is about a \"blind 80-year-old man with a successful career facing absolute ruin.\"", "image": {"identifier": "https://web.archive.org/web/20180425021740im_/https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1200;630;7;70;5.jpg", "secure_url": "https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1200;630;7;70;5.jpg", "type": "image/jpeg", "width": 1200, "height": 630}, "type": "article"}, "twitter": {"site": "@NBCNews", "creator": "NBCNews", "image": "https://web.archive.org/web/20180425021740im_/https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1024;576;7;70;5.jpg", "title": "Closing arguments heard in Bill Cosby's sexual assault retrial", "description": "A defense lawyer told the jury that the case is about a \"blind 80-year-old man with a successful career facing absolute ruin.\"", "card": "summary_large_image"}, "viewport": "width=device-width, initial-scale=1", "description": "A defense lawyer told jurors the case is about a \"blind 80-year-old man with a successful career facing absolute ruin.\" Prosecutors said Cosby preyed on women.", "thumbnail": "https://media2.s-nbcnews.com/j/newscms/2018_17/2409356/180424-bill-cosby-trial-1005_5aea1493eadb16fe32f0e423ad39b242.1024;768;7;70;3.jpg"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}