{"url": "https://www.inquisitr.com/4816599/this-is-us-see-milo-ventimiglia-play-jack-pearson-as-an-old-man-in-season-2-finale/", "text": "This Is Us is toying with an alternate timeline in the Season 2 finale—and it’s not via a flashback or a flash forward. While the episode, titled “The Wedding,” will feature some upbeat moments as Kate Pearson (Chrissy Metz) gets ready to marry her longtime love Toby (Chris Sullivan), emotions will run high as she walks down the aisle without her dearly departed dad (Milo Ventimiglia) by her side.\n\nBut now, promos for “The Wedding” episode confirm that Jack will be back for his little girl’s big day. The teaser for the This Is Us season 2 finale shows Jack Pearson in the present day, sporting gray hair, a salt-and-pepper goatee, and wire-rimmed glasses as he touches his wife Rebecca’s (Mandy Moore) face and says, “Where’d the time go, Bec?”\n\nThis Is Us fans (and pretty much the rest of the universe) know that Jack Pearson died on Super Bowl Sunday in 1998 when he was 53 years old. The Pearson patriarch saved the family dog (and a pillowcase full of family belongings!) after a house fire, but he couldn’t save himself. Complications from smoke inhalation did Papa Pearson in, and now Kate’s wedding marks 20 years since his tragic passing.\n\nThe trailer for “The Wedding” features a flashback of a younger Jack telling 10-year-old Kate (Mackenzie Hancsicsak): “The guy that gets to marry you, Katey girl, he is one lucky guy.” Later, we see adult Kate flanked by her brothers Kevin and Randall (Justin Hartley, Sterling K. Brown) as she walks down the aisle. The promo teases a “special guest” at Kate and Toby’s wedding and that’s when old man Jack is seen.\n\nWhile Milo Ventimiglia’s appearance as a 70-something Jack Pearson is likely a dream, This Is Us fans may recall last season when Randall had a hallucination and saw Jack standing on a ladder at the family cabin. The cabin is also the setting for Kate’s wedding.\n\nThis won’t be the first time This Is Us has introduced an older version of a character that fell outside of the timelines the NBC drama usually focuses on. During the post-Super Bowl episode, 37-year-old Randall was shown in the future as a man in this 50s. At the time, This Is Us creator Dan Fogelman teased the alternate timeline to Deadline, saying, “We show a new timeline, in the future, which is extremely exciting for a show that plays in time and has till-now played in the past/present. But there is other stuff coming, too…there is a plan for the show, there always has been, we aren’t just shooting from the hip.” Fogelman has said the future may play a big part in This Is Us seasons to come.\n\n'This Is Us': Jack Pearson Is Old, Grey and Not Dead in Season 2 Finale Promo (Video)@NBCThisIsUs #ThisIsUs https://t.co/lGIseonNAg pic.twitter.com/uVgFYNq8sL — TheWrap (@TheWrap) March 7, 2018\n\nIn an interview with Entertainment Weekly, This Is Us star Susan Kelechi Watson, who plays Randall’s wife Beth Pearson on the show, said “The Wedding” episode will be a special one.\n\n“It’s beautiful,” Kelechi Watson said. “It felt like the natural way for this season to end. We built to this moment, so it feels very natural — this is what’s coming next, the wedding. But yet, even in the midst of all that, life for the Pearsons for each individual is still happening. So everybody is still dealing with their own stuff, but now we get to celebrate at this family event that we’ve been anticipating and feel good about. After a hard year — I mean, this was a rough one for the family, going through Jack’s death and the fire, and for slow-cookers— it’s a really beautiful way to celebrate.”\n\nThe This Is Us season 2 finale airs Tuesday at 9 p.m. ET on NBC.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Victoria Miller"], "canonical_link": "https://www.inquisitr.com/4816599/this-is-us-see-milo-ventimiglia-play-jack-pearson-as-an-old-man-in-season-2-finale", "title": "‘This Is Us’: See Milo Ventimiglia Play Jack Pearson As An Old Man In Season 2 Finale", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "This Is Us is toying with an alternate timeline in the Season 2 finale—and it&#8217;s not via a flashback or a flash forward. While the episode, titled &#8220;The Wedding,&#8221; will feature some upbeat moments as Kate Pearson (Chrissy Metz) gets ready to marry her longtime love Toby (Chris Sullivan), emotions will run high as she [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "‘This Is Us’: See Milo Ventimiglia Play Jack Pearson As An Old Man In Season 2 Finale", "url": "https://www.inquisitr.com/4816599/this-is-us-see-milo-ventimiglia-play-jack-pearson-as-an-old-man-in-season-2-finale", "type": "article", "description": "This Is Us is toying with an alternate timeline in the Season 2 finale—and it&#8217;s not via a flashback or a flash forward. While the episode, titled &#8220;The Wedding,&#8221; will feature some upbeat moments as Kate Pearson (Chrissy Metz) gets ready to marry her longtime love Toby (Chris Sullivan), emotions will run high as she [&hellip;]"}, "article": {"published_time": "2018-03-07T06:17:13", "modified_time": "2018-03-07T06:17:13", "author": "Victoria Miller"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "‘This Is Us’: See Milo Ventimiglia Play Jack Pearson As An Old Man In Season 2 Finale", "description": "This Is Us is toying with an alternate timeline in the Season 2 finale—and it&#8217;s not via a flashback or a flash forward. While the episode, titled &#8220;The Wedding,&#8221; will feature some upbeat moments as Kate Pearson (Chrissy Metz) gets ready to marry her longtime love Toby (Chris Sullivan), emotions will run high as she [&hellip;]"}}, "movies": ["https://www.youtube.com/embed/Mt6Wlyj1V90?feature=oembed"], "publish_date": 1520396233.0, "source": "https://www.inquisitr.com", "summary": ""}