{"url": "http://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "text": "Bruce Willis' daughter Tallulah gets emotional over photos with dad, 'my whole damn heart' Bruce Willis’ daughter Tallulah is focusing on the good memories she has with her father. In a recent post on Instagram, she shared a series of photos that are close to her heart. The first shows her sitting with her dad in a big chair, holding hands, and a later one shows them standing side by side in a driveway. \"Damn, these photos are hitting tonight,\" she wrote in the caption. \"You’re my whole damn heart and I’m so proud to be your Tallulah Belle Bruce Willis.\" BRUCE WILLIS Read more\n\nTragic Details Emerge About 'Euphoria' Producer Kevin Turen's Death Tragic new details have emerged in the sudden death of Euphoria and The Idol producer Kevin Turen.\n\nIf you don’t know, the 44-year-old producer died suddenly over the weekend, leaving behind his wife Evelina, and two sons, Jack and James.\n\nKeep reading to find out more…\n\nHis dad, Edward Turen, and close friend, Michael Heller, spoke to TMZ and said he suffered a medical emergency while driving with ten-year-old son.\n\nThey were in his Tesla when the medical emergency occurred. It was on Read more\n\nAngelina Jolie & Brad Pitt's Daughter Zahara Joins a Sorority! Zahara Marley Jolie-Pitt is a sorority sister!\n\nThe 18-year-old daughter of Angelina Jolie and Brad Pitt has joined the Alpha Kappa Alpha Sorority at Spelman College, her proud mother confirmed on social media.\n\nZahara introduced herself to her new sisters by saying, “My name is Zahara Marley Jolie. And [I] landed all the way from the Golden State in the city full of angels: Los Angeles, California.”\n\nKeep reading to find out more…\n\nThe college sophomore can be seen in a video on Read more\n\nMatthew Perry’s toxicology report 'should be finished,' former medical examiner says Details surrounding Matthew Perry’s death remain limited as questions mount nearly two weeks after the \"Friends\" star died. Dr. Michael Baden, former chief medical examiner of New York City, forensic pathologist and Fox News contributor, explained that while toxicology tests take time, information reportedly leaked by law enforcement may indicate that a full report is already completed. \"They’ve got pretty much 99% of what they're going to get at this point as far as information goes Read more\n\nMelissa Joan Hart turned down Playboy to protect family after Maxim controversy: 'Thank God' Melissa Joan Hart shocked fans this summer when she revealed she was nearly fired from \"Sabrina the Teenage Witch.\" The actress admitted a cover shoot with Maxim magazine, which featured her at age 23 mostly naked beneath a bedsheet, created such a controversy she was told she was in breach of contract. Although the issue was resolved after Hart wrote an apology letter, the actress says the situation led her to turn down Playboy magazine. It was a choice she made to protect her famil Read more\n\nTony Bennett's daughter shares influence Frank Sinatra had on her Tony Bennett's musician daughter is happily following in his footsteps and was lucky enough to grow up under another famous musician's influence. Antonia Bennett shared a core memory of her childhood with Fox News Digital and explained how profound it was to have legendary musicians like Frank Sinatra and Bill Evans coming in and out of her home during her formative years. \"I think one of the most meaningful things for me is just that there were so many great artists around when I was growing up Read more\n\nNicola Coughlan Spotted Filming 'Doctor Who' Christmas Special, Days After Showrunner Confirmed Her Involvement Nicola Coughlan is getting in the Christmas spirit!\n\nThe 36-year-old Bridgerton star was spotted wearing a festive outfit while popping out of a cab on the set of Doctor Who on Wednesday (November 8) in Cardiff, Wales.\n\nJust two days before she seen filming on a rainy night, showrunner Russel T Davies confirmed that she will be appearing on the long-running, fan-favorite show.\n\nGet more details inside…\n\nDuring a Q&A after a screening of the upcoming Doctor Who special “The Star Bea Read more\n\nLuke Macfarlane & Partner Hig Roberts Share Rare Photos Together After Completing NYC Marathon Luke Macfarlane and his partner Hig Roberts both completed the New York City Marathon last weekend and now they’ve shared some great photos from the special day.\n\nThe couple, who welcomed their first child into the world earlier this year, ran the race alongside Hig‘s twin sister Cassady.\n\nThe group ran the marathon in memory of Hig and Cassady‘s late brother Murphy.Keep reading to find out more…\n\n“11/5/2023– We crossed the finish line of the NYC Marathon. I am Read more\n\nReese Witherspoon's Son Deacon Phillippe Talks His Style Choices While DJing at H&M Party Deacon Phillippe is a student at NYU right now, but he’s also making time to DJ at special events!\n\nThe 20-year-old son of Reese Witherspoon and Ryan Phillippe served as the DJ for the H&M x Rabanne launch party on Wednesday (November 8) in New York City.\n\nDeacon mingled with guests Emily Ratajkowski, Paloma Elsesser, and Chloe Sevigny at the event. Also in attendance was actress Kathryn Newton, who played his mom Reese‘s daughter in the HBO series Big Little Lies.\n\nKeep reading to Read more\n\n'Big Brother' Bringing Back All-Stars in First Holiday Series That's Completely Unlike the Regular Game Julie Chen shared an exciting holiday announcement at the end of the Big Brother season 25 finale!\n\nThe host acted as if something was wrong and said there was something going inside the house, and it cut to BB alums Frankie Grande, Britney Haynes and Danielle Reyes “breaking in” to the house once again to close the multiverse that they opened at the start of the season.\n\nHowever, it took a turn and they opened a BB Holiday Universe, where it was then announced that Big Brother Reinde Read more\n\n'The Marvels' Features 5 Major Surprise Cameos - Spoilers Revealed, Including The End Credits Moments! The new Marvel Cinematic Universe film The Marvels is now in theaters and fans who check it out will be treated to some fun surprises.\n\nThere are lots of people who love to be spoiled, so we have some spoilers we can tell you ahead of time, but don’t continue reading unless you want to know!!!\n\nIn the new film, Carol Danvers (Brie Larson) aka Captain Marvel has reclaimed her identity from the tyrannical Kree and taken revenge on the Supreme Intelligence. But unintended consequences see Caro Read more\n\nMelissa Rivers Is Engaged, Reveals Fiancé Steve Mitchel Asked Her Son For Permission First Melissa Rivers and her beau Steve Mitchel are getting married!\n\nThe 55-year-old host and producer was seen wearing an engagement ring last weekend at BravoCon in Las Vegas, and the news was confirmed this week.\n\nHowever, prior to proposing, Steve, who is an attorney, made sure to get permission from someone very close to Melissa – her son Cooper Endicott!\n\nKeep reading to find out more…\n\n“Cooper means the world to me and has always been the most important man in my life,” M Read more\n\nMargot Robbie & Husband Tom Ackerley Look So Cute Together in New Australia Photos! Margot Robbie and her husband Tom Ackerley are enjoying some downtime while down under in her hometown!\n\nThe 33-year-old Oscar-nominated actress was seen linking arms with Tom while walking along a dock to board a boat on Friday afternoon (November 10) in Sydney, Australia.\n\nMargot and Tom have been in Australia for the past week and it’s unclear if she’s there for fun or if she’s getting ready to work on a new project.Just the day before, Margot was spotted in a pair of Crocs, Read more\n\nWho Plays Prince Yan in 'The Marvels'? Meet Park Seo-joon, One of Korea's Biggest Stars! Park Seo-joon has a brief role in the new movie The Marvels and it marks his Hollywood debut!\n\nThe 34-year-old actor is already one of the biggest stars in South Korea and now he’s playing the role of Prince Yan in the latest Marvel movie.\n\nSo, why is he such a big star?\n\nKeep reading to find out more…\n\nPark has his big breakout roles in the 2015 television shows Kill Me, Heal Me and She Was Pretty.He also had a brief role in the Oscar-winning movie Parasite as Ki-woo’s friend Mi Read more\n\nDwayne Johnson Reacts to Presidential Poll, Reveals He Was Asked to Run Dwayne Johnson is opening up about the possibility of him running for president one day.\n\nThe 51-year-old entertainer has been the subject of polls in the past that have had a majority of Americans saying they would vote for him if he ran.\n\nDuring the debut episode of Trevor Noah‘s What Now? podcast, Dwayne shared his thoughts about running, and even revealed that he’s been asked to run before!\n\nKeep reading to find out more…\n\n“That was an interesting poll that happened and Read more", "images": ["https://img4.newslocker.com/2023/11/10/307665955_725.jpg", "https://img4.newslocker.com/2023/11/10/307658861_725.jpg", "https://img4.newslocker.com/2023/11/10/307665961_725.jpg", "http://www.newslocker.com/images/share-twitter.png", "https://img4.newslocker.com/2023/11/10/307665949_725.jpg", "https://img4.newslocker.com/2023/11/10/307658860_725.jpg", "https://img4.newslocker.com/2023/11/10/307658863_725.jpg", "http://www.newslocker.com/images/share-facebook.png", "https://img4.newslocker.com/2023/11/10/307665951_725.jpg", "https://img4.newslocker.com/2023/11/10/307665956_725.jpg", "https://img4.newslocker.com/2023/11/10/307665948_725.jpg", "http://www.newslocker.com/images/rss.png", "https://img4.newslocker.com/2023/11/10/307665954_725.jpg", "https://img4.newslocker.com/2023/11/10/307665953_725.jpg", "https://img4.newslocker.com/2023/11/10/307665958_725.jpg", "https://img4.newslocker.com/2023/11/10/307665959_725.jpg", "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "http://www.newslocker.com/images/share-linkedin.png", "http://www.newslocker.com/images/newslocker-cube.png", "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/11/931/523/BruceWiw.jpg?ve=1&tl=1", "https://static.foxnews.com/foxnews.com/content/uploads/2023/11/tina-turner-concert-1969.gif", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2023-11/amy-carter-1-jp-231128-2b477f.jpg", "http://www.newslocker.com/images/newslocker-logo.png", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2023-11/231111-megan-rapinoe-mjf-1523-b6686b.jpg", "https://img4.newslocker.com/2023/11/10/307662853_725.jpg", "https://img4.newslocker.com/2023/11/10/307665960_725.jpg", "https://img4.newslocker.com/2023/11/10/307658862_725.jpg", "https://static.addtoany.com/buttons/share_save_120_16.gif", "https://img4.newslocker.com/2023/11/10/307665957_725.jpg", "https://img4.newslocker.com/2023/11/10/307665950_725.jpg", "https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2023-11/biden-swift-spears-mc-2x1-231120-copy-71db01.jpg", "https://img4.newslocker.com/2023/11/10/307665952_725.jpg", "https://img4.newslocker.com/2023/11/10/307658864_725.jpg", "https://img4.newslocker.com/2023/11/10/307665947_725.jpg"], "top_img": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "keywords": [], "authors": [], "canonical_link": "https://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "title": "Saturday Savings: Lucy Hale's Cute Muscle Tank Is Only $43", "meta_data": {"description": "Work out in style, like Lucy Hale.The Pretty Little Liars actress is looking super cute in her Nike leggings and color-matchingSpiritual Gangster muscle tank (which is now only $43). If...", "og": {"title": "Saturday Savings: Lucy Hale's Cute Muscle Tank Is Only $43 - Celebrity news - NewsLocker", "description": "Work out in style, like Lucy Hale.The Pretty Little Liars actress is looking super cute in her Nike leggings and color-matchingSpiritual Gangster muscle tank (which is now only $43). If...", "type": "website", "url": "https://www.newslocker.com/en-us/news/celebrity/saturday-savings-lucy-hales-cute-muscle-tank-is-only-43/", "image": "http://akns-images.eonline.com/eol_images/Entire_Site/2017314/rs_600x600-170414120302-600.Lucy-Hale-Saturday-Savings.jl.041417.jpg?downsize=450:*&crop=450:350;left,top", "site_name": "Newslocker"}, "fb": {"admins": 1335791813}, "robots": "index", "google-site-verification": "wAInSoPxz3OEgOXCHtETx-x7ukmlX40FRoiPZpO7ww4", "msvalidate.01": "2F0DB39856FAA0E47C70E9E1FF8653AA"}, "movies": [], "publish_date": 1492261200.0, "source": "http://www.newslocker.com", "summary": ""}