{"url": "https://people.com/country/carrie-underwood-face-photos-since-accident/", "text": "01 of 23 Carrie Underwood is on the road to recovery after suffering a scary accident in November that left her with more than 40 stitches in her face. The country star fell outside her Nashville home, resulting in a broken her wrist. However, it wasn't until New Year's Eve that Underwood, 35, revealed the fall also caused severe cuts to her face. \"There is also another part of the story that I haven't been ready to talk about since I have still been living it and there has been much uncertainty as to how things will end up,\" she wrote in a note to her fan club members. \"It's crazy how a freak random accident can change your life.\" She continued: \"In addition to breaking my wrist, I somehow managed to injure my face as well. I'll spare you the gruesome details, but when I came out of surgery the night of my fall, the doctor told [Underwood's husband] Mike that he had put between 40 and 50 stitches in.\" Seven weeks after the accident, Underwood said that she's on the mend but \"not quite looking the same.\" However, several weeks earlier on Dec. 12, Below Deck alum Adrienne Gang posted a photo of herself posing with Underwood at the gym. After fans pointed out it was the first time Underwood had been photographed since her accident, Gang reassured them that she looked \"amazing\" and added that she had \"no clue\" Underwood was injured.\n\n02 of 23 Carrie Underwood/Instagram On Dec. 27, several days before revealing the extent of her injuries, Underwood posted a selfie to her Instagram account with her head wrapped in a knitted scarf to ward off the winter chill. \"When in 5 degree weather, wrap your @caliabycarrie scarf around your neck and face...you keep warm AND look like an awesome winter snow ninja! #WinWin #StayThePath#LetItSnow #BabyItsColdOutside,\" she captioned the image.\n\n03 of 23 Carrie Underwood/Instagram The country music superstar's toddler son Isaiah and husband Mike Fisher joined her for a fun-filled workout in February. \"My boys make workouts fun,\" she wrote on social media alongside snaps from their sweat session, before adding that they also made things \"a bit less productive.\" \"But that's ok,\" she added.\n\n04 of 23 Carrie Underwood/Instagram Underwood took a stance against slavery in late February with a post promoting the End It Movement. \"Together, we're in it to end it! Help us shine a light on modern day slavery. @enditmovement#enditmovement,\" she captioned the photo, with her mouth obscured by a large red ex.\n\n05 of 23 In early April, Underwood revealed that she was back at work with a candid studio snap shared to Instagram. Forgoing a caption, the country star simply posted a black and white photo of herself gazing intently inside a recording facility. It was later revealed that she was hard at work on her upcoming album, Cry Pretty.\n\n06 of 23 Carrie Underwood/Instagram Two days after sharing the first photo of half her face since her November accident, Underwood revealed the first photo of her entire countenance in a new photo on Friday, April 6. The singer shared a picture from a rehearsal, in which she's clutching a microphone in front of her band. \"Missed these guys. #bandrehearsals,\" Underwood captioned the shot.\n\n07 of 23 Carrie Underwood/Instagram Two weeks later, the singer confirmed she would be performing at the ACM Awards with a photo of herself during rehearsals. \"Getting ready for the weekend…#CryPretty #ACMawards@CALIAbyCarrie,\" Underwood wrote in the caption.\n\n08 of 23 Carrie Underwood/Instagram Hours after the country singer shared a behind-the-scenes photo from her rehearsal for the award show, she gave fans an even closer look at her healing face as she shared just how excited she was to be taking the stage on Sunday. \"Had a great rehearsal for the @acmawards ! Can't wait until tomorrow night!\" she wrote alongside the image.\n\n09 of 23 Ethan Miller/Getty On April 15, the singer — who sported tear-shaped glitter makeup below her eyes — delivered an emotional performance her new single \"Cry Pretty\" at the 53rd Academy of Country Music Awards in Las Vegas, receiving a standing ovation at the end of the rendition.\n\n10 of 23 Ethan Miller/Getty Image Moments later, the American Idol alum and Keith Urban returned to the stage to accept the award for vocal event of the year for their duet \"The Fighter.\" \"You just knocked it out of the park,\" Urban told his collaborator. \"Thank you for having me,\" Underwood told Urban through tears. \"I'm still shaking right now. Thank you.\"\n\n11 of 23 Jason Merritt/ACMA2018/Getty Images for ACM Underwood clutching her ACM statue for vocal event of the year, shared with Keith Urban for their duet, \"The Fighter.\"\n\n12 of 23 Jason Merritt/ACMA2018/Getty Underwood poses at the 2018 ACMs on April 15. Although she stole the show at the Las Vegas gala, a Nashville source told PEOPLE that the singer worried about the reaction she'd get. \"She ended up skipping the red carpet because she didn't want to be bombarded with questions about the accident,\" the insider said. \"It's the most shaken anyone has ever seen her … this whole ordeal. She was terrified of people seeing the scars.\" The source added, \"Her hair and makeup team must've been under so much pressure.\"\n\n13 of 23 During an appearance on iHeartRadio's The Bobby Bones Show on April 19, Underwood gave details of the accident, explaining that it happened when she went to take her dogs out for a quick walk at night. \"I was taking the dogs out to go pee one last time, and I just — I tripped,\" she said. \"There was one step, and I didn't let go of the leashes! Priorities! So that's why my left hand's fine. But I went to catch myself and I just missed a step.\" \"If I had fallen anywhere else, I would have been perfectly fine. But it was one step that messed everything up,\" she added. \"I thought I just busted my lip,\" she later told Storme Warren on SiriusXM's The Highway channel Thursday morning in Nashville. \"Then I walked inside and took the dog leashes off and took my coat off and went to go survey the damage and was like, 'Oh, no!' I'm acting very calm about it now, but … it wasn't pretty. I chipped my tooth but it was just my skin, thank the Lord. Stitches and all that stuff.\"\n\n14 of 23 Jason Kempin/Getty The \"Jesus Take the Wheel\" singer said she was \"very fortunate in the healing process,\" though nervous that it wasn't going to be that way. \"I was at a point where I didn't know how things were going to end up,\" she continued during her interview with Storme Warren on SiriusXM's The Highway. \"I didn't know what was going to go on. I didn't know what it was going to heal like. … You just don't know how things are going to heal or end up.\" Recovery was tough, especially because Underwood is right-handed and had to adjust her handwriting. \"It set me back,\" she said. \"The most frustrating part was trying to work out with a broken wrist, and just how much it can throw off your world, having an appendage that is there, but you just can't use it.\" While Underwood went dark on social media for a bit and has kept selfies and photos of herself to a minimum since the accident, she insists she wasn't hiding. \"I mean, I don't think I hide. There's always stuff to do, even if it's not necessarily playing shows. But, I don't know. I'm kind of a homebody,\" she said. \"I was lucky that when it happened everything was shutting down in the music world — we had the holidays.\"\n\n15 of 23 Carrie Underwood/Instagram On April 20, Underwood shared a close-up picture on social media of her face — which revealed scars around her upper lip and chin — while supporting her husband, Mike Fisher, and his hockey team, the Nashville Predators. \"Ready to cheer on the boys tonight! Especially that #12! I hear he's alright! 😘 @mfisher1212 @predsnhl#LetsGoPreds,\" she captioned the snap, which featured the singer rocking a white and orange Predators hat and making a pair of fangs with her fingers.\n\n16 of 23 Carrie Underwood/Instagram Underwood didn't shy away from the cameras as she shared a video playfully documenting her husband's \"annoying\" behavior on April 28. While driving in the car with Mike Fisher, the singer took a close-up video of her face for her Instagram Story. In the clip, the 35-year-old looked directly at the camera and softly said, \"Help me,\" while her husband appeared to be making a squeaking noise over and over into his hands while driving. \"Must we? So annoying,\" she wrote alongside the video.\n\n17 of 23 John Russell/NHLI via Getty Images In her second performance since her accident, Underwood looked absolutely flawless as she sang the national anthem ahead of Mike Fisher's hockey game on April 28. \"She's a beloved music superstar but today she's a proud hockey fan and a number one Preds fan. Please welcome Carrie Underwood,\" the announcer said as the American Idol winner walked onto the ice. In a sweet nod to her husband, Underwood opted to wear a Nashville Predators shirt with her husband's number on it while she delivered a rousing rendition of \"The Star-Spangled Banner.\"\n\n18 of 23 Bruce Glikas/FilmMagic Days after singing the national anthem at the playoff hockey game, the star stepped out in New York City on May 2 to watch her pal — and fellow American Idol winner — David Cook perform in the hit Broadway musical Kinky Boots. During her visit, Underwood was all smiles as she met the rest of the Kinky Bootscast, including Pentatonix's Kirstin Maldonado. \"Star-studded at the factory last night! Thanks to @carrieunderwood and @maddiezieglerfor joining us last night at @kinkybootsbway!\" Cook wrote on social media alongside pictures of the special night.\n\n19 of 23 The Grammy Award winner gave a rousing performance at the Grand Ole Opry in Nashville, Tennessee, on May 11 to celebrate her 10-year anniversary since she became a member of the legendary concert hall. Underwood, 35, shared a selfie of herself on Instagram before taking the stage, writing in the caption, \"10 year anniversary #OprySelfie @opry ❤❤❤.\"\n\n20 of 23 Chris Hollo for the Grand Ole Opry As part of her set at the Opry, Underwood sang some of her hits including \"Jesus, Take the Wheel,\" \"Cry Pretty\" and \"Temporary Home.\" She also sang a Randy Travis classic, \"An Old Pair of Shoes.\" To round out the night, Underwood was surprised by Travis himself onstage with a bouquet of flowers. It was a full circle moment as it was Travis who invited Underwood to join the institution during a show in March 2008.\n\n21 of 23 ABC/Eric McCandless Thirteen years after shooting to fame on American Idol, the Season 4 champion returned to the singing competition on May 13 to deliver a soaring rendition of her new single, \"Cry Pretty.\" In addition to singing, Underwood appeared on Idol as a guest mentor for the singing hopefuls. The contestants honored the star's homecoming with versions of some of her biggest hits. Caleb Lee Hutchison sang \"So Small\" and Cade Foehner performed \"Undo It,\" but it was Gabby Barrett who brought down the house with a version of \"Last Name\" that stunned Luke Bryan. \"It's like Carrie Underwood reincarnated,\" the suitably impressed judge marveled.\n\n22 of 23 Carrie Underwood/Instagram Underwood was seen out and about in Napa Valley, California with her husband, Nashville Predators caption Mike Fisher, in advance of her headlining performance at the Live in the Vineyard Goes Country festival on May 17. The happy couple cuddled up for a sweet Instagram snap that showed off the bucolic scene from deep in the heart of wine country. \"Napa Valley, you are my happy place!\" Underwood captioned the photo. \"Amazing wine, beautiful scenery, wonderful friends, new places and a yummy dinner created by @chefchiarello and his apprentice, Isaiah Fisher! And that was just the first day here! Life is good…❤❤❤\"", "images": ["https://people.com/thmb/6_3xfUH8o9xjLnpNjrXrx2jRt8g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(680x385:682x387)/Jana-Kramer-kids-060823-tout-b7f606ceead94e8faf892e86cb1c874c.jpg", "https://people.com/thmb/OF7UxuMsz7JcqwuX8eCu4976OvY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood-1-20001-09a4ae34ce134dc4ab903071ab217236.jpg", "https://people.com/thmb/rLI7_5aqMEu9-AX__AlNGMulD98=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x614:981x616)/carrie-underwood-kids-1-c206abcafc014505b94df61f2be1a429.jpg", "https://people.com/thmb/br-VukD2ufOJtHI-teeNC84hpE8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(840x0:842x2)/carrie-underwood7-1-2000-a54ef14b63e24829bce97e4685007cb0.jpg", "https://people.com/thmb/85EGjkUes2XYqT0xPwdBpGTjFPw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(939x494:941x496)/liev-schreiber-taylor-niesen-1-1bed46d3f3204cb883164416045e0850.jpg", "https://people.com/thmb/Y9eh4APf_RXZTlfnoJBVh0tOOV8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/morgan-wade-country-musician-friend-of-kyle-richards-070523-01-bd467e7585a946208ccc12a9c4d1cc6e.jpg", "https://people.com/thmb/GIXrG_KpBbgg6hJpPDTpm3e8tVQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(755x0:757x2)/carrie-underwood-acm-4092f3934d6a407c89068620080a47be.jpg", "https://people.com/thmb/N5izO1OQMp1IyQ0026ZKzg1MVxM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x49:751x51)/carrie-underwood-breakfast-031023-1-3dc4d1f4cc3a4f9d8f24f66644942911.jpg", "https://people.com/thmb/974oyAJrR3wpcmTdIvwoZQ-voEU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(647x175:649x177)/eric-jessie-james-decker-050123-3-0b147d3cb9524a539e129f0efe3097b7.jpg", "https://people.com/thmb/i5W0CwlOj0kFW9P2Hv6-HaE3_EY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(596x0:598x2)/carrie-underwood-aeb7cd71e9ce48b98ed2e5213290e979.jpg", "https://people.com/thmb/kIqvVuLhFPgAks3svCLefMjaGyM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(978x499:980x501)/michelle-buteau-gijs-van-der-most-1-c5b1ab9d44654b5d9f979da253b7bc42.jpg", "https://people.com/thmb/zXLwI3Gtttg-ccOR_6ivq3d_z4Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x494:961x496)/trevor-marissa-lawrence-1-56aa777f6aa34f42af21da1b30ea30f6.jpg", "https://people.com/thmb/Wl5I-e2ZksyK-hwB85LYxnTCFYw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/carrie-underwood-1-2000-e1ca9b0e2eb94799adee4ff27a7bf6ce.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/GHC7NQXeWAjAlkCmG3MNb0nxsvA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(665x0:667x2)/underwood-urban-1-2000-9d605ab5efc24e10bd55443ae9eec1d5.jpg", "https://people.com/thmb/khA5MFhD9TkTF1HZPAquGu6J8nY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x524:981x526)/jesse-palmers-emely-fardo-tout-e7a6e36a90f54de5976b827ff3a20519.jpg", "https://people.com/thmb/ClBp229NbJ9tYv-S8JB4DVrsH34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(793x0:795x2)/carrie-underwood7-ad09bb19795d42b6bdbf31809547109a.jpg", "https://people.com/thmb/wHWSAd0zzrvvZlXytcZZ1kWv6vI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(717x0:719x2)/carrie-underwood-33-1-81cc9925c9334b8ca61af27f50737ff0.jpg", "https://people.com/thmb/xj-Nv5Sqzh-q6LkPe_fGtqbCyTA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Joanna-Stevens-Gaines--5b1884f1644c4b8e8d268ee9d3c7c5e9.jpg", "https://people.com/thmb/KjetEqz6gskHWVfZWpLWAEFa2Ro=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/carrie-underwood1-2e8026ffa2c34c6d91587e93438cf5cc.jpg", "https://people.com/thmb/3ldjLEGAmMab0M5KqUdlsfxcJ0M=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x464:981x466)/nicole-kidman-keith-urban-1-e43e256257304335a4b30fce9732b3f7.jpg", "https://people.com/thmb/QsMiE01rz-6oK9umHMSW0PadSjI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/carrie-underwood-22-f12a6f70e3594669b418750b0a5a1f02.jpg", "https://people.com/thmb/bbFw-9JT_u-faw58omg72Rl2wS4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood4-fd5bd50135be468189bef7487eff4bf7.jpg", "https://people.com/thmb/8HW9ORSsCRTFmlUzp6pgBRuimF8=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/Jordan_runtagh-50437936b9b24b0bbdfc72abb75010b3.jpg", "https://people.com/thmb/MDH5tp_5DQ0iRyL9SGQy4fnNKA0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(655x417:657x419)/brody-jenner-tia-blanco-engagement-061923-1-adf85ccb05874d31ab5bfd932ae7498a.jpg", "https://people.com/thmb/KUHOHxgHeMUJsLg6XvUOaeEGU04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/carrie-underwood6-d903acd887df484eb84ea4ee2e167553.jpg", "https://people.com/thmb/yDFhB6322cClNgiwFuprxH18m_c=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood-1-a109f46873274f3294757b7e180aaf09.jpg", "https://people.com/thmb/4TMQQnerKIyOaqzuV8eczwEzo-k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x479:1001x481)/dierks-bentley-cassidy-black-tout-989e65d930614abba2713b38d73716bf.jpg", "https://people.com/thmb/2WEp36mpLrDe1QoO0hz2cthO1Vo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(761x187:763x189)/celebs-taylor-swift-080923-tout-392ac56db7d946b188b6149b75ea9ad6.jpg", "https://people.com/thmb/dGsuZX4dC9xLByeI8h7yn3FC2ic=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood8-2000-e280cda153de461c89aa5cb2e69485da.jpg", "https://people.com/thmb/6BxBrXwzy6VE1fHI8yzr-XWpKug=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(539x0:541x2)/carrie-underwood-12-4346fa4556f84ea79d694a8d03c0d3be.jpg", "https://people.com/thmb/DHIpIxT6PGRMz8h5YfaYtvgCFAw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(506x0:508x2)/carrie-underwood5-2-e33212ad65c74d7b84078c8af4760d40.jpg", "https://people.com/thmb/vlKH5bzOlUi8GyIyB3BYAK39ti4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/carrie-underwood-41-0815ca9c06cc4b85b5666cfa21cf39dd.jpg", "https://people.com/thmb/3OcIThuZSJcc0wEHbo55YBRwoXY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(821x239:823x241)/chris-morgan-stapleton-1-f94d626da5bc4609b879ac9f014e2008.jpg", "https://people.com/thmb/EhZORDYCwvcz-kamL1lInomUGjs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(614x0:616x2)/carrie-underwood6-1-2000-32a3b6ed594642fd906a03ccc4cbfca6.jpg", "https://people.com/thmb/DEAEGzzj4_Dri0gZJg3rAl_XRwo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(707x0:709x2)/carrie-underwood1-1-1cded0b1428d4706b1c9ffa145614fee.jpg", "https://people.com/thmb/gSy0ehS72I52ZDISrqnY5na06uU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(374x0:376x2)/carrie-underwood11-19230725a7974b23a55d2a54fb29cbfb.jpg"], "top_img": "https://people.com/thmb/ClBp229NbJ9tYv-S8JB4DVrsH34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(793x0:795x2)/carrie-underwood7-ad09bb19795d42b6bdbf31809547109a.jpg", "keywords": [], "authors": ["Jordan Runtagh", "Jordan Runtagh Is An Executive Podcast Producer At Iheartradio", "Where He Hosts A Slate Of Pop Culture Shows Including", "People Editorial Guidelines"], "canonical_link": "https://people.com/country/carrie-underwood-face-photos-since-accident/", "title": "From Hurt to Healed: Every Photo of Carrie Underwood Since Her Accident", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Carrie Underwood is on the road to recovery since suffering a scary accident in November that left her with between 40 and 50 stitches in her face", "emailcontenttype": "LISTSC", "emailvertical": "PEOPLE", "sailthru.author": "Jordan Runtagh", "parsely-section": "Entertainment", "parsely-tags": "Tags,Entertainment,Country,Music,News,Carrie Underwood,Celebrity", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/country/carrie-underwood-face-photos-since-accident/", "title": "From Hurt to Healed: Every Photo of Carrie Underwood Since Her Accident", "description": "Carrie Underwood is on the road to recovery since suffering a scary accident in November that left her with between 40 and 50 stitches in her face", "image": "https://people.com/thmb/ClBp229NbJ9tYv-S8JB4DVrsH34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(793x0:795x2)/carrie-underwood7-ad09bb19795d42b6bdbf31809547109a.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "From Hurt to Healed: Every Photo of Carrie Underwood Since Her Accident", "description": "Carrie Underwood is on the road to recovery since suffering a scary accident in November that left her with between 40 and 50 stitches in her face", "image": "https://people.com/thmb/ClBp229NbJ9tYv-S8JB4DVrsH34=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(793x0:795x2)/carrie-underwood7-ad09bb19795d42b6bdbf31809547109a.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.149.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.149.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.149.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.149.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.149.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}