{"url": "www.inquisitr.com/4766138/kristen-stewart-robert-pattinson-2018-actress-rumored-to-direct-their-next-film-together-and-quit-acting/", "text": "Kristen Stewart has been linked to several personalities since she broke up with Robert Pattinson in 2013. The former couple rose to fame when they starred in the popular vampire-themed film series called Twilight. Now, rumors have it that the two could possibly get reunited again in a brand new project.\n\nAn OK! Magazine insider, as cited by Hollywood Life, claimed that Kristen Stewart and Robert Pattinson have met again after several years since their infamous split. The tipster stated that the former co-stars are planning to work together on a new movie. The same source said the project would be different from the Twilight series, which was based on the novels of Stephenie Meyer.\n\n“Kristen is more hesitant than Rob right now, but they’ve agreed to discuss it. Separately, they’d each jump at it, but working together isn’t an easy yes for them given the fan hysteria that surrounded their split years ago.”\n\nThe informant stated that the alleged upcoming film would be “edgy” and their roles have “absolutely nothing in common” with Edward Cullen and Bella Swan. It was claimed that the Kristen Stewart and Robert Pattinson would not portray a couple in their next project together. Aside from that, there are also speculations suggesting that the Personal Shopper actress is already thinking of quitting acting to focus more on directing full-length films. Because of this, some fans cannot help but speculate that Kristen Stewart could possibly direct her next movie with Robert Pattinson.\n\nHowever, Gossip Cop was quick to debunk the claims. The publication revealed that Kristen Stewart does not have plans to quit acting to become a full-time director anytime soon. The news outlet suggested that the wrongful speculations sparked after the former girlfriend of Robert Pattinson made her directorial debut last year during the Sundance Film Festival. Reports about the actress co-authoring a case study about neural style transfer have also added fuel to the rumors.\n\n???\n\nKristen Stewart & Robert Pattinson: New Movie Together? ‘In Talks’ – Hollywood Life https://t.co/8jBQWknjMP — ??~filmania~?? (@P__Paulie) January 24, 2018\n\nGossip Cop also denied the claims saying that Kristen Stewart and Robert Pattinson are “teaming up again” for a reunion project. It stated that both stars have numerous movies already lined up in the upcoming years. The news outlet also confirmed that there is no incoming production that would feature the two former Twilight lead stars.\n\nKristen Stewart steps out braless as ex Robert Pattinson splits from FKA Twigs https://t.co/3bq1rSfz2w — HollywoodLife (@HollywoodLife) October 20, 2017\n\nThe ex-couple has yet to confirm or deny these unverified claims. Therefore, avid followers of the Twilight stars should take everything with a grain of salt until these speculations are proven true and correct. Stay tuned for the latest news and updates about Kristen Stewart and Robert Pattinson!", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Nica Virtudazo"], "canonical_link": "https://www.inquisitr.com/4766138/kristen-stewart-robert-pattinson-2018-actress-rumored-to-direct-their-next-film-together-and-quit-acting", "title": "Kristen Stewart, Robert Pattinson 2018: Actress Rumored To Direct Their Next Film Together And Quit Acting", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Kristen Stewart has been linked to several personalities since she broke up with Robert Pattinson in 2013. The former couple rose to fame when they starred in the popular vampire-themed film series called Twilight. Now, rumors have it that the two could possibly get reunited again in a brand new project. An OK! Magazine insider, [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Kristen Stewart, Robert Pattinson 2018: Actress Rumored To Direct Their Next Film Together And Quit Acting", "url": "https://www.inquisitr.com/4766138/kristen-stewart-robert-pattinson-2018-actress-rumored-to-direct-their-next-film-together-and-quit-acting", "type": "article", "description": "Kristen Stewart has been linked to several personalities since she broke up with Robert Pattinson in 2013. The former couple rose to fame when they starred in the popular vampire-themed film series called Twilight. Now, rumors have it that the two could possibly get reunited again in a brand new project. An OK! Magazine insider, [&hellip;]"}, "article": {"published_time": "2018-02-03T03:33:12", "modified_time": "2018-02-03T03:33:12", "author": "Nica Virtudazo"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Kristen Stewart, Robert Pattinson 2018: Actress Rumored To Direct Their Next Film Together And Quit Acting", "description": "Kristen Stewart has been linked to several personalities since she broke up with Robert Pattinson in 2013. The former couple rose to fame when they starred in the popular vampire-themed film series called Twilight. Now, rumors have it that the two could possibly get reunited again in a brand new project. An OK! Magazine insider, [&hellip;]"}}, "movies": [], "publish_date": 1517621592.0, "source": "http://www.inquisitr.com", "summary": ""}