{"url": "https://en.wikipedia.org/wiki/Amber_Rose", "text": "American model\n\nAmber Rose Levonchuck (born October 21, 1983)[1] is an American model, rapper and television personality. She first gained attention after starring in the music video for Young Jeezy's 2008 single, \"Put On\", which featured Kanye West. The same year, she entered a heavily publicized two-year romantic relationship with West, of whom led her to model for Louis Vuitton advertising campaigns. The following year, she signed a modeling contract with Ford Models, while earning wider recognition as a video vixen[2] in numerous hip hop videos.[3]\n\nAfter splitting from West in 2010, Levonchuck began dating rapper Wiz Khalifa, whom she married in 2013. She filed for divorce in 2014. Following this, she released her first book, How to Be a Bad Bitch, published by Simon & Schuster. In 2015, she founded the Los Angeles chapter of the SlutWalk protest march, an annual feminist demonstration founded in Toronto. In 2016, Levonchuck hosted her own talk show, The Amber Rose Show for VH1. That same year, she also began hosting the syndicated radio call-in program Loveline.\n\nEarly life [ edit ]\n\nAmber Levonchuck was born on October 21, 1983, in Philadelphia, Pennsylvania, to Dorothy Rose[1] and Michael Levonchuck. Her father is of Irish and Italian descent[4] and her mother is of Cape Verdean and maternal Scottish descent from Ayrshire. She has one brother named Antonio Hewlett.[5] Rose grew up in South Philadelphia.[6]\n\nLevonchuck claimed to have begun stripping at the age of 15 under the pseudonym \"Paris,\" to provide for her family after her parents' divorce. On Van Lathan's The Red Pill podcast, she claimed that she also attempted to sell crack cocaine, but was not successful.[4][7]\n\nCareer [ edit ]\n\nLevonchuck's appearance in the music video for Young Jeezy's 2008 single Put On\" caught the attention of Kanye West, who guest performed on the song and video.[8] Levonchuck then gained wider exposure after posing for a Louis Vuitton print advertisement featuring West's sneaker line.[9] She walked the runway at New York Fashion Week for \"Celestino,\" and later made cameos in music videos including Nicki Minaj's \"Massive Attack,\" Young Jeezy's \"Vacation\", Wiz Khalifa's \"No Sleep\", Fabolous' \"You Be Killin' Em\", Ludacris' \"What Them Girls Like\" and Future's \"Mask Off\".[10] She was signed with modeling agency Ford Models from 2009 to 2010.[11]\n\nIn 2010, she appeared in Russell Simmons's reality show about his two assistants, Running Russell Simmons. She also starred in a PSA by NOH8 Campaign.[12] In 2011, Levonchuck was a guest judge on Season 3 of RuPaul's Drag Race. She was also a judge on Season 2 of Master of the Mix. In November 2011, she became the spokesperson for Smirnoff and appeared in television ads and billboards for the company's new flavors Whipped Cream and Fluffed Marshmallow.[13]\n\nMusical pursuits [ edit ]\n\nLevonchuck released her debut single \"Fame,\" which featured her then-fiancé Wiz Khalifa, on January 10, 2012,[14] followed by a second single, titled \"Loaded,\" the following month.[15] She then rapped on the eleventh track of Khalifa's O.N.I.F.C., titled \"Rise Above,\" along with rappers Tuki Carter and Pharrell Williams, the latter of whom produced the song.[16] She was managed by Leticia \"Tish\" Cyrus, the mother of singer Miley Cyrus, who was Levonchuck's and Khalifa's close friend.[17]\n\nBusiness endeavors [ edit ]\n\nRose at the People magazine awards in December 2014\n\nIn September 2009, Levonchuck announced plans to launch her own eyewear line. In 2012, Levonchuck opened a clothing line with her friend Priscilla Ono called Rose & Ono.[4][18] Levonchuck guest-starred on an episode of Wild 'N Out on MTV2, and had a role as \"MaryWanna\" in the film School Dance, which was directed by her then-manager, Nick Cannon in 2014.[19] Simon & Schuster published her first book, How to Be a Bad Bitch, in which she offers advice and personal anecdotes on everything from finances and career to love and fashion. The cover features an image shot by famed photographer David LaChapelle.[20]\n\nIn 2015, Levonchuck filmed \"Walk of No Shame with Amber Rose\" with Funny or Die.[21] The viral video helped promote Rose's SlutWalk, which took place on October 3, 2015, in Los Angeles, California.[22] In March 2016, Levonchuck launched an emoji app called MuvaMoji,[23] featuring 900 emoji icons which she curated. In May 2016, it was announced that Levonchuck would star in her own talk show titled The Amber Rose Show on VH1,[24] which debuted on July 8, 2016.[25] On September 8, 2016, Levonchuck began hosting Loveline.[26]\n\nDancing with the Stars [ edit ]\n\nOn August 30, 2016, Levonchuck was announced as one of the celebrities who would compete on the 23rd season of Dancing with the Stars. She was partnered with professional dancer Maksim Chmerkovskiy.[27] They were eliminated on October 17 and finished in ninth place.[28]\n\nPersonal life [ edit ]\n\nRelationships [ edit ]\n\nLevonchuck dated rapper Kanye West for two years, starting in 2008.[29]\n\nShe began dating rapper Wiz Khalifa in early 2011. The couple got engaged on March 1, 2012,[30] and married on July 8, 2013.[31] Their son was born in 2013.[32] Levonchuck, Khalifa, and their son divided their time between homes in Los Angeles and Canonsburg, Pennsylvania.[33][34][35] Rose filed for divorce from Khalifa on September 22, 2014, citing irreconcilable differences and planned to take full custody of their son.[36] As of 2015, Rose and Khalifa have joint custody of their son.[37]\n\nLevonchuck dated Machine Gun Kelly in April 2015. They split up two months later.[38]\n\nIn 2016, Levonchuck dated NBA player Terrence Ross.[39]\n\nBeginning in summer 2017, Levonchuck was dating 21 Savage.[40] As of March 2018, the couple have separated.[41]\n\nIn 2009, in regard to her sexual orientation, Levonchuck stated, \"I'm extremely open with my sexuality. I can be in love with a woman, I can be in love with a man. As far as humans go, I definitely find beauty in everybody, whether they're heavy-set, super-skinny, if they're white, black, Indian, Asian, Spanish. I can see beauty in anybody. If I see a woman and I think she's beautiful and I like her, and she likes me back we can definitely try to be in a relationship together.\"[42] In 2016, Rose disclosed to guest Margaret Cho during an episode of her podcast Love Line with Amber Rose that she once dated a trans man.[43]\n\nOn April 3, 2019, Levonchuck on Instagram that she is expecting her second child with Def Jam executive Alexander \"A.E.\" Edwards.[44] In October 2019, Levonchuck gave birth to a son.[45]\n\nSlutWalk [ edit ]\n\nIn October 2015, Levonchuck led the Los Angeles-based SlutWalk to honor all women who have been judged and demeaned for their sexual behavior. As part of the event, she spoke publicly about the instances of shaming she has experienced, specifically mentioning an incident at the age of 14, when a male classmate pulled his genitals out while in a closet with her playing the kissing game \"seven minutes in heaven\". Levonchuck related that he tricked her into kneeling down in front of him, then threw open the closet door for all of their friends to see, suggesting oral sex had taken place. Rose grew visibly agitated while speaking about the bullying that followed, demonstrating for her audience the depth of the trauma the experience caused.[46] Levonchuck has since been associated with the event annually.[47]\n\nFilmography [ edit ]", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Amber_Rose_2018_by_Glenn_Francis.jpg/1200px-Amber_Rose_2018_by_Glenn_Francis.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Amber_Rose_-_2014_People_Magazine_Awards_%28cropped%29.jpg/170px-Amber_Rose_-_2014_People_Magazine_Awards_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Amber_Rose_2018_by_Glenn_Francis.jpg/220px-Amber_Rose_2018_by_Glenn_Francis.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/b/b7/Pending-protection-shackle.svg/20px-Pending-protection-shackle.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Amber_Rose_2018_by_Glenn_Francis.jpg/1200px-Amber_Rose_2018_by_Glenn_Francis.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Amber_Rose", "title": "Amber Rose", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Amber_Rose_2018_by_Glenn_Francis.jpg/640px-Amber_Rose_2018_by_Glenn_Francis.jpg", "width": 640, "height": 960}, "title": "Amber Rose - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}