{"url": "https://www.inquisitr.com/4814631/tiffany-haddish-and-brad-pitt-agreed-to-hook-up-if-theyre-single-in-2019-girls-trip-star-reveals/", "text": "Tiffany Haddish and Brad Pitt have an agreement. In a year, if they’re both single, they’ll hook up with each other in what could become one of the unlikeliest celebrity pairings ever. Haddish, the breakout star of Girls Trip, made the revelation during an interview with Kelly Ripa at the 2018 Academy Awards as they played a round of “Marry, Date or Dish,” E! News reports.\n\nTiffany said that she met Angelina Jolie’s estranged husband by chance in an elevator that night.\n\n“Oh I just met him an the elevator, he said in one year if he’s single and I’m single we gonna do it, so you know what that means,” Haddish said.\n\n“But he do got seven kids, I don’t know if I could deal with a man that’s got that many kids.”\n\nFor the record, Brad Pitt has six kids with Jolie.\n\nAs for hook up predictions for Brad Pitt, Tiffany Haddish needs to get in line. Since the public breakup of Jennifer Aniston and Justin Theroux’s marriage, there have been lots of rumors that Aniston is going to reunite with her ex-husband.\n\nHaddish received loads of attention at the Oscars. Her dress on the red carpet was one of the night’s standout ensembles. As CNN reports, Tiffany wore a zuria, which is a type of dress native to Eritrea, her father’s homeland. During an interview on the red carpet, Tiffany said her now-deceased father made her promise to pay homage to Eritrea if she ever ended up at The Oscars.\n\n“He said one day I would end up here, and if I ever end up at the Oscars to honor my people,” she said of her dress choice.\n\nThe decision went over well with viewers on social media, with many Eritreans expressing pride at their culture being represented on the Academy Awards’ red carpet.\n\nI'm usually with the #BoycottTheOscars & #OscarsSoWhite teams…but #ERITREA represented by @TiffanyHaddish at #Oscars2018 was too ?????? to avoid! It's so much more than a dress for us, it's the #eritreastolemyheart narrative vs. distorted \"analysis\" spewed by the media!! pic.twitter.com/CFsY5KdkZJ — Milena Bereket (@0to1infinity) March 5, 2018\n\nBut that wasn’t the only Tiffany Haddish gown that got attention. Later that night, she changed into a white Alexander Mcqueen number to present an award and do a comedy bit with SNL alum, Maya Rudolph. During her own stint as an SNL host last year, Tiffany swore that she would wear the dress multiple times because it cost more than her mortgage. Haddish and Rudolph’s comedy stole the show as they delivered lines that triggered laughs from the audience and were a hit on social media as well. There were even calls for them to host The Oscars next year.\n\nRemarkable human Tiffany Haddish now has worn the same dress three times like she said she would https://t.co/BtGLupX71L pic.twitter.com/mATCiAi4D3 — BuzzFeed (@BuzzFeed) March 5, 2018\n\nHaddish has definitely extended the 15 minutes of fame she received as the breakout star of Girls Trip into an enviable career. Ever since the movie broke box office records, she’s put out a best selling book, hosted a comedy special on Showtime and appeared in Superbowl commercials for Groupon. This year, she’ll host the MTV Movie And TV Awards. Will she one day add a gig as the host of The Academy Awards to her growing resume? We’ll have to wait and see. As Tiffany would say, “She Ready!”", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Patricia Grannum"], "canonical_link": "https://www.inquisitr.com/4814631/tiffany-haddish-and-brad-pitt-agreed-to-hook-up-if-theyre-single-in-2019-girls-trip-star-reveals", "title": "Tiffany Haddish And Brad Pitt Agreed To Hook Up If They’re Single In 2019, The ‘Girls Trip’ Star Reveals", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Tiffany Haddish and Brad Pitt have an agreement. In a year, if they&#8217;re both single, they&#8217;ll hook up with each other in what could become one of the unlikeliest celebrity pairings ever. Haddish, the breakout star of Girls Trip, made the revelation during an interview with Kelly Ripa at the 2018 Academy Awards as they [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Tiffany Haddish And Brad Pitt Agreed To Hook Up If They’re Single In 2019, The ‘Girls Trip’ Star Reveals", "url": "https://www.inquisitr.com/4814631/tiffany-haddish-and-brad-pitt-agreed-to-hook-up-if-theyre-single-in-2019-girls-trip-star-reveals", "type": "article", "description": "Tiffany Haddish and Brad Pitt have an agreement. In a year, if they&#8217;re both single, they&#8217;ll hook up with each other in what could become one of the unlikeliest celebrity pairings ever. Haddish, the breakout star of Girls Trip, made the revelation during an interview with Kelly Ripa at the 2018 Academy Awards as they [&hellip;]"}, "article": {"published_time": "2018-03-05T21:45:36", "modified_time": "2018-03-05T21:45:36", "author": "Patricia Grannum"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Tiffany Haddish And Brad Pitt Agreed To Hook Up If They’re Single In 2019, The ‘Girls Trip’ Star Reveals", "description": "Tiffany Haddish and Brad Pitt have an agreement. In a year, if they&#8217;re both single, they&#8217;ll hook up with each other in what could become one of the unlikeliest celebrity pairings ever. Haddish, the breakout star of Girls Trip, made the revelation during an interview with Kelly Ripa at the 2018 Academy Awards as they [&hellip;]"}}, "movies": [], "publish_date": 1520279136.0, "source": "https://www.inquisitr.com", "summary": ""}