{"url": "https://usweekly.com/news/22/7664/is-the-bachelors-obsession-with-proposals-hurting-the-franchise.html", "text": "Oliver Stone is a Hollywood leftist who has an odd way of being right at times.\n\nHis Academy Award-winning JFK was dismissed as a conspiracy theory.\n\nTurns out he was likely closer to right all along -- as Tucker Carlson noted in one of this segments.\n\nThat's not the only one. His South of the Border documentary about Latin America's wave of elected leftist dictators was initially criticized as Chavista propaganda, a glossing over of some of the region's worst rulers ... except that if you watch the thing, which I did twice, you realize he did an extraordinary job of revealing these people as the unattractive pigs that they were. Sleazy, covetous, Imelda-like, sidelong, gangsterly ... he actually exposed them in all their glory in a way their worst critics couldn't. That was a useful record of the era.\n\nHe's criticized government bureaucracies' demonization of ivermectin and vaccine mandates which is credibility right there.\n\nHis criticism of the way the Vietnam War was run by vested interests and swamp bureaucrats was probably spot on, too.\n\nSo now he's dropped another truth bomb, or at least is circling around it.\n\nAccording to RealClearPolitics, which showed a segment and transcript of Stone conversing with Bill Maher:\n\nSome of the transcript (they go off on tangents) is here, emphasis mine:\n\nMAHER: Well, I mean, [Trump] doesn't concede elections. You know, the elections only count if we win theory of government. Okay. Well, come on. You know, Trump has he still has not conceded the election. He has not conceded. He does not honor them. Okay.\n\n\n\nSTONE: I mean, do you know for a fact that he lost? I'm just curious.\n\n\n\nMAHER: Okay. You're going to make me --\n\n\n\nSTONE: I just don't know all of the facts.\n\n\n\nMAHER: Well I do. Is there a conspiracy theory that you don't believe?\n\n\n\nSTONE: Come on, Bill. You know I'm intelligent.\n\n\n\nMAHER: Intelligent? Of course you are. But look, look, I've had many people sit here and I'd say the same thing to them. Like, the key to getting along in America is not getting into these tribal things. It's understanding that you can have somebody in your life who you go for A, B, C, and D, We are so aligned and the person is so smart and they really get it.\n\n\n\nAnd then E each of you thinks the other one's crazy and there's a couple of those with us, but we got A, B, C, and D, and so we just.\n\n\n\nOLIVER STONE: We'll start with that.\n\n\n\nMAHER: Yes, that's got to be enough. You can't make people like agree with you on these things. And you're right when you --\n\n\n\nSTONE: I'm just asking you, I'm not an expert on the election. I don't go on. I'm not a political junkie. You are. And you follow it very closely. Okay.\n\n\n\nMAHER: All right, then I'll give you the thumbnail sketch. They tried it in like 60 courts. It was laughed out of every court, including by Republican judges. Report The people who save this democracy were Republicans. Good Republicans. In states where Trump pressured them like the guy, the one he's on trial for in Georgia. Find me 11,000 votes. It's on tape.\n\n\n\nA guy like that saying to him, sir, we just don't do that here. I voted for you. I'm a Republican, but we just don't do that. That's what saved us. And they were Republicans. So you don't take their word for it. I mean, it would.\n\n\n\nSTONE: I don't know. I mean, you went through the 2000 election. That was horrifying to me. What happened when the Supreme Court closed that down. What happened there? You know, the popular vote was --\n\n\n\nMAHER: What should we do? Do we just keep counting votes forever? Or should we still be counting them now?\n\n\n\nSTONE: No. Count them correctly.\n\n\n\nMAHER: The people who have testified that this was a fair and will [sic] run election. It's a who's who of people like Bill Barr. Mitch McConnell. You're talking about Liz Cheney. You're talking about dyed in the wool, serious conservative Republicans who went with Trump really further out than a lot of us thought they would go with a guy like McCain's not a war hero.\n\n\n\n[...]\n\n\n\nSTONE: Well, I don't know the facts. And I think I would trust the accountants more than the politicians. And I'd like to know what the accountants, the guys who vote, who know the most about votes, who do the Electoral Commission's, you know. I can't take Biden's word for it on anything.\n\n\n\nMAHER: It's not his word. It's the Electoral Commission. It's Trump's own election security guy who said this was the most fair, well-run election that we've had ever.\n\n\n\nSTONE: Really?\n\n\n\nMAHER: Yes.\n\n\n\nSTONE: I don't know about that. Okay. I don't know about that.\n\n\n\nMAHER: Well, I mean, if there's nothing that can be said or argued that would convince you --\n\n\n\nSTONE: You, I think it would shock people --\n\n\n\nMAHER: Then they called it --\n\n\n\nSTONE: -- Joe [Biden] got so many got so many votes. You know, that was what was shocking, that he did so well compared to what he was expected to do --\n\n\n\nMAHER: Right.\n\n\n\nSTONE: -- because we believed all the East Coast media --\n\nThat's the thinking of an independent thinker, someone who asks again and again what we really know from hard knowledge and what we really know only from the press.\n\nIt's startling in its candor, not a full-blown admission of Trump support, but a person who can critically think and use his own knowledge to reason out strange things that have happened since. He cites the bad media treatment of Pete Rose as his theory on why people stick close to Trump, and his experience with the 2000 election, which he seems to think as stolen, as something that leaves the realm of stolen elections a distinct possibility since he believes it has happened before.\n\nHis views are not all that 'conspiratorial' as Maher seemed to want to dismiss them as. Polls show that a majority of Republicans believe the elections these days do have fraud -- as do a sizable minority of Democrats. They didn't get into it in the conversation, but many Democrats think our elections are compromised by cheating.\n\nStone stood his ground and didn't back away from the questions that Maher had no serious answers to -- claiming that the press, numerous neverTrumps and many neverTrump judges had reported the election as free and fair. Just because someone says so does not make it so, and that was why Maher kept misfiring at Stone and Stone held his ground. Stone also suggested that there were a lot of liars out there -- from the COVID shambles around vaccines and the like, to Joe Biden himself, whom he couldn't bring himself to believe a word he said.\n\nOne can only hope that Stone looks at this matter ever more closely. He's onto something. He's sniffing, he's asking questions and he might come up with a tremendous new work from it. Once again, he could be confoundingly correct.\n\nImage: YouTube screen shot", "images": ["https://www.americanthinker.com/assets/images/at-painter.gif", "https://www.americanthinker.com/assets/images/nav_icon.png", "https://www.americanthinker.com/assets/images/ICON-TWITTER.gif", "https://www.americanthinker.com/assets/images/icon-print.png", "https://www.americanthinker.com/images/bucket/2023-11/250365.jpg", "https://www.americanthinker.com/assets/images/at-logo-long.png", "https://www.americanthinker.com/assets/images/mewe.png", "https://www.americanthinker.com/assets/images/down_arrow.png", "https://www.americanthinker.com/assets/images/gettr_square.png", "https://www.americanthinker.com/assets/images/ICON-FACEBOOK.gif", "https://www.americanthinker.com/assets/images/at-newsletter-signup-graphic.gif", "https://www.americanthinker.com/assets/images/at-logo.gif"], "top_img": "https://www.americanthinker.com/images/bucket/2023-11/250365.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.americanthinker.com/blog/2023/11/even_oliver_stone_is_starting_to_question_the_2020_election.html", "title": "Even Oliver Stone is starting to question the 2020 election", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "og": {"title": "Even Oliver Stone is starting to question the 2020 election", "image": "https://www.americanthinker.com/images/bucket/2023-11/250365.jpg", "url": "https://www.americanthinker.com/blog/2023/11/even_oliver_stone_is_starting_to_question_the_2020_election.html", "description": "Oliver Stone is a Hollywood leftist who has an odd way of being right at times.\n\nHis Academy Award-winning JFK was dismissed as a conspiracy theory.\n\nTurns out he was likely closer to right all along -- as Tucker Carlson noted in one of this segm...", "type": "article"}, "twitter": {"image": "https://www.americanthinker.com/images/bucket/2023-11/250365_1_.jpg", "site": "@AmericanThinker", "card": "summary_large_image", "title": "Even Oliver Stone is starting to question the 2020 election", "description": "Oliver Stone is a Hollywood leftist who has an odd way of being right at times.\n\nHis Academy Award-winning JFK was dismissed as a conspiracy theory.\n\nTurns out he was likely closer to right all along -- as Tucker Carlson noted in one of this segm..."}, "fb": {"app_id": 1006646233035842}, "photoCredit": "youtube", "photoCreditURL": "https://www.youtube.com/watch?v=s6mMt6-XsGM"}, "movies": ["https://www.youtube.com/embed/s6mMt6-XsGM?si=13ET0hTrKRlDlvjJ"], "publish_date": null, "source": "https://usweekly.com", "summary": ""}