{"url": "https://en.wikipedia.org/wiki/Sarah_Rose_Summers", "text": "American model (born 1994)\n\nSarah Rose Summers Combs (born November 4, 1994)[citation needed] is an American model and beauty pageant titleholder who was crowned Miss USA 2018. As Miss USA, she represented the United States at Miss Universe 2018, where she placed in the top 20. Previously, Summers was crowned Miss Nebraska USA 2018 and went on to become the first woman from Nebraska to win the Miss USA title.\n\nEarly life and education [ edit ]\n\nSummers was born on November 4, 1994, in Omaha, Nebraska, and grew up in Papillion in the Omaha–Council Bluffs metropolitan area.[1] At four years old, she was hospitalized and diagnosed with idiopathic thrombocytopenic purpura (ITP).[2]\n\nShe graduated from Papillion-La Vista South High School, and later earned two degrees cum laude from Texas Christian University in child development and strategic communication, with a minor in business. While a student, she also joined the Zeta Tau Alpha (ΖΤΑ) sorority.[3][4] Summers worked as a certified child life specialist prior to becoming Miss USA.[5][6][7]\n\nPageantry [ edit ]\n\nSummers (far left) and other Miss Teen USA 2012 state titleholders at Miss USA 2012 in Las Vegas\n\nSummers began her pageantry career at age ten, having convinced her parents to allow her to compete in pageants when they received a postcard advertisement for a local child beauty pageant.[8][9] After four years of competing, she won the title of National American Miss Nebraska Junior Teen 2009 and represented Nebraska at the national pageant and was crowned the 2009–2010 National American Miss Junior Teen. In 2012, Summers was crowned Miss Nebraska Teen USA 2012. She represented Nebraska at Miss Teen USA 2012 at Atlantis Paradise Island in Nassau, Bahamas, but was unplaced.[10] At the end of her reign, she crowned Jasmine Fuelberth as her successor.[11] After a hiatus, Summers returned to pageantry and competed in Miss Nebraska USA 2016.[citation needed]\n\nIn 2018, Summers was crowned Miss Nebraska USA 2018 by Fuelberth, who was the outgoing titleholder. At Miss Nebraska USA 2018, Summers represented Omaha.[12]\n\nMiss USA 2018 [ edit ]\n\nAfter winning Miss Nebraska USA, Summers earned the right to represent Nebraska at Miss USA 2018, held at Hirsch Memorial Coliseum in Shreveport, Louisiana.[13] She won the competition, beating out first runner-up Caelynn Miller-Keyes of North Carolina and second runner-up Carolina Urrea of Nevada, becoming the first woman from Nebraska to win Miss USA.[14][15][16][17][3] After winning Miss USA, she crowned Bree Coffey as her Miss Nebraska USA successor; pageant protocol states that the two titles cannot be held coterminously as her new Miss USA duties would have interfered with her duties as Miss Nebraska USA.\n\nAs Miss USA 2018, Summers represented the United States at Miss Universe 2018 in Bangkok Thailand, where she placed in the top 20. Her national costume was based on a red rose, the national flower of the United States which also happens to be Summers's middle name. The eventual winner was Catriona Gray of the Philippines.[18][19] Summers ended her reign on May 2, 2019, after crowning Cheslie Kryst as Miss USA 2019 in Reno, Nevada.[20][21][22][23]\n\nPersonal life [ edit ]\n\nSummers became engaged to longtime boyfriend Conner Combs in Bangkok on December 17, 2018, shortly after competing at Miss Universe 2018.[24][25][26] They married on October 20, 2019, in Anthem, Arizona.[27]\n\nReferences [ edit ]\n\n\n\n", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/23px-Flag_of_the_Philippines.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Sarah_Rose_Summers_2018.jpg/1200px-Sarah_Rose_Summers_2018.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/95/Sarah_Summers_at_Miss_USA_2012.jpg/220px-Sarah_Summers_at_Miss_USA_2012.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Sarah_Rose_Summers_2018.jpg/220px-Sarah_Rose_Summers_2018.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Sarah_Rose_Summers_2018.jpg/1200px-Sarah_Rose_Summers_2018.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Sarah_Rose_Summers", "title": "Sarah Rose Summers", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Sarah_Rose_Summers_2018.jpg/640px-Sarah_Rose_Summers_2018.jpg", "width": 640, "height": 960}, "title": "Sarah Rose Summers - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}