{"url": "www.parents.com/pregnancy/my-life/emotions/4-winter-pregnancy-worries-and-how-to-deal/", "text": "It's the one time you're actually supposed to eat more—and yet it suddenly seems like every food is off-limits. Here, is the final word on which foods to skip and which ones are A-OK during pregnancy.\n\n01 of 12 Cold Cuts and Deli Meat cobraphotography/Shutterstock Watch Out: As with soft cheeses, there's a small risk that harmful listeria bacteria may lurk in fresh-from-the-deli-counter meats like turkey and ham. Dr. Morse also advises steering clear of the whole, cooked rotisserie chickens and turkey breasts if they're being stored in a refrigerated case. Listeria can survive cold temps, which means there's still an off-chance they could make you sick; however, chicken that has been recently cooked and is still under the warmer is fine. Bottom line: Avoid deli meat straight from the counter, but you can eat it heated up. If the meat is steaming or feels fully warmed through, it's safe (the heat will kill any harmful bacteria). Granted, the idea of nuked ham slices seems pretty gross. But think of it this way: panini! And if you're really in the mood for a turkey sandwich, you can indulge occasionally with sealed, pre-packaged cold cuts from the grocery store's refrigerated section. They're generally considered safer because there's less handling – and potential germ spreading – involved.\n\n02 of 12 Soft Cheeses Blaine Moats Watch Out: Cheeses like feta, goat cheese, Brie, Camembert, blue cheese, and Mexican queso fresco or queso Blanco are more apt to be made with unpasteurized milk than harder cheeses like cheddar or Swiss. \"There's a chance these soft cheeses could contain listeria, a bacteria that would otherwise get killed during pasteurization. This infection can lead to miscarriage or preterm delivery,\" says Karyn Morse, MD, an ob-gyn at Cedars Sinai Medical Center in Los Angeles. What's more, if a woman contracts the illness later in pregnancy, her baby may also become infected. \"Newborns who are infected with the bacterium can become very sick from meningitis or a bloodstream infection. Nearly 6 percent of them will die,\" says Kelly Jackson, M.P.H., an epidemiologist with the U.S. Centers for Disease Control and Prevention. Small-batch artisan cheeses (even harmless-sounding ones, like cheddar) are also often unpasteurized. Bottom line: Check the ingredient list for the word \"pasteurized\" or opt for cooked cheese instead. You don't have to ban all cheese from your diet during pregnancy – whether it's soft or hard, it's safe to eat as long as the ingredient list says \"pasteurized milk.\" (Remember to check salad dressings that contain cheese too.) The good news is, many of the soft cheeses you find in a typical grocery store are pasteurized now, says Julie Redfern, RD, a senior nutritionist with the Ob-Gyn department at Brigham and Women's Hospital in Boston. If you're out at a restaurant and aren't sure, ask your server to check, or pick a dish that's made with cooked cheese, like chicken parm. \"Even if it's unpasteurized, if the cheese is heated until it's melted or bubbly, then it's safe,\" says Redfern.\n\n03 of 12 High-Mercury Fish Watch Out: Certain fish – mostly big, top-of-the-food chain types – contain high levels of mercury, which isn't good for anyone's health (pregnant or not), but they can be particularly harmful to a developing baby's nervous system, lungs, kidneys, vision, and hearing. On the Do-Not-Eat list: shark, swordfish, tilefish, king mackerel, orange roughy, grouper, tuna steaks, saltwater bass, and canned solid white albacore tuna (which is bigger, and has therefore more mercury than the smaller tunas used in the kind labeled \"chunk light\"), according to Redfern. Bottom line: Steer clear of high-mercury fish, but don't give up seafood entirely. Getting enough DHA (found in abundance in seafood and flaxseed) is one of the most important things you can do for your and your developing baby's health, nutritionists say. DHA is the omega-3 fatty acid that can boost your baby's brain development before birth, leading to better vision, memory, motor skills, and language comprehension in early childhood. You should aim for up to 12 ounces a week (or about two generous servings) of \"safe fish\" – including salmon, shrimp, haddock, cod, catfish, flounder, sole, tilapia, and scallops. If you love tuna fish sandwiches, you can still eat the canned light kind once a week (about three to six ounces). Oh, and needless to say, we're talking about cooked fish here (more on sushi next).\n\n04 of 12 Sushi and Sashimi Watch Out: There's a slight chance that raw fish may contain bacteria or microbes that could cause food poisoning. \"But the main concern with sushi is that in the unlikely event that you get a parasite, it's not only exceedingly unpleasant, but it's also harder to treat in pregnancy. The parasite can also take vital nutrients away from your growing baby,\" says Dr. Morse. Plus, some of the most popular sushi rolls (like spicy tuna) may contain too-high mercury levels. Bottom line: Skip raw-fish sushi, but rolls made with fully-cooked fish are A-OK. Sushi made with eel, crab, or anything tempura-style (which means it's been battered and fried) is perfectly safe to eat. California rolls also make the go-for-it list, as do veggie rolls, like avocado or cucumber.\n\n05 of 12 Raw or Runny Eggs Watch Out: There's a slight risk of salmonella and other food-borne illnesses from eggs cooked sunny side up, and from sources of uncooked eggs such as Caesar salad dressing or raw cookie dough. \"Your immune system is weaker when you're pregnant, which means that a bug that wouldn't have caused food poisoning before may affect you more now,\" says Redfern. Also, vomiting or diarrhea that would have just been uncomfortable and annoying before you were pregnant can more easily trigger dehydration now, which has the potential to affect fetal growth and in rare cases can lead to preterm labor. Bottom line: As long as you make sure your eggs are cooked through, it's safe to eat them – and you should! Eggs are a great source of protein and choline, a nutrient that research shows may boost fetal brain development and prevent certain birth defects. FYI: Most Caesar dressing from the supermarket is not made with raw eggs; it's the kind freshly prepared at restaurants that you should avoid.\n\n06 of 12 Coffee, Soda, or Any Caffeinated Beverage Valentyn Volkov/Shutterstock Watch Out: Some research shows that lots of caffeine (considered to be more than two to three cups of coffee a day) can raise your risk of miscarriage. It has also been linked to preterm delivery and low birth weight. A Kaiser Permanente study, for example, found that pregnant women who consumed more than 200 milligrams of caffeine a day had double the miscarriage risk of those who had none. \"There's no magic cut-off point, but the less the better,\" says the study's lead author, perinatal epidemiologist De-Kun Li, M.D., Ph.D. Bottom line: Limit your caffeine intake, but you don't have to cut it out entirely. Most experts agree that a small cup of coffee or soda or two a day is probably fine. (Talk to your doctor if you're concerned or you have a history of miscarriage or preterm labor.) The tricky thing is that coffee's potency can vary greatly depending on the beans and how it's brewed. The cup you get at Starbucks, for example, is likely to be way stronger than the one you'd make at home. As a general rule, an 8-ounce home-brewed cup of java packs about 100 milligrams. Regular tea and caffeinated sodas contain about one-third of this amount per serving. Stay under 10 ounces of regular coffee and 20 ounces of regular tea; anything more should be decaf.\n\n07 of 12 FoodstoAvoid.mp4\n\n08 of 12 Saccharine Scott Little Watch Out: Experts advise avoiding saccharine, the stuff in Sweet N' Low, during pregnancy. \"Unlike other artificial sweeteners, like Equal or NutraSweet, saccharin can cross the placenta,\" Redfern says. \"Even though it's been shown to be harmless in people, we recommend skipping it just to be extra cautious.\" Bottom line: Skip Sweet'N Low, but you can use other artificial sweeteners in moderation. Those made with aspartame and sucralose, like Equal, NutraSweet, NutraTaste, and Splenda, are safe, according to the Food and Drug Administration (FDA). However, while a diet Coke or the packet of Equal you sprinkle into your cereal is probably fine, you don't want to eat and drink the stuff all day long, says Redfern. \"It's not so much that they're unsafe, they're just not a healthy choice,\" says Redfern. \"Especially when it comes to things like diet soda – you're sipping fake everything instead of something actually nutritious, like 100 percent fruit juice or skim milk.\" For a natural low-calorie drink, she suggests adding two ounces of juice to 14 ounces of water with ice.\n\n09 of 12 Herbal Teas Robyn Lehr Watch Out: Some herbs can have medicinal effects just like actual drugs, which is why the FDA and many doctors advise steering clear of certain varieties. Even though the amount of herbs used in commercial teas isn't believed to be strong enough to cause problems, because the FDA doesn't regulate them, there's no way of knowing exactly how potent they are. \"I generally recommend patients avoid teas containing chamomile and hibiscus because some evidence suggests that in high amounts they may cause problems like preterm labor,\" says Dr. Morse. \"But the main reason we're so cautious is that we just don't have a lot of data here.\" Comfrey and sassafras are other herbs that experts recommend pregnant women avoid. Bottom line: Check your herbal tea ingredient label and ask your doctor if there's anything in it you should avoid. Not all herbs are unsafe during pregnancy – a cup or two of mild mint or fruit-flavored tea is fine, says Dr. Morse. So are green and black teas (just read the labels and watch your caffeine intake). And stick to known brands to be on the safe side.\n\n10 of 12 Spicy Foods Watch Out: Piling on those jalapenos can give pregnant women major heartburn, something you're already prone to these days. While spicy food won't harm your baby, it can feel lousy for you. And women with GERD (gastroesophageal reflux disease, a more severe, chronic form of heartburn) should take extra care to avoid spicy dishes. Bottom line: If you get heartburn, skip anything spicy; if you don't, indulge away. (Just have Tums at the ready when you chow down.) If you've heard rumors that things like hot peppers, curries, Tabasco, fiery sauces, and the like are thought to bring on labor, ignore them. There's no evidence that they do.\n\n11 of 12 Alcohol Shutterstock Watch Out: It's a well-established fact that drinking alcohol frequently during pregnancy can seriously harm an unborn baby, causing a number of physical and mental birth defects. But we don't yet know exactly how much is harmful. There's no research, for instance, on the effects of having just a couple of drinks during pregnancy, so experts can't say what – if anything – is considered a safe amount. They do know that alcohol crosses the placenta right away, so your baby drinks whatever you do. \"Since we don't know how much alcohol it actually takes to harm a fetus, it's best to just have none,\" says Dr. Morse. Bottom line: It's safest to stick to virgin versions of your favorite drinks until the baby arrives. But it's up to you and your healthcare provider to decide what you're comfortable with. Some doctors may be okay with a small glass of bubbly on New Year's Eve or an occasional drink toward the end of pregnancy.", "images": ["https://www.parents.com/thmb/6f8ux0R5HeqxLL2FTOF15zKx_kc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/p_MPC113679-4f878d8f057d409792714e321358243e.jpg", "https://www.parents.com/thmb/LiW-zGFCMisRCjLut28vXm4xifM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1367666605-2929493b43b14cb5b192e6e15d4348d4.jpg", "https://www.parents.com/thmb/7Nn5YebwOSmqlNHtqhX12Sln47U=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1435640817-bb6e374699c242f5b85a056395a2b845.jpg", "https://www.parents.com/thmb/FMRfeJGo4opAG6W8qwJdMWX5lIQ=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/550_RU257821-fe5dbeedf3a94a59b28a549b89d8b009.jpg", "https://www.parents.com/thmb/XCFAM6XnyONIszVYOtUImFKzzfY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1382274869-2000-ab491d9b1bef4947ad9ced2e81b29750.jpeg", "https://www.parents.com/thmb/9qR7cnaSNqphOsGsfslz2UcZTcY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1-sushi-GettyImages-1360641847-937afbc3acd54b068c23127f138896b7.jpg", "https://www.parents.com/thmb/W_0OAC9IrrNRqsPvvJ_3Z_y7sS4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/550_101650422-b4f306a917ab4fcda223a590553fe764.jpg", "https://www.parents.com/thmb/qMQFktaLkZvwW-fevCUKMROdtlM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1456043094-a243b4fe73b6439e83d77c16373cbe8f.jpg", "https://www.parents.com/thmb/OoPCTdWoi1TzWN0BRtpJxW-_XbM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1305781865-2000-b41668aa4bc64411ae9bd1dded761a4f.jpg", "https://www.parents.com/thmb/kmxcPDB_h4_6ZWEpsVm_bkbniH8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1300100653-2000-037b9dab82e34dd29c840b2c407c2d7e.jpg", "https://www.parents.com/thmb/bsevtIYZhIsq_w_7IO7VlF2K6WA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Parents-GettyImages-1327630162-71f6194a91af4b5a99df43d2fef62db7.jpg", "https://www.parents.com/thmb/CKffcF65LR2BjBrQCCo4iSrJpPo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/shutterstock_220538089-20c48e6ea45f46deb48657835e1eab81.jpg", "https://www.parents.com/thmb/HafHOlvg0UVZ7WSw01ra2394CVw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/p_iStock_000003158936-b6b5ffea49c84dd599432819bf3a27a4.jpg", "https://www.parents.com/thmb/E3rw7Vkc3-NfoOPaIIzy4t9W7KY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/parents-best-prenatal-vitamins-479f8347e11a4e88925e47b87abf4855.jpg", "https://www.parents.com/thmb/5RTTGkYyHPyj4mQxlkfouS0ejyQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/pregnant-woman-eating-peanut-butter-1645cae6e2ce4ae9b5ef9722250acf3b.jpg", "https://www.parents.com/thmb/fz3s1GjLyFbCSkI188Vu6EaRqqw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/What20to20eat20when20trying20to20get20pregnant_STILL-33de3b6204704cb4afe1b4bf86e21034.jpg", "https://www.parents.com/thmb/20jbWMWBG2DV4SB9e7RrNeSPYTg=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/shutterstock_369747443-6fb7f374e9de4fc0ab2662669fe5d337.jpg", "https://www.parents.com/thmb/blFbdkJjJt-QgkOi34yZ7OEhmr8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/103391733-9ced895170af430bbe646ac80bcc52f2.jpg", "https://www.parents.com/thmb/p-6-XlNk_5lwlAwpvtYq20qo00k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/shutterstock_540997561-4bd67164ec56426cbb176581202c7676.jpg", "https://www.parents.com/thmb/60zxu7fMEPh1tMFvzujo1ltWVMY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/p_101657621-93597c9e7be243749ea2c6474ad8edef.jpg", "https://www.parents.com/thmb/ACmhOG2hsJXDh_lYvCc6nf5ndDY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/shutterstock_162414935-79eed57f261848b588fb632230de3655.jpg", "https://www.parents.com/thmb/XnyADs_ObSPDrkRmZfqcfpS3tEc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/p_RU250780-0a06fddc46e846dca9e0f15ff25641c1.jpg", "https://www.parents.com/thmb/HmF861N3c5NuKwK0X1VAo6G4a0o=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/RU201681-e8ccc2128e9945149e7e58644c27297f.jpg", "https://www.parents.com/thmb/OjUNsyxqjQrN-2P4bsajYCsXLxE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1024130982-2000-bf2314daf40d4f3cb0d78ea33cd74427.jpg", "https://www.parents.com/thmb/LDrdR3xMXpz6dZUtzD8M03zBGWs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1473229269-68b05bd8b6744fdaaa81f1619cc3e5eb.jpg", "https://www.parents.com/thmb/ZSFcPJBpouIbiXxMmYk6lmezkfg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Stocksy_txpcc234554c6V300_Medium_4327752-218df61410ff4630850129dcaaaba1c8.jpg", "https://www.parents.com/thmb/D9orPahuQN1fFwLB1iT-5j42tUI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1094579318-2000-1127a3a83d3b403a82ab8cef849af25a.jpg"], "top_img": "https://www.parents.com/thmb/9qR7cnaSNqphOsGsfslz2UcZTcY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1-sushi-GettyImages-1360641847-937afbc3acd54b068c23127f138896b7.jpg", "keywords": [], "authors": ["Shaun Dreisbach", "Suzanne Schlosberg"], "canonical_link": "https://www.parents.com/pregnancy/my-body/nutrition/safe-pregnancy-eating/", "title": "What's Safe to Eat When You're Pregnant — And What's Not", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "It's the one time you're actually supposed to eat more -- and yet it suddenly seems like every food is off limits. Here, the final word on which foods to skip and which ones are A-OK during pregnancy.", "emailcontenttype": "LISTSC", "emailvertical": "PARENTS", "sailthru.author": "Shaun Dreisbach and Suzanne Schlosberg", "parsely-section": "Pregnancy", "parsely-tags": "Pregnancy,My Pregnant Body,Pregnancy Nutrition", "article": {"section": "Parents", "author": "https://www.facebook.com/parents/"}, "fb": {"app_id": 206760937387333}, "og": {"type": "article", "site_name": "Parents", "url": "https://www.parents.com/pregnancy/my-body/nutrition/safe-pregnancy-eating/", "title": "What's Safe to Eat When You're Pregnant — And What's Not", "description": "It's the one time you're actually supposed to eat more -- and yet it suddenly seems like every food is off limits. Here, the final word on which foods to skip and which ones are A-OK during pregnancy.", "image": "https://www.parents.com/thmb/9qR7cnaSNqphOsGsfslz2UcZTcY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/1-sushi-GettyImages-1360641847-937afbc3acd54b068c23127f138896b7.jpg"}, "twitter": {"card": "summary_large_image", "site": "@parents", "title": "What's Safe to Eat When You're Pregnant — And What's Not", "description": "It's the one time you're actually supposed to eat more -- and yet it suddenly seems like every food is off limits. Here, the final word on which foods to skip and which ones are A-OK during pregnancy.", "image": "https://www.parents.com/thmb/BiqYXqt7H6DXMjfcUhtl1RSU8z0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x638:1041x640)/1-sushi-GettyImages-1360641847-937afbc3acd54b068c23127f138896b7.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.144.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.144.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.144.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.144.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.144.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "http://www.parents.com", "summary": ""}