{"url": "https://en.wikipedia.org/wiki/Gal_Gadot", "text": "Israeli actress and model (born 1985)\n\nGal Gadot-Varsano[6][7] (née Gadot; Hebrew: גל גדות Hebrew pronunciation: [ˈɡal ɡaˈdot];[8] born 30 April 1985[9]) is an Israeli actress and model. She was crowned Miss Israel 2004 and represented her country at the Miss Universe 2004 pageant. She then served in the Israel Defense Forces for two years as a combat fitness instructor, whereafter she began studying at IDC Herzliya while building her modeling and acting careers.[10][11][12]\n\nHer first international film performance was as Gisele Yashar in Fast & Furious (2009), a part she reprised in several sequels. Gadot achieved global stardom for her portrayal of Wonder Woman in the DC Extended Universe films, including Batman v Superman: Dawn of Justice (2016) and Wonder Woman (2017).[13][14][15] She has since starred in the Netflix action-comedy film Red Notice (2021) and the mystery film Death on the Nile (2022).\n\nGadot was included on the list of the 100 most influential people in the world by Time in 2018, and has placed twice in annual rankings of the world's highest-paid actresses.\n\nEarly life [ edit ]\n\nGadot was born on 30 April 1985 in Petah Tikva,[note 1] where she first lived;[21] she was later raised in the city of Rosh HaAyin.[20] In Hebrew, her given name means \"wave\" and her surname means \"riverbanks\".[19] Prior to her birth, her parents had Hebraized their surname from \"Greenstein\" to \"Gadot\".[22] Her father is Michael Gadot, an engineer, and her mother is Irit (née Weiss), a physical education teacher.[23] Gadot has a younger sister named Dana.[24][25] Gadot's father is a sixth-generation Sabra.[26] Her maternal grandparents were born in 20th-century Europe; her grandfather survived the Holocaust following his imprisonment at the Auschwitz concentration camp during Nazi Germany's occupation of Czechoslovakia, while her grandmother managed to escape the continent before the outbreak of World War II.[26][27][28]\n\nGadot has stated that she was brought up in a \"very Jewish, Israeli family environment\".[23] Growing up in Israel, she learned and danced jazz and hip-hop for 12 years,[23] and her first jobs were working at a local Burger King as well as babysitting.[28] She graduated from Begin High School in Rosh HaAyin, majoring in biology.[28] As Jewish high schools in Israel often take their sophomores on trips to Holocaust memorial sites, Gadot went to Poland to gain a first-hand understanding of two Nazi concentration camps: Auschwitz and Majdanek. About the experience, she reminisced: \"I stood there on top of a mountain of ashes. I, an entitled child, felt the suffering the Muselmann experienced back then. When it was time to give my speech at the memorial ceremony, my eyes filled up with tears, and I could not control the shivering. I returned home more mature and cried with my grandfather about that, coming a full circle from his childhood to mine.\"[28]\n\nAt 20, Gadot enlisted in the Israel Defense Forces as a combat fitness instructor as part of her mandatory two years of military service.[3][4] She has said that her military background helped her to win the role of Gisele Yashar in the 2009 film Fast & Furious, stating: \"I think the main reason was that the director Justin Lin really liked that I was in the military, and he wanted to use my knowledge of weapons.\"[29] After her military service, Gadot studied law at IDC Herzliya college in Israel (now Reichman University).[11][12][30]\n\nCareer [ edit ]\n\nModeling and beauty pageant career [ edit ]\n\nGadot entered the Miss Israel national beauty pageant at 18, under the impression that it would be a \"fun\" experience, and stated in a Glamour interview: \"I never thought I would win.\"[31][32][33] She subsequently won and went on to compete for Israel in the Miss Universe 2004 pageant that took place that year in Ecuador.[34]\n\nShe has led international campaigns as a model for Miss Sixty, Huawei smartphones, Captain Morgan rum, Gucci fragrances, Vine Vera skincare[35][36] and Jaguar Cars. In 2015, she became the face of Gucci's Bamboo perfume brand.[37] She has been featured as the covergirl on Cosmopolitan, Glamour, Bride Magazine, Entertainment Weekly, UMM, Cleo, Fashion, Lucire, FHM. Gadot was the main model for fashion brand Castro from 2008 to 2016.[38] In 2013, her combined annual modeling and acting salary was estimated at NIS 2.4 million.[39]\n\nIn 2007, a then 21-year-old Gadot was in the Maxim photo shoot \"Women of the Israel Defense Forces\"[40][41] and was then featured on the cover of the New York Post.[42]\n\nIn 2017, Gadot was placed at number one on FHM's \"100 Sexiest Women in the World\" list.[43]\n\nIn 2018, Gadot became a brand ambassador for Revlon and Reebok. She appeared in advertisements for Revlon's \"Live Boldly\" campaign and Reebok's \"Be More Human\" campaign.[44][45]\n\nActing [ edit ]\n\nAfter Gadot had completed her first year of college, a casting director contacted her agent to have Gadot audition for the part of Camille Montes in the James Bond film Quantum of Solace.[30] Although she lost the part to Olga Kurylenko, a few months later, Gadot starred in the 2008 Israeli drama Bubot. Three months later, the casting director from her Quantum of Solace audition chose Gadot over six other actresses for the role of Gisele Yashar in the action film Fast & Furious, the fourth film in the Fast & Furious franchise.[46][47] Gadot performed some of her own stunt work in those films.[48]\n\nIn 2010, she had small roles in the action comedy Date Night and the action-adventure comedy Knight and Day.[49] 2011 brought her back to the Fast & Furious franchise, reprising her role as Gisele in Fast Five; she reprised the character in 2013's Fast & Furious 6.[50]\n\nIn 2016, Gadot portrayed Wonder Woman in the superhero film Batman v Superman: Dawn of Justice. Gadot received swordsmanship, Kung Fu, kickboxing, capoeira and Brazilian jiu-jitsu training in preparation for the role. She was almost cast as Faora-Ul in Man of Steel, but she rejected the part for her pregnancy. Antje Traue was cast instead.[51][52][53] Gadot's performance as the superhero, which was the character's first appearance in film, was singled out as one of the best parts of the film.[54]\n\nGadot, fellow Wonder Woman actress Lynda Carter, DC Entertainment President Diane Nelson, Wonder Woman director Patty Jenkins and U.N. Under-Secretary-General Cristina Gallach appeared at the United Nations on 21 October 2016, the 75th anniversary of the first appearance of Wonder Woman, to mark the character's designation by the United Nations as its \"Honorary Ambassador for the Empowerment of Women and Girls\".[55][56] The gesture was intended to raise awareness of UN Sustainable Development Goal No. 5, which seeks to achieve gender equality and empower all women and girls by 2030.[55][56][57] The decision was met with protests from UN staff members who stated in their petition to UN Secretary-General Ban Ki-moon that the character is \"not culturally encompassing or sensitive\" and served to objectify women. As a result, the character was stripped of the designation, and the project ended on 16 December.[57] She then had a small role in John Hillcoat's crime-thriller Triple 9, where she starred along with Kate Winslet and Aaron Paul.[58] Later that year, she co-starred in the action crime thriller film Criminal, as the wife of Ryan Reynolds' character,[59] alongside Kevin Costner, Gary Oldman, and Tommy Lee Jones.[60] Her final film of the year was the action comedy Keeping Up with the Joneses, in which she played a secret agent, alongside Zach Galifianakis, Jon Hamm, and Isla Fisher.[61]\n\nIn 2017, Gadot starred in a solo film for her character, Wonder Woman. She reprised the role in the ensemble film Justice League, which was released in November 2017, and was her third DC Extended Universe installment.[62][63][64] That same year, Gadot was invited to join the Academy of Motion Picture Arts and Sciences.[65]\n\nIn 2018, Time magazine named Gadot one of the 100 most influential people in the world,[66] and Forbes ranked her as the tenth highest-paid actress in the world, with annual earnings of $10 million.[67] In the same year, Gadot voiced Shank in the Walt Disney Animation Studios film Ralph Breaks the Internet.[68] Gadot appeared in the music video for Maroon 5's song \"Girls Like You\" (2018) featuring Cardi B.[69]\n\nIn 2020, Forbes ranked Gadot as the third highest-paid actress in the world, with annual earnings of $31.5 million.[70] On 11 October 2020, Gadot was confirmed to be reuniting with Wonder Woman director Patty Jenkins on Cleopatra, an epic film centered on Cleopatra, which was originally going to be distributed by Paramount Pictures.[71] Later, Jenkins moved to produce the project with Kari Skogland set to direct.[72]\n\nIn 2021, Gadot starred alongside Dwayne Johnson and Ryan Reynolds in the Netflix action comedy film Red Notice, written and directed by Rawson Marshall Thurber.[73] The following year, she co-starred with Kenneth Branagh, Armie Hammer, Ali Fazal, Tom Bateman, and Annette Bening in the 2022 mystery film Death on the Nile, which was also directed by Branagh.[74] In 2023, Gadot made uncredited cameo appearances as Wonder Woman in Shazam! Fury of the Gods and The Flash.[75][76][77][78] She also returned to the Fast & Furious franchise with a cameo appearance in Fast X.[79] Later that year, she played the lead role of a double agent in Netflix's action film Heart of Stone.[80] The film received mixed reviews, with Owen Gleiberman stating: \"Gadot is game, but there’s a slightly downbeat earnestness about her that doesn’t mesh with the reflexive quippiness of the dialogue.\"[81]\n\nGadot will star as the Evil Queen in a live-action adaptation of Disney's 1937 animated film Snow White and the Seven Dwarfs, and also produce and star in a remake of Alfred Hitchcock's 1955 film To Catch a Thief.[82][83]\n\nProducer [ edit ]\n\nIn October 2019, Gadot formed a film and television production company, Pilot Wave, with her husband Jaron \"Yaron\" Varsano, and said she will star in and co-produce an Apple TV+ limited series about actress and inventor Hedy Lamarr, as well as the Warner Bros. historical thriller film Irena Sendler, following the life of WWII humanitarian Irena Sendler.[84][85]\n\nIn 2020, Gadot co-produced, as well as starred, in the film Wonder Woman 1984.\n\nOther work [ edit ]\n\nIn 2008, Gadot participated in Tfos Ta'Festigal – Harpatka BaMetzulot (Festigal 2008), the highest-grossing annual Israeli musical show for kids during the Jewish holiday of Hanukkah, where Gadot took part as one of the local Israeli celebrities; and she acted, sang and danced – dressed as a mermaid.[86][87]\n\nGadot was named as celebrity endorser for Smartwater in 2020, replacing Jennifer Aniston, who had served in that role since 2008.[88]\n\nPersonal life [ edit ]\n\nGadot married Israeli real estate developer Jaron \"Yaron\" Varsano[note 2] in 2008.[92] They have three daughters, born in 2011,[93] 2017, and 2021.[94][50][95][96] The two formed their own film and television production company, Pilot Wave, in 2019.[85] Gadot and Varsano owned a boutique hotel in Tel Aviv, Israel, which she helped run,[97] that eventually was sold to Roman Abramovich in 2015 for $26 million.[98]\n\nGadot is an avid martial arts enthusiast. She possesses a black belt in both karate and Krav Maga. She has served as a trainer and combat instructor for the Israel Defense Forces (IDF). Her extensive background knowledge in martial arts played a key part in helping her land the role of Wonder Woman.[99][100][101]\n\nPublic image [ edit ]\n\nOn June 26, 2023, the Hollywood Chamber of Commerce announced that Gadot would receive a star on the Hollywood Walk of Fame, class 2024, making her the first person of Israeli descent to receive the honor.[102] In 2023, Gadot was awarded the LifeSaver Award by ELEM/Youth in Distress in Israel.[103]\n\nDuring the 2014 Gaza War,[104] Gadot posted on Facebook a picture of herself and her daughter praying in front of Shabbat candles in support of the IDF, accompanied by a comment that quickly accumulated over 200,000 likes as well as more than 15,000 comments of both support and criticism:[105][106]\n\nI am sending my love and prayers to my fellow Israeli citizens. Especially to all the boys and girls who are risking their lives protecting my country against the horrific acts conducted by Hamas, who are hiding like cowards behind women and children ... We shall overcome!!! #weareright #freegazafromhamas #stopterror #coexistance #loveidf\n\nDuring the 2021 Israel–Palestine crisis, Gadot called for peace between the two territories in a statement that drew backlash for expressing support for Israel and referring to the Palestinians as her \"neighbours\", instead of calling them by name.[107][108][109]\n\nDue to her former involvement in the Israel Defense Forces, her films Wonder Woman (2017) and Death on the Nile (2022) have been banned in Lebanon, Kuwait, Jordan, and in several other Middle Eastern countries.[110][111]\n\nImagine (2020) [ edit ]\n\nIn March 2020, Gadot and a number of other celebrities, including her Wonder Woman 1984 co-star Kristen Wiig, performed an online version of the song \"Imagine\" by John Lennon, intended to raise morale during the COVID-19 pandemic.[112] The video received backlash with critics dismissing it as an ineffective response to the pandemic; Jon Caramanica of The New York Times called it \"an empty and profoundly awkward gesture\".[113][114][115][116][117] Gadot later acknowledged the video did not garner the positive reaction that had been intended, but was unapologetic in explaining the thinking behind it.[118] In a 2022 interview with InStyle magazine, Gadot admitted that the video was done in \"poor taste\", but still maintained that it had \"pure intentions\".[119]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nKey † Denotes films that have not yet been released\n\nTelevision [ edit ]\n\nMusic videos [ edit ]\n\nCommercials [ edit ]\n\nYear Company Promoting Region Ref. 2009–2014 Castro Fashion Israel 2013 Vine Vera Cosmetics United States 2014–2015 Careline Israel 2015 Huawei Smartphone: Huawei P9 Gucci Fragrance: Bamboo United States 2017 Erroca Sunglasses Israel Wix Israeli software and website United States [134] GTArcade Video game: League of Angels: Paradise Island China 2018 Revlon Cosmetics Worldwide Huawei Smartphone: Huawei P20 United States Reebok Sportswear Worldwide [135] Asus Electronics 2019–present Hot Telecommunications provider Israel [136][137] 2020 Smartwater Beverages United States [138]\n\nBeauty pageants [ edit ]\n\nYear Title Status Notes 2004 Miss Israel 2004 Herself Winner Miss Universe 2004 Miss Israel Participant\n\nAwards and nominations [ edit ]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\na b [16] though Hebrew-language articles state that she was born in Petah Tikva,[17] and several English-language sources further support this.[18] Some have claimed that she was born in Rosh HaAyin,[19][3] but Gadot said that she was only raised there.[20] Sources vary, though given the evidence, her birthplace is most likely Petah Tikva. Gadot has stated in an English-language interview that she was born in Tel Aviv though Hebrew-language articles state that she was born in Petah Tikva,and several English-language sources further support this.Some have claimed that she was born in Rosh HaAyin,but Gadot said that she was only raised there. a b [4][89] and others as \"Jaron\",[90] he personally uses \"Jaron\" on his social media accounts and in the production company the couple started.[91] While some sources have reported the spelling of her husband's name as \"Yaron\"and others as \"Jaron\",he personally uses \"Jaron\" on his social media accounts and in the production company the couple started.", "images": ["https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Flag_of_Ukraine.svg/15px-Flag_of_Ukraine.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5c/Flag_of_Greece.svg/15px-Flag_of_Greece.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/85/IDF_Ranks_Samal.svg/25px-IDF_Ranks_Samal.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Flag_of_Israel.svg/15px-Flag_of_Israel.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/a/a4/Flag_of_the_United_States.svg/15px-Flag_of_the_United_States.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/0/05/Flag_of_Brazil.svg/15px-Flag_of_Brazil.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Flag_of_the_Bahamas.svg/15px-Flag_of_the_Bahamas.svg.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Flag_of_the_Czech_Republic.svg/15px-Flag_of_the_Czech_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Flag_of_Australia_%28converted%29.svg/15px-Flag_of_Australia_%28converted%29.svg.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ab/Flag_of_Panama.svg/15px-Flag_of_Panama.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Flag_of_Malaysia.svg/15px-Flag_of_Malaysia.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Flag_of_the_Philippines.svg/15px-Flag_of_the_Philippines.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4c/Flag_of_Sweden.svg/15px-Flag_of_Sweden.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/9/9a/Flag_of_Spain.svg/15px-Flag_of_Spain.svg.png", "https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9f/Flag_of_the_Dominican_Republic.svg/15px-Flag_of_the_Dominican_Republic.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Norway.svg/15px-Flag_of_Norway.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg/1200px-Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/Flag_of_Mexico.svg/15px-Flag_of_Mexico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/7/79/Flag_of_Nigeria.svg/15px-Flag_of_Nigeria.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Flag_of_Canada_%28Pantone%29.svg/15px-Flag_of_Canada_%28Pantone%29.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/4/41/Flag_of_India.svg/15px-Flag_of_India.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/15px-Flag_of_Puerto_Rico.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/1/19/Flag_of_Ghana.svg/15px-Flag_of_Ghana.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Flag_of_the_People%27s_Republic_of_China.svg/15px-Flag_of_the_People%27s_Republic_of_China.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Gal_Gadot_2014_Comic_Con_%28cropped_v3%29.jpg/170px-Gal_Gadot_2014_Comic_Con_%28cropped_v3%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/Flag_of_Paraguay.svg/15px-Flag_of_Paraguay.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/2/21/Flag_of_Vietnam.svg/15px-Flag_of_Vietnam.svg.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg/220px-Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/b/ba/Flag_of_Germany.svg/15px-Flag_of_Germany.svg.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg/1200px-Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Gal_Gadot", "title": "Gal Gadot", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg/640px-Gal_Gadot_at_the_2018_Comic-Con_International_13_%28cropped%29.jpg", "width": 640, "height": 858}, "title": "Gal Gadot - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}