{"url": "https://web.archive.org/web/20180412075352/https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "text": "25. The Beguiled\n\nYear: 2017\n\nDirector: Sofia Coppola\n\nTalking about The Beguiled means talking about Sofia Coppola’s accidental racism. Google the film’s title and you’ll be dragged under an endless swirl of thinkpieces hinged upon the matter of Coppola’s decision to scrub her adaptation of Don Siegel’s 1971 Southern Gothic movie, itself an adaptation of Thomas P. Cullinan’s 1966 Southern Gothic novel, of its lone black character, with each piece yanking discussion of The Beguiled further and further away from The Beguiled itself. Citing what Coppola bypasses in her take on The Beguiled has the natural consequence of eliding what she includes, and if the absence of Hattie, Mae Mercer’s house slave in the Siegel original, is impossible to ignore, it’s equally impossible to ignore the subtext Coppola articulates through her absence. Here, she treats the all-girls boarding school where the story’s action takes place as a bubble of privilege: Her characters sit on the periphery of the Civil War, worrying out loud over the suffering war inflicts on its participants without considering the suffering that led to its outbreak, because of course a bunch of Southern whites would never question the morality of systemic racism as they sit comfortably in the lodge, watching smoke billow in the distance, the cost of a culture and economic order built on wholesale indifference to human dignity. Coppola’s primary “in” to The Beguiled is elegance, which should come as a surprise to no one familiar with the rest of her filmography (notably Marie Antoinette and The Bling Ring). Tastefulness is her jam; not a moment in the movie passes by sans flourishes of grace and decorum, buttressing corroborative details that reinforce its sense of time and place, as well as the bourgeois luxuries that are hallmarks of both. Maybe Coppola should have spared time herself for confronting the race politics of The Beguiled’s era directly. Maybe if she had, the film wouldn’t be as deftly streamlined as it is. The discussion of what the film isn’t is a discussion worth having, just not at the expense of what the film is: Delicious, sensual, made with sterling craft and an unassumingly sharp edge. —Andy Crump\n\n24. Harry Potter and the Prisoner of Azkaban\n\nYear: 2004\n\nDirector: Alfonso Cuaron\n\nUnlike predecessor Chamber of Secrets, third Potter entry Prisoner of Azkaban straddles a sublime balance between childhood revelry and encroaching doom as Harry (Daniel Radcliffe), Hermione (Emma Watson) and Ron (Rupert Grint) age into an ambivalent future—the same tonal tug-of-war which also defined Mexican director Alfonso Cuaron’s earlier efforts, including A Little Princess and Y Tu Mamá También. Cuaron insists on a brisker pace and, in many instances, a sheer goofiness that can’t be found anywhere else in the books or movies. The Potterverse reaches peak Dahl homage in the film’s opening scenes, when Harry warps his aunt Marge (Pam Ferris) into bloated balloon, mirroring the actions of another alliteration-named magician who happened to run a chocolate factory. Shrunken voodoo head bus navigators, a monster book of monsters and Professor Snape (Alan Rickman) in heels round out a feverish, lighthearted romp through the Wizarding World. And yet, this film’s greatness is in its demarcation: Azkaban firmly yanks the rug back as it progresses, painting a severe contrast between Harry’s past years and his future peril. The titular prisoner, Sirius Black (Gary Oldman), introduces a new moral ambiguity which exposes the HP epic as a metaphor for totalitarianism and racism. The books and movies’ magic never became more meta than when it asked its young wizards to funnel their happiness into the Patronus spell—a weapon against wraith-like spiritual parasites that miraculously passed a PG rating. Those scenes alone confirm Potter as an eternal pop culture emblem for hope in the face of seemingly hopeless futures. —Sean Edgar\n\n23. Going Clear: Scientology and the Prison of Belief\n\nYear: 2015\n\nDirector: Alex Gibney\n\nAlex Gibney’s up-close examination of Scientology, its practices and the controversies that surround the religion founded by science-fiction writer L. Ron Hubbard is also a stirring portrait of eight former adherents, who tell their stories of how they came to practice Scientology and their reasons for leaving the church. While much of the ideological content in Gibney’s film has circulated on the Internet for years, there was still a number of items to be learned from watching the film and hearing from the men who made it. While Going Clear is part exposé and part condemnation of a controversial religion, director Gibney has said that he was most interested in “the journey of the key characters in the film”—and how people got lost in the ‘prison of belief.’” —Christine N. Ziemba\n\n\n\n22. Paradise Lost: The Child Murders at Robin Hood Hills\n\nYear: 1996\n\nDirectors: Joe Berlinger, Bruce Sinofsky\n\nIf you’ve never heard of the West Memphis Three, do some research before you begin—you’ll want to be prepared. Within only a minute of the film’s opening, as Metallica’s “Welcome Home (Sanitarium)” noodles forebodingly over pixelated camcorder videos, intolerable images taken straight from police evidence glance across frame, so quickly and frankly you’ll immediately question if they are, in fact, real. Of course, they are—they are images no person should ever have to see, and yet Joe Berlinger and Bruce Sinofsky use them only to expose the unbelievable horror at the heart of the appropriately named Paradise Lost. What unfolds over the following two and a half hours is just as heartbreaking: a trio of teenage boys (one with an IQ of 72) is put on trial for the brutal murders of three prepubescent boys, the only evidence against them a seemingly forced confession by the young kid with the below-average IQ, and laughably circumstantial physical proof. The film explores the context of West Memphis, its blindly devoted Christian population and how the fact that these teenagers dressed in black and listened to Metallica somehow led to their predictable fates at the hands of a comprehensively broken justice system. With surprising access to everyone involved in the trial, as well as a deft eye for the subtle exigencies of any criminal case such as this, Paradise Lost is a thorough, infuriating glimpse of the kind of mundane evil that mounts in some of America’s quietest corners. Welcome home. —Dom Sinacola\n\n21. Fast & Furious\n\nYear: 2009\n\nDirector: Justin Lin\n\nThe second film in director Justin Lin’s glorious reign over the Fast and/or Furious franchise offers the initial glimpses of the logic-bending blockbuster spectacles to come. Functionally rebooting the world Dominic Toretto (Vin Diesel) seemed to have left behind, Lin’s follow-up to the also-great Tokyo Drift sets the groundwork for what would become the series’ defining theme. It’s all about family in this fourth installment, bringing on Gal Gadot’s Gisele and bringing back Paul Walker’s Brian to stack up what would become the formidable multicultural crew who’d eventually learn that absolutely nothing is impossible when they’re behind the wheel of a car. From its first set piece to its last, speeding through the desert catacombs underneath the Mexico-U.S. border, Fast & Furious is about as good as franchise filmmaking can get—continuing, rebooting, expanding and serializing all at once, with almost effortless aplomb, as a prelude to the true gonzo masterpiece two years later, Lin’s own Fast Five. —Dom Sinacola\n\n20. Predator\n\nYear: 1987\n\nDirector: John McTiernan\n\nFor all of the jokes and terrible impersonations made over the decades at the expense of Arnold Alois Schwarzenegger, during his peak throughout the ’80s, the actor possessed a certain joie de vivre unmatched by any action performer in Hollywood (with the possible exception of Bruce Willis). Schwarzenegger’s impish charm contrasts beautifully with his larger-than-life, muscle-bound physique, a dynamic he’s always happy to entertain. But Predator is one of the films of his heyday that dared to conjure a threat that even the specter of Schwarzenegger might not be able to conquer, a space-traveling alien trophy hunter who assembles a grisly collection of skulls and spinal columns throughout. It’s a basic premise that was utterly run into the ground by copycat B movies in the years to follow, but none of them come close to replicating the hyper-macho camaraderie that makes Predator an enduringly entertaining relic of its time. The sophomoric banter between the likes of Jesse Ventura, Carl Weathers and Shane Black is what sets the film apart, infusing it with a somehow endearing gentleman’s club mentality, fully aware of its inherent stupidity. We want to see this merry band of special forces operatives conquer the faceless chameleon set against them. There’s wry satire here about America’s attitude toward meddling in the affairs of less-developed nation states, but more than anything, Predator is simply one of the ’80s ’ best games of cat and mouse. —Jim Vorel\n\n19. Girls Trip\n\nYear: 2017\n\nDirector: Malcolm D. Lee\n\nWhile it’s great to experience movies that are powerful and groundbreaking and devastating—we all love to weep at the theater or in our homes, wiping away tears as the credits roll on movies like Call Me By Your Name—but some of the best movies can be both well-written and unapologetically fun. And I’m not sure anybody had more fun this year than those of us who experienced Girls Trip. You go in likely expecting a solid, heartwarming tale about a group of friends who reconnect on a trip to New Orleans, but you leave wondering how you’d gone your whole life without experiencing this sort of black, female-centered version of The Hangover. It’s not just that Girls Trip, is so reminiscent of those raunchy, absurd (and kind of disgusting) comedies, it’s that the shocking, laugh-out-loud moments are so earned and so excellently delivered that it’s easy to forget there’s some kind of message wrapped up in it all. That’s a good thing, because it makes those final confrontations and confessions at the end of the film all the more compelling. Of course, what really made this movie one of the most beautiful and hilarious movies of the year was its cast, featuring performances from an incredible group of women with the kind of chemistry you dream of seeing on screen: Regina Hall, Tiffany Haddish, Jada Pinkett Smith and Queen Latifah all turned in phenomenal work. Haddish has been (rightfully) celebrated as the breakout star, but her comedic prowess could have been lost on a lesser script. Luckily, writers Tracy Oliver, Kenya Barris and Erica Rivinoja laid an impeccable foundation for director Malcolm D. Lee, and the result was one of the biggest blasts—among any genre—of the year. —Shannon M. Houston\n\n18. Bessie\n\nYear: 2015\n\nDirector: Dee Rees\n\nIt may have taken 20 years to make it, but when Bessie finally arrived, she came, she saw and she conquered. The HBO film has garnered 12 well-deserved Emmy nominations, with Queen Latifah, co-stars Michael Kenneth Williams and Mo’Nique, and director Dee Rees all getting the nod. One scene in particular—with the reverse paper bag test—is one of Bessie’s finest moments, as it encompasses all that makes the HBO film so wonderful. There’s Queen Latifah in all her glory, finally setting up her own tour and making sure everyone knows who’s boss. There’s the hilarity when she lets down one of the hopefuls auditioning—“You must be darker than the bag to be in my show!” After all, Bessie is an incredibly funny movie at times. And there’s the whole inversion of the brown paper bag test. Where Bessie Smith grew up in a world that demanded black women performing back-up be lighter than a brown paper bag, Bessie makes up a new rule that gives her back some agency and sets a different tone (literally and figuratively) for her showcase. Bessie was, in no way, your average blues performer and for that reason Lili Fini Zanuck and her husband Richard D. Zanuck knew they couldn’t just deliver your average black-performer-who-grew-up-poor-and-made-it-big biopic. The familiar story of a talented woman done in by a man (or many men), or childhood tragedies, or her own celebrity was not Bessie’s story—she wasn’t lighter than a brown paper bag, and, thankfully, wasn’t presented as such. —Shannon M. Houston\n\n\n\n17. The French Connection\n\nYear: 1971\n\nDirector: William Friedken\n\nWinner of Academy Awards for Best Picture, Director, Screenplay, Editing and Acting (Gene Hackman), The French Connection isn’t so much a deeply felt drama or meticulous procedural as it is a nearly perfectly executed exercise in inertia, mood and the obsession with both. Friedken’s film is all aesthetic, all carapace: this is New York at its grossest, and Hackman (as the gruff Popeye Doyle) at his most vicious. As the only character with any hint of depth, Doyle is the audience’s vessel from one chase to another—or, rather: throughout the giant chase that is the whole movie—a man as relentless as the filth and violence of the City that he struggles to defend, one drug bust at a time. In that sense, The French Connection is a defining film of the ’70s, unyielding in its depiction of an America hungover from the facile free love movement, still mired in the Vietnam War and the depravity of unmitigated urban expansion. But even moreso, the film is a lean action classic, all movement and no second wasted. —Dom Sinacola\n\n\n\n16. Logan\n\nYear: 2017\n\nDirector: James Mangold\n\nThe first word in Logan is “fuck”—perhaps you’re thinking that sounds somehow in the same tonal wheelhouse as, say, Deadpool, but in reality that couldn’t be further from the truth. What Logan is defies easy categorization. I struggle to even call it a “superhero movie,” or an “X-Men movie.” If it is one, then it’s quite easily the most uniquely disparate X-Men movie ever made, asking audiences to quickly cast away any expectations of how an X-Men movie might look, sound and feel. Yes, one might call it a “superhero movie” in the sense that it, you know, has superheroes in it, but it would be similar to describing Saving Private Ryan as “that movie where Tom Hanks plays an English teacher.” In short, this is quite the departure for Marvel’s first family of mutants and it’s difficult even now to comprehend how a mass audience processed Logan. Were they be wowed by its ultra-gory, visceral action and supremely gritty, nihilistic vision of a future where entropy has seemingly conquered all? Or were they be unnerved by its often oppressive dourness, humorless nature and patience in lingering in the quiet moments? The differences between this film and the tone of The Avengers could scarcely be more profound. Ultimately, Logan’s ambition is to present itself with a weight of gravitas that isn’t entirely earned, considering the history of the character. It will doubtlessly frustrate some of the Everyman cinema-goers who perceive its middle chapters as slow, or who criticize the 135-minute run-time, but I expect patient viewers will appreciate the way it allows its characters to breathe and wallow in moments of vulnerability. It’s not a film calculated to be a people-pleaser, but it is an appropriately intense end to a character defined by the tenacity and ferocity of a wolverine. —Jim Vorel\n\n15. The Omen\n\nYear: 1976\n\nDirector: Richard Donner\n\nIn the canon of “creepy kid” movies, the original 1976 incarnation of The Omen stands alone, untainted by the horrendous 2006 remake. It has a palpable sense of malice to it, largely because of the juxtaposition of restraint and moments of extremity. Damien (Harvey Spencer Stephens) isn’t this little devil boy running around stabbing people, he’s full of guile, deceit and, scariest of all, patience. He knows that he’s playing the long game—it will be years and years before he achieves his purpose on the Earth, which gives him the uncomfortable attitude of an adult (and a pure evil one) in a child’s body. The film is brooding, sullen, broken up by staccato moments of shocking violence. In particular are the infamous scene wherein a sheet of glass leads to a decapitation, or the fate of Damien’s nurse in the film’s opening. The Omen can genuinely can get under your skin, especially if you’re a parent. —Jim Vorel\n\n14. Three Kings\n\nYear: 1999\n\nDirector: David O. Russell\n\nThree Kings is a war movie which, as it moves ever less-casually along, attempts to figure out what a war movie even is anymore. Set at the butt-end of the Gulf War, the film begins as an odd bacchanalia of boredom, contorting through a handful of genres and Desert Storm misadventures to arrive, inevitably, at the conclusion that, Oh, Yeah, Actually Turns Out War Isn’t Boring Ever. Director David O. Russell has his faults—and even a cursory reading into this movie will give you plenty of anecdotes about how much of a heel he is—but he’s not too naïve to claim he can sum up that conflict and the U.S.’s role by portraying its participants as hedonists and potential career criminals, partying and plundering their way through a passive desert land with nothing better to do. So, as four soldiers (George Clooney, Mark Wahlberg, Spike Jonze and Ice Cube) embark on a Kuwaiti gold heist based on information found within an ass map, Russell explores what the responsibilities of these men could be when their only responsibilities—occupying, defending and killing—are no longer all that urgent. Camaraderie, brotherhood, moral fortitude: all of it gone from Russell’s wonky post-war flick, replaced with a refreshing sense of surprise all but extinct from most movies dealing with the same moral gray of modern warfare. —Dom Sinacola\n\n\n\n13. Midnight Cowboy\n\nDate: 1969\n\nDirector: John Schlesinger\n\nIn this film by British director John Schlesinger, Jon Voight plays a Texan with a troubled past who comes to the big city trying to make a career as a gigolo. Enter his pal, Ratso Rizzo, played by the great and grating Dustin Hoffman. Midnight Cowboy was rated X upon release for homosexual content that would hardly raise an eyebrow today, and remains the only film of that category to ever win an Oscar, much less the Best Picture award it captured in 1970. (The only other X-rated film to be nominated was Kubrick’s A Clockwork Orange.) Second on the list of the decade’s greatest actors is Dustin Hoffman. Along with Midnight Cowboy, he starred in the seminal The Graduate, the western epic Little Big Man, Sam Peckinpah’s terrifying classic Straw Dogs, the controversial Lenny (a hopeless Best Picture nominee in the 1974 class with The Conversation and The Godfather, Part II), All the President’s Men, Marathon Man and Kramer vs. Kramer. But his incredible turn as Ratso Rizzo is still the greatest performance of his career, and the chemistry between him and his physical opposite is one of the best and most unusual friend dynamics in film history, hilarious and ultimately heartbreaking. —Shane Ryan\n\n12. The Terminator\n\nYear: 1984\n\nDirector: James Cameron\n\nJames Cameron’s first Terminator (and second feature) is less of a pure-popcorn action flick than its upscaled sequel, but that makes it all the more terrifying of a movie—dark, somber, replete with a silent villain who calmly plucks bits of his damaged face off to more precisely target its victims. The task in front of Kyle Reese (Michael Biehn) and Sarah Connor (Linda Hamilton) seems so insurmountable—even with a soldier from the future, going after the T-800 (Arnold Schwarzenegger, duh) with modern weapons is so ineffectual, it’s nearly comical. It’s as if Schwarzenegger is playing entropy itself—entropy seemingly a theme of The Terminator series, given the time-hopping do-overs, reboots and retreads since. You can destroy a terminator, but the future (apparently driven by box office receipts) refuses to be changed. —Jim Vorel\n\n\n\n11. John Wick: Chapter 2\n\nDirector: Chad Stahelski\n\nPerhaps the greatest compliment you can pay to both John Wick movies is via comparison to a contemporary: John Wick films are to guns what The Raid films are to fists. Within their respective spheres of combat, each is on an entirely separate level in terms of presentation. Both aspire to something more vital than to “entertain.” They don’t want to “satisfy” an audience—they want to make your jaw drop. They want you to stifle a guffaw as John Wick (Keanu Reeves) pulls off a move that is simultaneously so slickly unrealistic and bone-crunchingly visceral that the cognitive dissonance causes a brief misfire in your synapses. They’re everything that G.I. Joe or Fast & The Furious never bothers even attempting to be. So yes, both cinephiles and action movie buffs will be pleased to know that John Wick: Chapter 2 is a worthy follow-up to the surprising 2014 original. Holding the torch passed from ’80s and ’90s John Woo classics, director Chad Stahelski delivers an epic ballet of arm-breaking and gun-kata that somehow manages to run for 122 minutes without ever overstaying its welcome. That’s far easier said than done. —Jim Vorel\n\n10. Die Hard\n\nYear: 1988\n\nDirector: John McTiernan\n\nDie Hard may be the “stickiest” film of its decade—how many best-laid plans have been derailed by running across John McTiernan’s masterful actioner on cable? As Officer John McClane and Hans Gruber, Bruce Willis and Alan Rickman, respectively, steal the show in career-defining roles, but even Henchman #10 (Asian man who eats candy bar, or Uli, to his friends) comes across more realized than most lead roles in today’s run-of-the-mill action flicks. Tightly plotted with cleverness to spare, Die Hard welcomes the scrutiny of multiple viewings without losing its humor or heart. Yippie ki-yay, indeed. —Michael Burgin\n\n9. When the Levees Broke: A Requiem in Four Acts\n\nDirector: Spike Lee\n\nYear: 2006\n\nPart indictment of FEMA and the U.S. Army Corps of Engineers, part celebration of the unfailingly resilient spirit of New Orleans, Spike Lee’s four-hour-long look at “The City That Care Forgot” a year after the near-obliteration of Hurricane Katrina is an exhausting, comprehensive, worthwhile experience. There’s a reason so many residents refer to the catastrophe as the “Federal flood” and not Katrina itself—Lee’s Peabody-winning doc examines the systemic failure at all levels of government to maintain the storm barriers and deal with the consequences of their negligence. It’s political, it’s racial, it’s accusatory and it’s utterly compelling viewing. It’s also inspiring, thanks to the resolute locals shown struggling to survive and rebuild in the disaster’s aftermath. This is very much a Spike Lee joint; don’t expect anyone in the Dubya administration to come away without a tongue-lashing. But the heart and soul of the doc is the people of New Orleans, and they won’t let you down—on the contrary. —Amanda Schurr\n\n8. The Silence of the Lambs\n\nYear: 1991\n\nDirector: Jonathan Demme\n\nThe camera hugs her face, maybe trying to protect her, though she needs no protection, and maybe just trying to see into her, to see what she sees, to understand why seeing what she sees is so important. Not even 30, Jodie Foster looks so much younger, surrounded in The Silence of the Lambs by men who tower over her, staring at her, flummoxed by her, perhaps wanting to protect her too, but more likely, more ironically, intimidated by a world that would allow such a fragile creature agency, that would let her freely wander the domain of monsters. As Clarice Starling, FBI agent-in-training, Foster holds her performance in suspension, an innocent who’s seen more than any of us could ever imagine, and a warrior who seems unsure of her prowess. That Jonathan Demme—a director who came up under the tutelage of Roger Corman; a journeyman capable of helming the greatest concert film ever made (Stop Making Sense) as adroitly as a screwball thriller/rom-com (Something Wild), adopting then immediately shedding genres at whim—corners Starling within the confines of a “Woman in Peril,” only to watch her shrug off every label thrown at her, is a testament to The Silence of the Lambs as a feminist masterpiece, not because it so thoroughly inhabits a female point of view, but because its violence and fear is clearly the stuff of masculine toxicity. Demme’s film is only the second to adapt Thomas Harris’s Hannibal Lector novels to the screen (the first being Michael Mann’s hyper-stylized Manhunter, a brutal dream unto itself), but it’s the first to draw undeniable lines between the way men see Clarice Starling and the way that serial killer Buffalo Bill (Ted Levine) projects his neuroses onto his victims.\n\nHarris obviously has a fascination with the idea of “seeing” and how that manifests maliciously in those whose self-perception is already mangled by traumatic experiences, but Demme’s film is the only iteration of Harris’s stories which links seeing to transformation to one’s need to consume, all pursued through a gendered lens, represented by the seemingly omniscient perspective of Hannibal Lector (Anthony Hopkins), a borderline asexual cannibal who literally consumes those over whom he holds court. Buffalo Bill is a monster, and so is Lector, but the difference is that Lector does not attempt to possess Clarice Starling, though he sees her, because he is past transformation, is in control of that which he consumes. Buffalo Bill isn’t, because as a man he believes that by consuming femininity he can become it, too stupid and too self-absorbed to realize that to consume it is to delete that femininity—to admit that the world is a dangerous, predatory place, and that to protect a woman is only a matter of admitting that the World of Men is a weak and evil failure of the very ideals it strives to preserve. —Dom Sinacola\n\n7. E.T. the Extra-Terrestrial\n\nYear: 1982\n\nDirector: Steven Spielberg\n\nOne vital component of Spielberg’s work is his career-wide collaboration with composer John Williams, and nowhere is Williams’ talent in extracting emotional pathos out of his rousing scores more obvious than in his spectacular compositions for E.T. , an iconic, influential childhood classic. Spielberg turning the fantastical premise of an alien stranded on earth into an allegory for a child’s need to be loved and appreciated becomes perhaps the most concrete representation of the director’s unique talent for seeking out accessibility and universality in his emotional stakes while also never losing sight of the eye-candy-heavy imagination he inspires. —Oktay Ege Kozak\n\n\n\n6. Aliens\n\nYear: 1986\n\nDirector: James Cameron\n\nJames Cameron colonizes ideas: Every beautiful, breathtaking spectacle he assembles works as a pointillist representation of the genres he inhabits—sci-fi, horror, adventure, thriller—its many wonderful pieces and details of worldbuilding swarming, combining to grow exponentially, to inevitably overshadow the lack at its heart, the doubt that maybe all of this great movie-making is hiding a dearth of substance at the core of the stories Cameron tells. An early example of this pilgrim’s privilege is Cameron’s sequel to Ridley Scott’s roughly-feminist horror masterpiece, in which Cameron mostly jettisons Scott’s figurative (and uncomfortably intimate) interrogation of masculine violence to transmute that urge into the bureaucracy and corporatism which only served as a shadow of authoritarianism—and therefore a spectre of the male imperative—in the first film. Cameron blows out Scott’s world, but also neuters it, never quite connecting the lines from the aggression of the Weyland-Yutani Corporation to the maleness of the military industrial complex, but never condoning that maleness, or that complex, either. Ripley’s (Sigourney Weaver) story about what happened on the Nostromo in the first film is doubted because she’s a woman, sure, but mostly because the story spells disaster for the corporation’s nefarious plans. Private Vasquez’s (Jennette Goldstein) place in the Colonial Marine unit sent to LV-426 to investigate the wiping out of a human colony is taunted, but never outright doubted, her strength compared to her peers pretty obvious from the start. Instead, in transforming Ripley into a full-on action hero/mother figure—whose final boss battle involves protecting her ersatz daughter from the horror of another mother figure—Cameron isn’t messing with themes of violation or the role of women in an economic hierarchy, he’s placing women by default at the forefront of mankind’s future war either for or against the ineffable forces of capitalism. It’s magnificent blockbuster filmmaking, and one of the first films to redefine what a franchise can be within the confines of a new director’s voice and vision, but below all of the wonderful genre-based imagination and splendor, Cameron doesn’t have much of anything to say. Still, it’s an awesome film despite itself, a tense action bonanza, and a pretty good reminder all these years and proposed Avatar sequels later that Cameron’s clearly decided on which side of the war he’s fighting. —Dom Sinacola\n\n5. Back to the Future, Part I, Part II and Part III\n\nYears: 1985; 1989; 1990\n\nDirector: Robert Zemeckis\n\nThe three-part epic journey of Marty McFly (Michael J. Fox) and his legitimately insane mentor Doc Brown (Christopher Lloyd) not only provides the crucible through which practically every comedy adventure made since must pass, it proves that even one insignificant kid’s actions make a universe of difference. There is little to add to a popular discussion of these films besides pointing out their diminishing returns with each successive entry, but that hardly takes away from the brilliance of Zemeckis’s storytelling. No plot point is wasted, no shot infused with anything less than humor and emotional breadth—if this sounds a bit schmaltzy, or a bit overboard with praise, then stop to consider how cherished these films are in the course of American cinema. As they mess with history, so too do they make history, and from that standpoint, it’s hard to imagine anyone feeling the need to go back to make this trilogy any better. —Michael Burgin\n\n4. Alien\n\nYear: 1979\n\nDirector: Ridley Scott\n\nConduits, canals and cloaca—Ridley Scott’s ode to claustrophobia leaves little room to breathe, cramming its blue collar archetypes through spaces much too small to sustain any sort of sanity, and much too unforgiving to survive. That Alien can also make Space—capital “S”—in its vastness feel as suffocating as a coffin is a testament to Scott’s control as a director (arguably absent from much of his work to follow, including his insistence on ballooning the mythos of this first near-perfect film), as well as to the purity of horror as a cinematic genre. Alien, after all, is tension as narrative, violation as a matter of fact: When the crew of the mining spaceship Nostromo is prematurely awakened from cryogenic sleep to attend to a distress call from a seemingly lifeless planetoid, there is no doubt the small cadre of working class grunts and their posh Science Officer Ash (Ian Holm) will discover nothing but mounting, otherworldly doom. Things obviously, iconically, go wrong from there, and as the crew understands both what they’ve brought onto their ship and what their fellow crew members are made of—in one case, literally—a hero emerges from the catastrophe: Ellen Ripley (Sigourney Weaver), the Platonic ideal of the Final Girl who must battle a viscous, phallic grotesque (care of the master of the phallically grotesque, H.R. Giger) and a fellow crew member who’s basically a walking vessel for an upsetting amount of seminal fluid. As Ripley crawls through the ship’s steel organs, between dreams—the film begins with the crew wakening, and ends with a return to sleep—Alien evolves into a psychosexual nightmare, an indictment of the inherently masculine act of colonization and a symbolic treatise on the trauma of assault. In Space, no one can hear you scream—because no one is listening. —Dom Sinacola\n\n3. The Exorcist\n\nYear: 1973\n\nDirector: William Friedkin\n\nIs any film more disturbing, more influential or just plain scarier than The Exorcist? The film radiates an aura of dread—it feels somehow unclean and tilted, even before all of the possession scenes begin. Segments like the “demon face” flash on the screen for an eighth of a second, disorienting the viewer and giving you a sense that you can never, ever let your guard down—worming its way under your skin and then staying there forever. The film constantly wears down any sense of hope that both the audience and the characters might have, making you feel as if there’s no way that this priest (Jason Miller), not particularly strong in his own faith, is going to be able to save the possessed little girl (Linda Blair). Even his eventual “victory” is a very hollow thing, as later explored by author William Peter Blatty in The Exorcist III. Watching it is an ordeal, even after having seen it multiple times before. The Exorcist is a great film, no matter the genre. —Jim Vorel\n\n2. The Royal Tenenbaums\n\nYear: 2001\n\nDirector: Wes Anderson\n\nWith his third movie, Wes Anderson let all his quirks run rampant: a storybook setting that is and is not New York, a uniform for each character and an obsession with childhood detritus. Rather than deflect the family’s conflicts (as Anderson’s critics claim), these elements only enhance its spiritual conundrums, making The Royal Tenenbaums Anderson’s most directorially confident and emotionally cathartic film—a bittersweet ode to regret, forgiveness and hard-won contentment.—Stephen Deusner\n\n\n\n1. Get Out\n\nYear: 2017\n\nDirector: Jordan Peele\n\nPeele’s a natural behind the camera, but Get Out benefits most from its deceptively trim premise, a simplicity which belies rich thematic depth. Chris (Daniel Kaluuya) and Rose (Allison Williams) go to spend a weekend with her folks in their lavish upstate New York mansion, where they’re throwing the annual Armitage bash with all their friends in attendance. Chris immediately feels out of place; events escalate from there, taking the narrative in a ghastly direction that ultimately ties back to the unsettling sensation of being the “other” in a room full of people who aren’t like you—and never let you forget it. Put indelicately, Get Out is about being black and surrounded by whites who squeeze your biceps without asking, who fetishize you to your face, who analyze your blackness as if it’s a fashion trend. At best Chris’s ordeal is bizarre and dizzying, the kind of thing he might bitterly chuckle about in retrospect. At worst it’s a setup for such macabre developments as are found in the domain of horror. That’s the finest of lines Peele and Get Out walk without stumbling. —Andy Crump", "images": ["https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/harry-potter-azkaban-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/fast-furious-4-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/blogs/lists/2015/06/11/french-connection.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/back-future-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/2016/01/08/bessie.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/aliens-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/2017/12/06/beguiled.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/logan-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/die-hard-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/get-out-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/midnight-cowboy-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/girls-trip-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/e-t-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/2016/01/08/when-the-levees.jpg", "https://web.archive.org/web/20180412075352im_/https://www.pastemagazine.com/pastemagazine.img/master-header-logo.png", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/exorcist-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/girls-trip-hbo-633x356.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/predator-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/omen-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/2015/08/28/terminator.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/alien-1979-movie-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/Silence-Lambs-Criterion.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/paradise-lost-poster.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/2016/01/08/going-clear.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/blogs/lists/2013/04/01/three-kings.jpg", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/blogs/lists/2009/11/05/tennenbaums.jpg", "https://web.archive.org/web/20180412075352im_/https://www.pastemagazine.com/pastemagazine.img/master-header-logo-white.png", "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/john-wick-2-poster.jpg"], "top_img": "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/girls-trip-hbo-633x356.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20180412075352/https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html?p=2", "title": "The 50 Best Movies on HBO Go and HBO Now (April 2018)", "meta_data": {"title": "The 50 Best Movies on HBO Go and HBO Now (April 2018) - Paste Magazine", "description": "Here are the best movies HBO has to offer this month.", "keywords": "back to the future, get out, harry potter, hbo, hbo go, hbo now, alien, aliens, predator, tremors, what to watch, the silence of the lambs, girls trip, The 50 Best Movies on HBO Go and HBO Now (April 2018), Movies, Articles, Paste", "news_keywords": "back to the future, get out, harry potter, hbo, hbo go, hbo now, alien, aliens, predator, tremors, what to watch, the silence of the lambs, girls trip", "fb": {"admins": 1185614656, "app_id": 127550380613969, "pages": 18512903240}, "apple-mobile-web-app-title": "Paste Magazine", "og": {"image": {"identifier": "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/girls-trip-hbo-633x356.jpg", "width": 633, "height": 356}, "type": "article", "url": "https://web.archive.org/web/20180412075352/https://www.pastemagazine.com/articles/2018/01/the-50-best-movies-on-hbo-go-and-hbo-now-january-2.html", "title": "The 50 Best Movies on HBO Go and HBO Now (April 2018)", "site_name": "pastemagazine.com", "description": "Here are the best movies HBO has to offer this month."}, "twitter": {"card": "summary_large_image", "site": "@pastemagazine", "title": "The 50 Best Movies on HBO Go and HBO Now (April 2018)", "description": "Here are the best movies HBO has to offer this month.", "image": "https://web.archive.org/web/20180412075352im_/https://cdn.pastemagazine.com/www/articles/girls-trip-hbo-633x356.jpg"}, "p": {"domain_verify": "8f36922bc91ba221f10d82c407d8b6a9"}, "viewport": "width=device-width"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}