{"url": "https://www.grammy.com/grammys/news/shakira-wins-best-latin-pop-album-2018-grammys", "text": "It is not a coincidence that the 24th annual edition of the Latin GRAMMYs took place in Sevilla, Spain — far away from the traditional epicenters of Latin music production. More than ever before, the sound of the Latin GRAMMYs are truly international, embraced by fans all over the world. At a time of unprecedented global turmoil and collective anxiety, the songs of Bad Bunny, Shakira, Peso Pluma and Rosalía — to name a few of many reigning stars — have enough zest, honesty and passion in them to provide comfort. Both Spain and Latin America boast a long standing tradition of healing through rhythm and melody. Not surprisingly, this year's ceremony felt like a casual gathering of friends for an evening of dancing and celebrating. From the strains of flamenco to the boom of Mexican music and the ongoing permutations of reggaetón, these are the takeaway points from the unforgettable 2023 Latin GRAMMYs. The Genius Of Rosalía Transcends Her Own Songbook\n\nIt was only fitting that Rosalía — one of the most visionary singer/songwriters in global pop — should open up the first Latin GRAMMY ceremony in Spanish territory. She could have certainly taken advantage of the opportunity to drop a new single or perform one of her many hits. Instead, Rosalía sang an achingly beautiful version of the 1985 classic \"Se Nos Rompió El Amor\" by the late singer Rocío Jurado. It was a lovely way to deflect the spotlight and focus on celebrating her Spanish roots. Spain And Latin America Make Beautiful Music Together\n\nFrom beginning to end, the telecast underscored the organic kinship that unites the music of Spain and Latin America. It took place during the International Day of Flamenco, and the transcendent genre was present in Alejandro Sanz's moving performance of \"Corazón Partío.\" The award for Best Flamenco Album, won by Niña Pastori for Camino, was presented during the main ceremony — a GRAMMY first. Later in the telecast, Spanish pop singer Manuel Carrasco and Colombian artist Camilo performed an acoustic duet of \"Salitre.\" They were soon joined by Brazilian singer IZA Texas-born producer/songwriter Edgar Barrera, transforming the Sevilla stage with Carnivalesque energy. Hell Hath No Fury Like A Pop Star Scorned\n\nSince its release in January, “Shakira: Bzrp Music Sessions, Vol. 53,” the collaboration between Shakira and Argentine producer Bizarrap, has become a global cultural phenomenon. Not only is it a grand pop song with slick EDM accents, but the Colombian diva's lyrics struck a chord with its message of empowerment and fortitude in the face of adversity. The duo's brisk performance — preceded by a brief intro with Shaki showcasing her tango dancing skills — was an iconic pop culture moment. The track itself won awards in the Best Pop Song and Song Of The Year categories. Emerging Talent Is The Lifeline That Keeps Latin Music Alive\n\nWatching young artists performing together with the legends that inspired them is a Latin GRAMMY staple. This year was particularly poignant, as Colombian singer/songwriter Juanes performed a moving rendition of the atmospheric rocker \"Gris\" — about overcoming a relationship crisis — with majestic background vocals provided by six of the 10 Best New Artist nominees: Borja, Natascha Falcão, GALE, Paola Guanche, León Leiden and Joaquina — who ended up winning the award. For Mexico, The Time Is Now\n\nThe moment was ripe for the richness and depth of música Mexicana to shine on an international scale. 2023 was the year when the entire world fell in love with the strains of banda, norteño and corridos tumbados. The infectious collaboration between Peso Pluma and Eslabón Armado, \"Ella Baila Sola\" became the emblem of this revolución mexicana. A buoyant rendition of the track was a telecast highlight, as well as the performance by Carín León, who won the award for Best Norteño Album. Laura Pausini's Artistry Evokes The Elegance Of Decades Past\n\nIntroducing herself as \"the most [expletive] Latina Italian woman in the world,\" Laura Pausini seemed overjoyed with her Person Of The Year award. Her medley of career highlights — full of drama and gorgeous melodies — included nods to her first mega-hit, the nostalgic \"La Solitudine,\" and the cinematic \"Víveme.\" \"I thank my father because he chose not to go to the movies with my mom, and instead stayed at home, made love to her and had me, the Person Of The Year,\" Pausini quipped. Her songbook evokes the golden era of Latin pop, a time of elegance and style. Radical Genre Bending Never Fails To Intrigue\n\nLatin music is currently experiencing a moment of grace, and this creative apex is frequently expressed through intriguing fusions of seemingly disparate styles. The adrenaline-fueled performance by Puerto Rican neo-reggaetón star Rauw Alejandro gained in electricity when he was joined by Juanes on a rocked-up rendition of \"BABY HELLO.\" Elsewhere, Carín León's duet with Maluma and Bizarrap's foray into electro-tango were fueled by a similar spirit of playful experimentation. Exquisite Singing & Songwriting Will Never Go Out Of Style\n\nThere's something to be said about an album that was recorded live on tape with analog equipment — the singer surrounded by her band, as they perform together in the same space, with no outside guests allowed. Natalia Lafourcade's \"De Todas Las Flores\" is all about feeling and warmth, her vulnerable vocals framed by delicate piano notes and supple percussion. A worthy Record Of The Year winner, this exquisitely layered track proposes that some traditional methods of music making are definitely worth preserving. At the Premiere Ceremony, Lafourcade also took home golden gramophones for Best Singer-Songwriter Song and Best Singer-Songwriter Album. Hip-Hop Is A Natural Component Of The Latin Music DNA\n\nAt the tail end of the ceremony, the performance by Colombian vocalist Feid — aided by the stellar skills of producer DJ Premier — included a moody reading of \"Le Pido a DIOS\" with nods to '90s rap and jazzy keyboard flourishes. Just like EDM, hip-hop has been fully incorporated into the Latin music lexicon, assuming an identity of its own. KAROL G Is Much, Much More Than Just A Global Pop Star", "images": ["https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://naras.a.bigcontent.io/v1/static/search", "https://i8.amplience.net/i/naras/Shakira-Bizarrap-2023-Latin-GRAMMYS-GettyImages-1797543834.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://i8.amplience.net/i/naras/shakira_acrostico_performance_2023_latin_grammys_W1_8766_FqMXblyh.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/shakira_bizarrap_win_latin_grammys_2023_song_of_the_year_R3V_9016_ZL7iEbnX.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Leon Leiden-Natascha Falcao and Paola Guanche-1797456327-2.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "https://www.facebook.com/tr?id=338622743242551&ev=PageView&noscript=1", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://cdn.media.amplience.net/i/naras/2024-grammys-66G_CBS_Tune_In_Logo_2045x793.webp?w=175", "https://naras.a.bigcontent.io/v1/static/connected", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v3_KeyArt_1644x925", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v1_KeyArt_1644x925"], "top_img": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "title": "Shakira Wins Best Latin Pop Album", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/shakira-wins-best-latin-pop-album-2018-grammys", "title": "Shakira Wins Best Latin Pop Album | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/show_categoryarticles_bestlatinpopalbum.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 33}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}