{"url": "https://www.nydailynews.com/entertainment/movies/ny-ent-catherine-zeta-jones-not-humble-20180615-story.html", "text": "Catherine Zeta-Jones is over being humble about her enviable life.\n\n“One thing I’m not is humble anymore,” Zeta-Jones said in a wide-ranging interview with the Mirror UK. “I’m sick of being humble. I really am. So sorry I’m rich, so sorry I’m married to a movie star, so sorry I’m not so bad looking.”\n\nZeta-Jones, 48, has been married to fellow actor Michael Douglas, 71, since 2000. They have two children together — 17-year-old Dylan, who recently celebrated his high school graduation in New York, and Carys, 15.\n\n“No sorries,” she continued. “Enough. All that is important to me now is my work.”\n\nThe Welsh Oscar-winner opened up about her upbringing as the daughter of a seamstress and factory worker, crediting her upbringing for her drive.\n\n“I come from a working-class family in Wales and I worked to get to where I am,” Zeta-Jones said. “And for many years all of us are victims of the fact that we’ve all got so humble.”\n\nZeta-Jones, 48, has been married to fellow actor Michael Douglas, 71, since 2000.\n\nHer career began when she was 9 years old, starring in a touring production of “Annie.” From there, she went on to land a recurring role in a British TV series, “The Darling Buds of May,” at 22 – which launched her into “The Mask of Zorro,” “Entrapment” and, eventually, “Chicago,” for which she won her Best Supporting Actress Oscar.\n\nBut Zeta-Jones admitted that somewhere among the characters she played, her passion for acting wavered.\n\n“What shaped me as an actor, more than anything, is getting older,” she said. “I genuinely lost my mojo. I didn’t like it very much anymore. I was on a successful path, there wasn’t any crisis or anything. Somewhere along the middle I got frightened again and I started to ­question myself as an actor, my choices.”\n\n“As I matured as a woman, as a mother, as a wife, I’m not scared anymore.”\n\nZeta-Jones recently starred in the TV movie “Cocaine Godmother: The Griselda Blanco Story,” a Lifetime feature based on the true story of a Colombian drug lord. She was also showcased alongside Susan Sarandon as Olivia de Havilland in “Feud,” the Emmy Award-winning FX docudrama about the legendary rivalry between Joan Crawford and Bette Davis.\n\nHer next project is portraying a renowned but ruthless pageant coach in a dark comedy set in Tulsa, Okla. The series –set to debut next year — will run on Facebook’s new video platform, Facebook Watch.\n\n“She’s a great character and I couldn’t let this one go,” Zeta-Jones said of the role. “I’ve got to get my Tulsa, Oklahoma, accent going. I love doing accents. There’s not many Welsh roles around, as you can imagine.”", "images": ["https://www.nydailynews.com/wp-content/uploads/2023/08/New_York_Daily_News_nydredblack-1.svg", "https://www.nydailynews.com/wp-content/uploads/migration/2018/06/15/6LAXQMCQN5EMFNAE2GXSQ43Q7A.jpg?w=1024&h=670", "https://secure.gravatar.com/avatar/?s=85&d=mm&r=g", "https://www.nydailynews.com/wp-content/uploads/2023/08/NYDN-LOGO-WHITE-J.jpg"], "top_img": "https://www.nydailynews.com/wp-content/uploads/migration/2018/06/15/6LAXQMCQN5EMFNAE2GXSQ43Q7A.jpg?w=1024&h=670", "keywords": [], "authors": ["Ariel Scotti"], "canonical_link": "https://www.nydailynews.com/2018/06/15/catherine-zeta-jones-is-not-sorry-for-being-pretty-rich-and-married-to-a-movie-star/", "title": "Catherine Zeta-Jones is not sorry for being pretty, rich and married to a movie star", "meta_data": {"application-name": "newyorkdailynews", "viewport": "width=device-width, initial-scale=1", "msvalidate.01": "4B535F7EB2971D1FCBA5D1D3E3E292C3", "robots": "max-image-preview:large", "description": "Catherine Zeta-Jones is over being humble about her enviable life.", "generator": "WordPress 6.4.1", "og": {"type": "article", "title": "Catherine Zeta-Jones is not sorry for being pretty, rich and married to a movie star", "url": "https://www.nydailynews.com/2018/06/15/catherine-zeta-jones-is-not-sorry-for-being-pretty-rich-and-married-to-a-movie-star/", "description": "Catherine Zeta-Jones is over being humble about her enviable life. “One thing I’m not is humble anymore,” Zeta-Jones said in a wide-ranging interview with the Mirror UK. “I&…", "site_name": "New York Daily News", "image": {"identifier": "https://www.nydailynews.com/wp-content/uploads/migration/2018/06/15/6LAXQMCQN5EMFNAE2GXSQ43Q7A.jpg?w=1024&h=670", "width": 1024, "height": 670}, "locale": "en_US"}, "article": {"published_time": "2018-06-15T16:00:00+00:00", "modified_time": "2018-12-13T12:28:38+00:00"}, "twitter": {"text": {"title": "Catherine Zeta-Jones is not sorry for being pretty, rich and married to a movie star"}, "image": "https://www.nydailynews.com/wp-content/uploads/migration/2018/06/15/6LAXQMCQN5EMFNAE2GXSQ43Q7A.jpg?w=640", "card": "summary_large_image"}, "msapplication-TileImage": "https://www.nydailynews.com/wp-content/uploads/2023/09/cropped-DailyNewsCamera-7.webp?w=270"}, "movies": [], "publish_date": 1529010000.0, "source": "https://www.nydailynews.com", "summary": ""}