{"url": "garner315.rssing.com/chan-9362901/all_p13.html", "text": "Jennifer Garner and Lindsay Shookus are not “both pregnant” with Ben Affleck’s babies, contrary to a new tabloid cover story. Garner and Affleck also have not “called off” their divorce. Gossip Cop can exclusively bust these untruths.\n\nThe latest cover of Star features photos of Garner and Shookus that were taken from side angles, giving the false illusion of protruding stomachs. These misleading pictures are being used to sell an entirely fabricated narrative about Affleck impregnating both women. It’s evident right in the sub-headline inside the issue that this is all bogus, with the magazine writing, “Sources Say Ben Affleck May Be Gearing Up For New Babies — With Both His Girlfriend And His Ex-Wife!” Garner is not Affleck’s “ex-wife,” as they are still legally married, and the use of the word “may” indicates the outlet doesn’t have any legitimate confirmation to back up its claims.\n\nIn fact, the publication goes on to contend Affleck “could be expecting a child not only with Lindsay — but also with Jen.” Notably, neither “may” nor “could” appear on the cover, where it’s declared Shookus and Garner are “both pregnant.” The tabloid lures readers in with what appears to be an announcement, but then changes course in the actual story, which is apparently about the possibility that they’re both carrying the actor’s babies. Following this bait-and-switch, a so-called “source” calls the situation a “mess,” but asserts “the initial shock is wearing off,” and Affleck is “actually feeling good about it.”\n\nBut how is it not known for sure then whether or not Garner and Shookus are expecting? The logic is faulty throughout the piece. It’s alleged that Affleck possibly impregnated Garner when he supposedly spent the night at her home back on March 7. “It’s no secret Ben was trying to woo Jen back, even while seeing Lindsay,” claims the tabloid’s untraceable “insider,” while the unnamed “source” theorizes Affleck and Garner “may have had a brief magic moment” during the unverified “sleepover.” Meanwhile, another anonymous “insider” contends that unidentifiable “people” are now “buzzing she’s pregnant, and that the timing lines perfectly up with the night Ben slept at her place.”\n\nAs for Shookus, the magazine asserts she’s “rumored to be pregnant, too,” with another purported “source” alleging there’s “talk of a baby on the way.” She and Affleck are said to be “both very happy, in spite of the unusual circumstances,” which is a clear contradiction from the cover line that maintains Shookus’ “baby joy” has been “shattered.” In another red flag, there’s nothing said in the article about Affleck and Garner calling off their divorce, despite that also being touted on the front of the issue.\n\nGossip Cop also already busted this same outlet a few weeks ago for falsely claiming Shookus is pregnant. As we pointed out then, just days before that tale was published Shookus and Affleck went on a double date with her parents, where she was seen drinking wine. That same weekend, Shookus and Affleck were photographed on a hike with her family, and it was clear from her pictured bared midriff that she does not have any kind of a baby bump. That was on June 24, a week after the misleading June 16 photo of Shookus that Star uses on its cover. Basically, she didn’t have a baby bump and then eight days later it disappeared.\n\nIn regards to the actor reconciling with his estranged wife, People examined the state of Affleck and Garner’s relationship on the one-year anniversary of the divorce filing, and reported that while they co-parent and support one another, he is in a “very committed relationship” with Shookus. That means no dalliances with Garner. Furthermore, Garner just did a YouTube live stream with Martha Stewart this week, and it’s apparent from the video that she, too, doesn’t have a baby bump. The photo of Garner on the cover was taken on July 4, a full 12 days before her later flat-stomach appearance with Stewart.\n\nConclusion: More recent photos of Garner and Shookus than the ones used by the tabloid show that neither of them has a baby bump. There is also independent reporting about Shookus drinking wine after the cover picture was taken, and another reputable outlet has reported that Garner and Affleck aren’t involved romantically any more. That rules out pregnancies for both women. In addition to all this transparent evidence, Garner’s spokesperson, who is authorized to speak on her behalf, confirms to Gossip Cop that she is neither pregnant nor having a rendezvous with Affleck. For his part, Affleck’s rep tells us on the record that the double pregnancy cover story is “so crazy” and untrue that it’s “amusing almost.” And a Shookus confidante, who spoke on the condition of anonymity, calls the claims both “hilarious” and “not true.”", "images": ["http://i1.wp.com/i.imgur.com/9QSKD2N.jpg?resize=500%2C250", "http://blogger.googleusercontent.com/img/a/AVvXsEhw_W80hB1qSLjM9coWwH25V0PMCC0d00odVviIAvRkuEGhQqwfqgZluhELFkkutyk4UKOFz9bdv1ag1aeHkXGHPGMrjVuWyf4JO0Ifxy9ox0Xi_gIU6iL3pI-L_4HY2Vd0me6-Uvap1F4zRTt9ke8kH6X6KtiUv-5dTnrCvoqTjjnkZ4fjcvI44L_b=w563-h303", "http://mylifeofcrime.files.wordpress.com/2016/06/morrisg-info.jpg?w=468&h=381", "http://c2.vgtstatic.com/thumbll/1/8/185615-v1/wolfgang-marguerres-house.jpg", "http://www.rssing.com/inc2/img/matult.jpg", "http://www.gfxtra31.com/uploads/posts/2023-11/1701112554_00a54e29_medium.jpg", "http://www.rssing.com/inc2/img/tsbtn.png", "http://blogs.denverpost.com/coldcases/files/2012/08/aaagrabin-270x270.jpg", "http://www.rssing.com/inc2/img/star_full.png", "http://i.kym-cdn.com/entries/icons/mobile/000/047/390/cover8.jpg", "http://footballfonts.com/u/img/premier-league-23-24-otf-font-installation.jpg", "http://images.dailykos.com/images/1250449/large/F_NHCuWXgAEwmnf1.jpg?1701005344", "http://i1.wp.com/4.bp.blogspot.com/-JwKOpDHBQAw/VyoOC2mN_zI/AAAAAAAACog/aD8odnlNJTsQj78AzVONN2ep6JRvv3iwACLcB/s1600/Slumdog%2BMillionaire%2B%25282008%2529%2BBluray.jpg?resize=350%2C450&ssl=1", "http://gantdaily.com/wp-content/uploads/2015/10/Haselhuhn-Timothy-6-4-86-265x300.png", "http://www.aircargoweek.com/wp-content/uploads/2023/11/IAM-Logo-300x165.png", "http://audioz.download/uploads/posts/2018-03/thumbs/1521643996_b.jpg", "http://www.rssing.com/favicon.ico", "http://4.bp.blogspot.com/-CUkIv712kCY/VYo5KIYsbmI/AAAAAAAAdBM/3fpj_vqkp_s/s400/Bukan-Wanita-Sempurna-Syawal-Aidilfitri4.jpg", "http://4.bp.blogspot.com/-PufEKtYy6uI/Vhf3giItgqI/AAAAAAAACn4/0k5uVgdJA7w/s400/this%2Bis%2Bthe%2Bboyfriend%2Bi%2Bwas%2Btalking%2Babout.jpg", "http://i0.wp.com/publictv.in/wp-content/uploads/2023/11/U_19TEAM_INDIA.jpg?fit=800%2C450&ssl=1", "http://www.nagpurtoday.in/wp-content/uploads/2023/11/Burglar.png", "http://pixel.quantserve.com/pixel/p-KygWsHah2_7Qa.gif", "http://assets.suredone.com/1517/media-pics/cp039028-ac-heater-blower-fan-motor-vw-rabbit-mk1-cabriolet-a-c-genuine-175-820-021-d.jpg", "http://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEisNetjGqLrNAxN-B6IipvrUWH2xLZPo1mCo7KffSudwRAUC4LRlnByuYonbfEWPG33xVcdkKcpKt9FzOeYg5zFE5vhTp-GoDexEMgOpgO3wUSZoDXOM-IcAUvK3ZnRKi9mIDs2eBN3aW325vaN1sSoCtdt3ubflKyOFzZpkKGWn4kDAf4w4HqsFjLeXUc/w369-h256/ncert-solutions-for-trikonomiti-ka-parichaya-exercise-8-1-class10-maths-hindi-9.JPG", "http://prints.mikeschley.com/img/s6/v135/p2665005923-3.jpg", "http://www.donegaldaily.com/wp-content/uploads/2013/08/James-Brennan-228x300.jpg", "http://3.bp.blogspot.com/--H9mby7tAMI/ULbtVcWqzHI/AAAAAAAAACY/ykOJjy2vq0g/s1600/redmananne.jpg", "http://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEixPXKhjpTOkx66SzDV9l6eqIaryTKWOnxgVUlZu8JVSLxKQp8QIy19319Z5h8BuM_6LTRiL0GcDDuMJBwBwIQ4sSNIqZ8y5pvWI-C5NylG94h-HgwJ2ArRnRMCaYfCRE2JckbSGgeM58WclMiaRSAQjARH4lA4Nb2lEfpywzdYby7fZLAhcGhz8huDoHM/s16000/Gates-2-678x381.jpg.webp", "http://media.moddb.com/cache/images/downloads/1/93/92326/thumb_620x2000/eeeeeee.jpg", "http://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEhblK3yuStl8rVLG-OkChVs0ARBO8j5RwEnq7yC5qk-Q9z7G7Hu3mMxT3W-OmmGN-5CIU88YHmHmt3iP_jbd4q51gL1M0c7akLCHW7vJpEihCiWkTBkDaa4S9mAS0ocxfNpqlMNRukGnXrD04z-daOM0kSS-g2AX6FYrxtUQW4VsYeg0LTrWhZQI7_vbcGo/w640-h356/IOR%20Nelson%2010-11-2023%20(2).JPG", "http://ecx.images-amazon.com/images/I/61xAjXtg-tL.jpg", "http://cdn.singpromos.com/wp-content/uploads/2023/11/Public-Transport-Career-feat-singpromos.com-20-Nov-2023-550x289.jpg", "http://1.bp.blogspot.com/-zFk-juC_mB8/Ui49BobEGiI/AAAAAAAAAY8/TCNvBGnnPhU/s320/Help-Ism-Ghawth-al-Adhim-3.jpg", "http://3.bp.blogspot.com/-sebLMREQ6tA/U9RPapDvxPI/AAAAAAAAEds/4GEkFDe_Cr4/s1600/Barbra-Streisand-Plastic-Surgery.jpg", "http://2.bp.blogspot.com/-ZNGiuPCRVqE/UYuZfjlPPNI/AAAAAAAADiI/1_CRHpTJ83A/s320/11.jpg"], "top_img": "http://www.rssing.com/favicon.ico", "keywords": [], "authors": [], "canonical_link": "", "title": "Jennifer Garner – Gossip Cop", "meta_data": {"viewport": "width=device-width, initial-scale=1", "optiads": "OTZZUW5CQ2xBSFgrN0FUUlYxUHRTZz09"}, "movies": [], "publish_date": null, "source": "http://garner315.rssing.com", "summary": ""}