{"url": "https://www.biography.com/people/miley-cyrus-299134", "text": "(1992-)\n\nWho Is Miley Cyrus?\n\nSinger and actress Miley Cyrus is the daughter of country star Billy Ray Cyrus. She began acting at a young age, landing the starring role on the hit show Hannah Montana in 2004. Cyrus went on to release several successful albums, including Breakout (2008) and Can't Be Tamed (2010) while becoming increasingly known for her wild behavior. Her 2013 single \"Wrecking Ball,\" backed by a controversial video, became her first U.S. No. 1 hit. Along with retaining a presence on radio, Cyrus served as a coach on The Voice for two seasons.\n\nEarly Life and Career\n\nBorn Destiny Hope Cyrus on November 23, 1992, in Franklin, Tennessee, Miley Cyrus is the daughter of 1990s country star Billy Ray Cyrus. (She later changed her name to \"Miley,\" the nickname she was given as a baby for often smiling.) Cyrus grew up on the family farm, near Nashville, Tennessee, with two siblings and three half-siblings. She was passionate about acting at a young age, appearing on her father's television series, Doc, and in Tim Burton's Big Fish (2003).\n\n'Hannah Montana'\n\nIn 2004, Cyrus beat out 1,000 hopefuls to land the starring role of Miley Stewart on the hit Disney show Hannah Montana. The tween series features a young pop superstar (Montana) who hides her celebrity identity to be an everyday teen in real life (Stewart).\n\nTo accommodate filming, the entire family moved to Los Angeles, California, with Billy Ray joining his daughter on screen as her fictional dad-manager. Her star on the rise, Cyrus released a successful Hannah Montana soundtrack album in 2006.\n\nIn 2007 Cyrus's double album, Hannah Montana 2: Meet Miley Cyrus, led to the launch of the Best of Both Worlds Tour. The concert series sold out in record time, and the show was extended by 14 dates to help placate disappointed fans. Her successful 3-D concert film collected $31.3 million during its opening weekend in February 2008.\n\nEnthusiasm for Cyrus's TV alter ego remained strong through the end of the decade. Hannah Montana: The Movie scored at the box office, bringing in more than $79 million following its April 2009 release. Cyrus bid farewell to the role with the conclusion of Hannah Montana in early 2011.\n\nAlbums and Hit Songs\n\n'Breakout,' 'The Time of Our Lives,' 'Can't Be Tamed'\n\nCyrus' second studio album, Breakout, became a huge hit in 2008, reaching the top of the pop album charts. The following year she released the EP The Time of Our Lives, featuring the hit singles \"Party in the U.S.A.\" and \"When I Look at You,\" the former becoming one of the singer's most successful song to date, selling more than 5.38 million copies and earning a spot among the best-selling singles of all time. The young star followed that success with the release of a new album, 2010's Can't Be Tamed.\n\n'We Can't Stop,' 'Wrecking Ball,' 'Bangerz'\n\nCyrus sought to distance herself from her Hannah Montana persona by cutting her hair short and wearing edgy fashions, but no one was quite prepared for how far she would go: At the MTV Video Music Awards (VMAs) in August 2013, Cyrus stunned the audience with her raunchy performance of her single, \"We Can't Stop.\" Around this time, she appeared nude in the video of a follow-up single, \"Wrecking Ball.\" However, the swirling controversy seemed to bolster sales of Cyrus's fourth studio album, Bangerz, released in October 2013. Meanwhile, \"Wrecking Ball\" became her first U.S. single to top the pop charts and earned her Video of the Year honors at the 2014 VMAs.\n\n'Miley Cyrus & Her Dead Petz,' 'Younger Now'\n\nNamed host of the 2015 VMAs, Cyrus concluded her efforts that evening by announcing the release of a new, free album. A departure from her pop roots, Miley Cyrus & Her Dead Petz explored themes of psychedelia as it wound through its 23 tracks. The album drew mixed reviews, with some critics praising the artist's willingness to push creative boundaries while retaining a sense of radio-friendly tracks. Her follow-up album, Younger Now (2017), featuring the lead single \"Malibu,\" marked a return to more conservative fare.\n\n'She Is Coming'\n\nHer seventh studio album on the way, Cyrus released its first installment, the six-track EP She Is Coming, in May 2019, with the single \"Mother's Daughter\" arriving a couple of weeks later. Cyrus followed with \"Slide Away\" in August, before teaming with Ariana Grande and Lana Del Rey for \"Don't Call Me Angel,\" from the Charlie's Angels soundtrack.\n\nFilm and TV\n\n'The Last Song,' 'LOL,' 'So Undercover'\n\nIn 2010 Cyrus starred in the romantic drama The Last Song, a film based on a novel of the same name by Nicholas Sparks. Her coming-of-age drama LOL (2012) also was geared toward tween audiences, while her attempt to branch out slightly, as a private investigator in So Undercover (2012), wound up as a direct-to-video release in the United States.\n\n'The Night Before,' 'A Very Murray Christmas,' 'Crisis in Six Scenes'\n\nCyrus resumed her film work in 2015 by appearing as herself in two holiday comedies: The Night Before, starring Seth Rogen and Joseph Gordon-Levitt, and the Bill Murray variety special A Very Murray Christmas. The following year she teamed with Woody Allen to star in the Amazon series Crisis in Six Scenes.\n\n'The Voice'\n\nAlready a veteran of the small screen, Cyrus put her hosting duties to task once again as one of the new female coaches of season 11 of The Voice — the other being Alicia Keys. The women competed to discover the top artist, alongside veteran coaches Adam Levine and Blake Shelton. Cyrus left at the end of the season but returned for season 13 in 2017.\n\n'Black Mirror,' 'Bright Minded'\n\nFollowing a small, uncredited voice role in Guardians of the Galaxy Vol. 2 (2017), Cyrus was the center of attention in the June 2019 season 5 opener of the TV series Black Mirror, in which she played a pop star named Ashley O. The following spring, she launched the interview show Bright Minded: Live with Miley on Instagram Live as a way of helping the public cope with the coronavirus outbreak.\n\nCopyright Infringement Lawsuit\n\nIn March 2018, it was announced that Jamaican singer-songwriter Michael May, who performs under the name Flourgon, had filed a lawsuit alleging that Cyrus's 2013 hit \"We Can't Stop\" was based on his 1988 song \"We Run Things.\"\n\nAccording to the lawsuit, Cyrus had lifted the lyrics \"We run things / Things don't run we\" from May's \"We run things / Things no run we,\" and \"significantly incorporated\" his \"vocal melody/rhythm/cadence/inflection.\"\n\nPersonal Life and Book\n\nCyrus changed her legal name to Miley Ray Cyrus in 2008. That same year she stirred up controversy by posing for revealing shots taken by famed photographer Annie Leibovitz, which appeared in Vanity Fair magazine. The resulting criticism prompted an \"embarrassed\" Cyrus to apologize to fans, though years later she tweeted that she wasn't sorry at all, with a four-letter word for emphasis.\n\nIn 2009 Cyrus provided a look into her life with the autobiography Miles to Go, featuring previously unseen photos, family stories and \"a look at her inner circle of loved ones.\" In a statement around this time, Cyrus said of the book, \"I am so excited to let fans in on how important my relationship with my family is to me. I hope to motivate mothers and daughters to build lifetimes of memories together and inspire kids around the world to live their dreams.\"\n\nRelationships and Marriage to Liam Hemsworth\n\nCyrus, who has made headlines for her romantic life, briefly dated Nick Jonas of the musical group the Jonas Brothers in 2007. She was also romantically linked to model Justin Gaston and actor Carter Jenkins, among other celebrities.\n\nIn June 2012, after three years of dating, Cyrus announced her engagement to actor and Hunger Games star Liam Hemsworth. The pair called it quits in September 2013, and although they later rekindled their relationship and got married on December 23, 2018, they separated again the following summer.\n\nQUICK FACTS\n\nName: Miley Cyrus\n\nBirth date: November 23, 1992\n\nBirth State: Tennessee\n\nBirth City: Franklin\n\nBirth Country: United States\n\nBest Known For: Actress and singer Miley Cyrus achieved early fame as the star of the TV series 'Hannah Montana' and went on to become a successful pop artist.\n\nIndustries\n\nTelevision\n\n\n\nPop\n\nAstrological Sign: Sagittarius\n\nInteresting Facts\n\nMiley Cyrus is the goddaughter of country music icon Dolly Parton.\n\n\n\nMiley Cyrus was born Destiny Hope, but she got the nickname Miley because she smiled so much as a baby.\n\nFact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us!\n\nQUOTES", "images": ["https://hips.hearstapps.com/hmg-prod/images/leonard-bernstein-attends-jackie-mason-opening-on-december-news-photo-1693403011.jpg?crop=1.00xw:0.583xh;0,0.0377xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:0.502xh;0,0.422xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/dolly-parton-speaks-during-a-press-conference-to-launch-her-news-photo-1695409383.jpg?crop=0.915xw:0.610xh;0.0417xw,0.0545xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1xw:1.0xh;center,top&resize=640:*", "https://hips.hearstapps.com/hmg-prod/images/charo-attends-the-real-love-boat-series-kick-off-party-with-news-photo-1701276752.jpg?crop=0.626xw:0.450xh;0.152xw,0.0432xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/attends-the-60th-annual-grammy-awards-at-madison-square-news-photo-1700068963.jpg?crop=0.853xw:0.644xh;0.0734xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/american-composer-and-conductor-leonard-bernstein-and-his-news-photo-1693421241.jpg?crop=1.00xw:0.776xh;0,0.0730xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/sean-combs-aka-diddy-attends-the-celebration-for-diddys-news-photo-1700172387.jpg?crop=0.909xw:0.607xh;0.0433xw,0.0374xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/olivia-rodrigo-attends-the-2023-vanity-fair-oscar-party-news-photo-1699910451.jpg?crop=1.00xw:0.737xh;0,0.0353xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523ffffff&id=social-button-icon", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/network-logo.04aa008.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/phil-collins-attends-a-photocall-as-he-announces-his-not-news-photo-1700147281.jpg?crop=0.678xw:1.00xh;0.162xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/the-edge-guitarist-of-u2-performs-on-stage-at-womens-march-news-photo-1700149573.jpg?crop=0.670xw:1.00xh;0.303xw,0&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "https://hips.hearstapps.com/hmg-prod/images/promotional-portrait-of-american-country-music-singer-and-news-photo-1701190707.jpg?crop=0.770xw:0.757xh;0.0943xw,0.0624xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523ffffff&id=social-button-icon", "https://hips.hearstapps.com/hmg-prod/images/taylor-swift-attends-taylor-swift-the-eras-tour-concert-news-photo-1697236739.jpg?crop=1.00xw:0.718xh;0,0.0700xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/singer-sza-performs-on-stage-during-her-the-sos-north-news-photo-1699635503.jpg?crop=0.707xw:0.982xh;0.159xw,0.0179xh&resize=360:*", "https://www.biography.com/_assets/design-tokens/biography/static/images/logos/logo.5ec9b18.svg?primary=%2523ffffff"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:0.502xh;0,0.422xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.biography.com/musicians/miley-cyrus", "title": "Songs, Liam Hemsworth & Age", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Miley Cyrus - Songs, Liam Hemsworth & Age", "description": "Actress and singer Miley Cyrus achieved early fame as the star of the TV series 'Hannah Montana' and went on to become a successful pop artist.", "keywords": "Last Name: Cyrus, First Name: Miley, Birth Month/Day: November 23, Birth City: Franklin, Birth Year: 1992, Industry/Interest Area: Pop, Nationality: Australian, Birth State: Tennessee, Industry/Interest Area: Television, Astrological Sign: Sagittarius, Birth Month: 11, Birth Country: United States", "og": {"type": "article", "site_name": "Biography", "title": "Miley Cyrus - Songs, Liam Hemsworth & Age", "description": "Actress and singer Miley Cyrus achieved early fame as the star of the TV series 'Hannah Montana' and went on to become a successful pop artist.", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:0.502xh;0,0.422xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.biography.com/musicians/miley-cyrus"}, "theme-color": "#000000", "article": {"publisher": "https://www.facebook.com/Biography", "section": "Famous Musicians", "modified_time": "2023-09-01T16:30:30Z", "published_time": "2020-08-17T20:51:00Z"}, "twitter": {"site": "@biography", "image": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:0.502xh;0,0.422xh&resize=640:*", "card": "summary_large_image"}, "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:0.502xh;0,0.422xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/Miley-Cyrus_GettyImages-605936368.jpg?crop=1.00xw:1.00xh;0,0", "auto-publish": "never", "sailthru.excerpt": "(1992-)Who Is Miley Cyrus?Singer and actress Miley Cyrus is the daughter of country star Billy Ray Cyrus. She began acting at a young age, landing the starring role on the hit show Hannah Montana in 2004. Cyrus went on to release several successful albums, including Breakout (2008) and Can't Be", "sailthru.tags": "musicians,Famous Musicians", "sailthru.date": "2020-08-17 20:51:00", "sailthru.socialtitle": "Miley Cyrus - Songs, Liam Hemsworth & Age", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 42}, "movies": [], "publish_date": 1597697460.0, "source": "https://www.biography.com", "summary": ""}