{"url": "https://ew.com/oscars/2018/02/21/hayley-mills-juvenile-oscar/", "text": "To read more about the greatest untold stories of Hollywood’s biggest night, pick up the new issue of Entertainment Weekly on stands now, or buy it here. Don’t forget to subscribe for more exclusive interviews and photos, only in EW.\n\nHayley Mills had no idea she’d won an Oscar until it arrived on her doorstep. At 14, the actress nabbed the Academy’s last juvenile award — a special prize, first given in 1935, for child performers like Shirley Temple and Judy Garland — for her turn as the perpetually sunny heroine of Pollyanna. But not only did she miss the 1961 ceremony, she didn’t realize it had occurred at all. “I didn’t know very much about the Oscars,” Mills admits. “I didn’t know very much about anything, really. So it was all a big surprise.”\n\nOf course, Mills has a much clearer understanding now, at 71, of what her achievement meant. Here, she looks back on her early career, the moment she received her Oscar, and where the trophy — a miniature version of the statuette — went.\n\nLoomis Dean/The LIFE Picture Collection/Getty Images\n\nENTERTAINMENT WEEKLY: Pollyanna was the first of six features you made with Walt Disney. What do you think now of your performances as a child actor?\n\nHAYLEY MILLS: The majority of the movies that I made when I was a child [were] very well-written. I worked with wonderful, experienced actors and actresses and excellent directors. If you can’t turn in a halfway decent performance with that kind of support around you, obviously you aren’t supposed to be doing it. I started acting at a time when children were younger. Television wasn’t such a big thing, there were no iPhones or iPods or computers, and we stayed living in our imaginations as children. I don’t think we grew up as quickly. So [acting] was just a short step from the games I played, the imaginary games which all children do.\n\nDo you have any fond memories of your time on Pollyanna?\n\nMaking Pollyanna was a wonderful experience. I’d made one movie before in England, and we shot a lot of it on location in Wales, and it was terribly cold. It was what I was familiar with. It was England. And suddenly I found myself for the first time in my life in not just California, but Hollywood, and that had a huge impact. I was there with my mother and my little brother, and to be on Walt Disney’s studios, that was, you know, I didn’t really have that much to compare it with.\n\nWe stayed in the famous Chateau Marmont hotel in those little cabins and looked down over Sunset Boulevard. I spent most of my time I think in Schwab’s, the pharmacy, sitting on those stools and having ice cream sodas and hot fudge sundaes, and getting carried away by all the comics. Walt Disney took us to Disneyland and we stayed there overnight, and my brother who was 9 at the time decided that he wanted to live in Disneyland and we had great difficulty dragging him out. California and Hollywood in those days, it was magic for a child.\n\nBuena Vista/Getty Images\n\nYou worked with Oscar winners on that set, including Jane Wyman (above) and Karl Malden.\n\nI remember Jane Wyman with enormous affection. She was warm and sweet and kind and lovely to me. And Karl Malden used to make me laugh a lot. He always said, when we did a scene together, the scene was about our two noses, because I had — and still have [laughs] — not the most aristocratic nose in the business, and neither did Karl.\n\nWatch the full episode of Hollywood’s Greatest Untold Stories now on PeopleTV. Go to PeopleTV.com, or download the PeopleTV app on your favorite mobile or connected TV device.\n\nIn fact, the first day on Pollyanna was the scene with Karl Malden on the hill where he’s practicing his sermon, and it was my first day on this movie, and it was terribly hot, and I had this big bow on the back of my head and a fake plait stuck on. And my boots were very new and stiff, and my clothes was itchy, and all I could think about really was how desperately I wanted to get to the catering truck because down the hill, there it was. I’d never seen such amazing looking American food, and I was distracted to say the least. They didn’t get a single shot in the can in the morning.\n\nThey did eventually — and you went on to win the juvenile Oscar. At the ceremony, Annette Funicello accepted the trophy on your behalf from Shirley Temple. Do you remember why you couldn’t make it to the show?\n\nI was actually at boarding school in England, and I didn’t know anything about it until it turned up. Like, “Oh, that’s sweet. What’s that?” I was told, “Well, this is a very special award,” but it was quite a few years before I began to appreciate what I had.\n\nWhen did that finally happen?\n\nIt really wasn’t until the 75th Oscar ceremony, where I was one of the [former] winners on stage. The curtains parted, and I found myself staring out at the Kodak Theatre, and I looked straight at Richard Gere and [Martin] Scorsese, and nearly fainted. I thought, “My God, I’m actually a part of this!” I hadn’t ever felt that connection, and it was extraordinary. My heroes were on that stage with me, and I was considered to be one of their number!\n\nWhere is your Oscar now?\n\nI’m terribly embarrassed to say this, because it looks so careless, but it has disappeared. In the late ’80s, I came to California to do a television series [Good Morning, Miss Bliss]. When I came back from that first year, my little statuette had disappeared, and I never found it. And you know, it’s not something you can replace. They’ve broken the mold. I spoke to the Academy, and I said, “Well, look, give me a big one then!” [Laughs] They said, “I’m sorry, it doesn’t work like that.” But I’d say for 25 years it was on the mantelpiece in my drawing room, and I was always very proud of it.\n\nAt the time, how did winning the Oscar affect the way you viewed your career? Did it change the way you viewed it at all?\n\nIt didn’t change the way I viewed my career, and maybe that was one of the reasons why my parents decided A, not to tell me about it, and B, therefore, not to send me or let me go to the ceremony, because I was very young… It’s part of their attitude towards me when I was a child, [that] I should be kept as unaffected by the world that I was now moving in as possible. So, I went off to my boarding school, and when I came back from making a movie in Hollywood, I went back to boarding school.\n\nAfter Pollyanna, you went on to make more hits like The Parent Trap, before successfully transitioning into adult parts. You’re now in the Off-Broadway play Party Face. Why did you want to continue acting after being a child star?\n\nGosh, I started acting when I was 12, and I was very, very lucky to be in wonderful films, and it set me on a path which I am very grateful for. It wasn’t always clear to me where I should go, and where the path was leading. Once I started becoming an adolescent and then moving into the adulthood and dealing with life on very, very different levels, there were times where it got confusing and I lost my bearings and I didn’t know who I was was or what I should do or what parts I should play or if I should give it up altogether. When my first son was born, I decided that I would give it up, and I didn’t work for over a year, and then a very interesting little movie came along and I went, “Oooh I’d love to do that.”\n\nAnd then I brought my then-1-year-old son with me on location, and it was miserable for him. It was in the middle of winter in the north of England, and it rained constantly. He was stuck in the trailer, there was mud up to here [gestures] and [I thought], “What am I doing to my little boy?” [Laughs] But this is what I do, and I realized that I’m just, I’m not equipped to do anything else.\n\nI’m very good at being out of work. [Laughs] I’ve got four grandchildren now, and that’s an amazing, fabulous experience, and I can’t wait to see them all again, and the fact that I’m still working at this age is extraordinary, you know? I am so surprised and so grateful that I am still paying the bills by doing this! Every job one does, you learn more and more and more, and of course the irony is that the older one gets and the more experience you’ve had as an actress, the better you get, and the fewer the parts there are to pour all you’ve learned into them… But, you know, if you’re still reasonably compos mentis and healthy, you have a lot to offer as an actor, so I’m very lucky.\n\nMills is now appearing off-Broadway in Party Face on Stage II at City Center through Apr 8, 2018.", "images": ["https://ew.com/thmb/yleqKEWfzX7cTpi665HheWGyPjQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Hayley-Mills-and-David-Rubin-1-7d1b4ad16b854aab854972b84b139e9a.jpg", "https://ew.com/thmb/mexOJKSEga2ks_7FiXvf7V4n0C8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Dominique-Fishback-01-032723-d7821d112fcd4ea68258fbec47ad0f95.jpg", "https://ew.com/thmb/wqBWBuPg0DRir52mAnIhQT3ZM_4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/justified-recap-02_510x380-628458c78b864943ae2beb2ecfb70d7a.jpg", "https://ew.com/thmb/_eDRCEn11T0-Y20ZQH5h2R81u3s=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/000274118-2000-05a4d78c642842a0900638ab8ae1fbdb.jpg", "https://ew.com/thmb/cDGgT8bc0XktFBVypdjMd2Z3WIo=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/ricky-gervais_3201-7809b3c2a697495a8281cea6d56ff2a7.jpg", "https://ew.com/thmb/7ur1p19q-7fyuWaedfdaxYtctdI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/pbdbodr_ec001-50f72db45cb64f2cb0d2c2821857d37a.jpg", "https://ew.com/thmb/83EMcZ8OmL9JKovif7cW5yyD2O4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/HTRA894_VV114-1-52b79bf430174157abd0cf727063d059.jpg", "https://ew.com/thmb/d-UuWq39Ff2IlfxXLuAQfSO7w1g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/left-hand-of-god_216-029c07c074134714906477b8060e4418.jpg", "https://ew.com/thmb/Dc4DSswToFqOBu3bmBOLzXBtpT4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/reg-e-cathey-4b79a4774366432986f56ba70982cea6.jpg", "https://ew.com/thmb/XQlvBI2K1cCHvrzSlsxiKZMdvr8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/GREASE-2-033123-01-7f43d44bc62046d2a572a700456453d9.jpg", "https://ew.com/thmb/j-lyI0pwm_siEA1gIATetBUg4Us=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/145621_0339c-2000-247284ef5bab4328a47788e5f4810973.jpg", "https://ew.com/thmb/xGoGYDWpdbtfyhlpJQwR4P_dS60=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-runner-poster-7315fde7406046fc8c732a510789cb83.jpg", "https://ew.com/thmb/OMsVwbFTQgZ8AOgzvTIdHRwWKAY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/placeholderimage-e2715228ea5b42a5ab6fead459dbcd35.jpg", "https://ew.com/thmb/NomRcQyv2D0NP-37fh_q9uRH-mM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/000274121-976c67d0f4e34adaa0411a730231ff69.jpg", "https://ew.com/thmb/55lxVkS5soHG4B_G-0Mi8tP_c80=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/michael-keaton_0-392ad75e3ca345819ce5c40d611e214e.jpg", "https://ew.com/thmb/-LhKhoLhgQPySJ1GNXzo-enUHGE=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/real-housewives-e051629c36a64a07a288e63cbb1f1da2.jpg", "https://ew.com/thmb/CM-VDdqfJqy0x1GaIqFeWHuSMC0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/karen-dotrice-ab800ed0955d497dbfdacf57ca60580c.jpg", "https://ew.com/thmb/LP4fgo1ElP38mjMZslWJEnD_CcE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/hayley-mills-ecdcccd2581e466bbe76f8e6ece136da.jpg"], "top_img": "https://ew.com/thmb/LP4fgo1ElP38mjMZslWJEnD_CcE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/hayley-mills-ecdcccd2581e466bbe76f8e6ece136da.jpg", "keywords": [], "authors": ["Ew'S Editorial Guidelines"], "canonical_link": "https://ew.com/oscars/2018/02/21/hayley-mills-juvenile-oscar/", "title": "Hayley Mills didn't know she won the last Juvenile Oscar — until it arrived on her doorstep", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "For years, the Academy honored child stars like with Juvenile Oscars, a tradition that ended after 14-year-old Hayley Mills took the prize in 1961.", "parsely-section": "The Awardist", "parsely-tags": "Celebrity,People,Oscars,The Awardist,Movies,Hayley Mills,Untold Stories", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "fb": {"app_id": 2485718348341688}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/oscars/2018/02/21/hayley-mills-juvenile-oscar/", "title": "Hayley Mills didn't know she won the last Juvenile Oscar — until it arrived on her doorstep", "description": "For years, the Academy honored child stars like with Juvenile Oscars, a tradition that ended after 14-year-old Hayley Mills took the prize in 1961.", "image": "https://ew.com/thmb/LP4fgo1ElP38mjMZslWJEnD_CcE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/hayley-mills-ecdcccd2581e466bbe76f8e6ece136da.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "Hayley Mills didn't know she won the last Juvenile Oscar — until it arrived on her doorstep", "description": "For years, the Academy honored child stars like with Juvenile Oscars, a tradition that ended after 14-year-old Hayley Mills took the prize in 1961.", "image": "https://ew.com/thmb/LP4fgo1ElP38mjMZslWJEnD_CcE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/hayley-mills-ecdcccd2581e466bbe76f8e6ece136da.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.18.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.18.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.18.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.18.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.18.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1519164000.0, "source": "https://ew.com", "summary": ""}