{"url": "https://web.archive.org/web/20180309205930/https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "text": "Jughead and Betty may be openly in love on Riverdale, but Cole Sprouse and Lili Reinhart are far less forthcoming about their rumored real-life romance. That doesn't mean fans can't read into every single tweet, Instagram post, and interview that comes from the Riverdale duo to make a case that they are totally and utterly in love IRL.\n\nAdvertisement - Continue Reading Below\n\nCheck out this timeline of their rumored relationship below!\n\nMarch 18, 2017\n\nFans were feeling Cole and Lili on screen from the moment Riverdale premiered in January, but the real-life dating rumors didn't start until Cole shared this gorgeous photo of Lili in a field of flowers. Because clearly, it means she's his muse, right?\n\n🌷🌼🌷🌼👩🏼🌼🌷🌼🌷 A post shared by Cole Sprouse (@colesprouse) on Mar 18, 2017 at 11:30am PDT\n\nApril 22, 2017\n\nCole shared another photo of Lili prancing through a flowery field, this time with a gushy, deep caption that fans had no trouble reading into and deciding was a veiled admission of undying love for Lili.\n\nAdvertisement - Continue Reading Below\n\nJune 12, 2017\n\nLili responded to a ~creative~ thirst trap photo Cole shared on Twitter with major heart eyes.\n\n😍🔥💦💦 — Lili Reinhart (@lilireinhart) June 13, 2017\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nJuly 23, 2017\n\nEagle-eyed fans spotted Cole and Lili sneakily caressing one another's hands in an interview during Comic Con.\n\nCasey Cott clearly felt the sparks.\n\n\n\nThe pair were supposedly spotted making out at the event, but pictures or it didn't happen, right? The closest thing we got to real evidence was this fan photo that proves Cole gave Lili his jacket to keep her warm, which is the next best thing, I guess!\n\nCole really did give his jacket to Lili I'm- pic.twitter.com/jsVGbq1bFG — Bread Inside (@neolutionbread) July 23, 2017\n\nAdvertisement - Continue Reading Below\n\nAugust 11, 2017\n\nCole's TV dad Skeet Ulrich opened up about just how real Cole and Lili's chemistry is with Entertainment Tonight.\n\n\"They have great chemistry and they've been at our house with a lot of the Riverdale people and they always enjoy each other's company. So I wish them the best.\"\n\nSkeet was also asked if the pair share a \"special connection\" off screen, to which he responded: \"It seems like it, yeah. You just hear them talking to each other like they've been best friends for 20 years. So it's a good sign.\"\n\nSeptember 13, 2017\n\nCole and Lili held hands on the cover of Entertainment Weekly. No biggie. (AKA, excuse me while I go cry my eyes out from happiness...)\n\nEntertainment Weekly\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nSeptember 14, 2017\n\nCole seems to suggest that Sprousehart is all in fans' heads in an interview with Entertainment Weekly.\n\n“Since the show began, people have wanted Lili and I to be together,\" Cole told the mag about the impact of Bughead. \"People have wanted Lili and Camila to be together. People have wanted KJ and I to be together. People have wanted every actor on this show to be in a union that they could make real. Truthfully, it’s very pleasing that people talk about Lili and I in that way because it means that we’re resonating so strongly that people really want that to be true,” Cole added.\n\nOctober 17, 2017\n\nJust another gorgeous shot of Lili snapped by Cole.\n\n410 A post shared by Cole Sprouse (@colesprouse) on Oct 17, 2017 at 4:08pm PDT\n\nHe captioned this one \"410,\" which was pretty mysterious to fans. Some think it refers to a date, while others think the number is a secret way for Cole to call Lili his angel.\n\n\n\nAdvertisement - Continue Reading Below\n\nLili shared another photo from their shoot captioned, \"You go first.\"\n\nYou go first. A post shared by Lili Reinhart (@lilireinhart) on Oct 17, 2017 at 5:29pm PDT\n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nOctober 26, 2017\n\nCole admitted that he doesn’t mind making out with Lili.\n\nWhen asked what fans could expect from season two on Live With Kelly and Ryan, Cole hinted at more Bughead sexy times. “[There will be] a little bit more of that, which is going to be good,” he said awkwardly.\n\nAnd he certainly doesn't mind kissing Lili on screen. “They’re contractually obliged to give me as many kiss scenes as possible this season,” he joked. “I wrote it into my contract.”\n\nCheck out the moment below!\n\nNovember 27, 2018\n\nCole told People he will never, ever confirm his relationship with Lili. But he won't deny it either!\n\n\"Whether you dismiss those rumors or whether you encourage those rumors, it’s giving people who are, in my opinion, a bit entitled to your personal life more power,\" Cole explained to the mag.\n\nAdvertisement - Continue Reading Below\n\n\"You have to have spaces for reverence in the industry,\" he continued. \"The more you let people in on that, the more people feel entitled to it and the more it becomes problematic with whoever you end up being with in the future, so I take that very seriously. So I just never talk about it because it’s not anyone’s right to know.\"\n\n\n\nBut Cole knows that fans are bound to continue speculating whether he confirms his relationships or not and he's okay with that. \"People can speculate all they want,\" he said. \"People speculate about me with every member of the cast practically, but it’s really no one’s right to know. It’s also sexy, these parts of the relationships that are just yours.\"\n\nDecember 19, 2018\n\nThe pair won't confirm their relationship, but they will gush about each other on Instagram. For example, Lili couldn't even begin to handle how adorable Cole was on Friends as a child.\n\nJanuary 1, 2018\n\nCole and Lili spend New Years together in Hawaii. The couple that holidays together must be real, right?!\n\nCole Sprouse and Lili Reinhart with a fan today in Hawaii! pic.twitter.com/G9Dbk71zSO — Riverdale News (@_riverdalenews) January 2, 2018\n\nCole Sprouse and Lili Reinhart with fans on Hawaii (January 2, 2018) pic.twitter.com/etW027YAjp — María Spain ♡🐍👑♡ (@am_Chach) January 3, 2018\n\nJanuary 16, 2018\n\nLili echoed Cole's refusal to open up about the nature of their relationship with V magazine, explaining: “People are just dying to know information about if I’m in a relationship or not. I understand the interest, but it’s called a private life for a reason. And it’s not something that I owe the world.\"\n\nLili thinks people are bound to speculate over every one of her relationships, so why bother addressing any of it?\n\n“People are going to say anything and everything. They’re going to say that I love KJ, they’re gonna say that I love Cami, and they’re gonna say that I love Cole: it’s inevitable,” she said. “But I’m not at a point in my life where I’m ready to openly confirm, deny, or talk about a relationship that I’m in, because I think it’s brutal to have a relationship in the spotlight where I can be scrutinized by anyone and everyone.”\n\nFebruary 1, 2018\n\nLili told Ocean Drive that Cole is a calming force in her life as she deals with the stressful nature of fame.\n\n“He really brings us down to earth if we’re feeling like something we’ve said is being taken out of context,” she said. “He’s always the one to be like, ‘Just ignore it. It will blow over.’ It’s a nice, calming energy he has because you know that he’s been through it.”\n\nNoelle Devoe is the Entertainment Editor at Seventeen.com. Follow her on Twitter and Instagram!", "images": ["https://web.archive.org/web/20180309205930im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:0.502xh;0,0.129xh&resize=1200:*", "data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7"], "top_img": "https://web.archive.org/web/20180309205930im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:0.502xh;0,0.129xh&resize=1200:*", "keywords": [], "authors": ["Noelle Devoe"], "canonical_link": "https://web.archive.org/web/20180309205930/https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "title": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "meta_data": {"x-ua-compatible": "IE=edge,chrome=1", "viewport": "width=device-width,initial-scale=1,maximum-scale=1,user-scalable=no", "msapplication-tap-highlight": "no", "theme-color": "#EC008C", "og": {"type": "article", "site_name": "Seventeen", "title": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "description": "Is Bughead real IRL, too? You decide.", "url": "https://web.archive.org/web/20180309205930/https://www.seventeen.com/celebrity/celebrity-couples/a19170778/cole-sprouse-lili-reinhart-relationship-timeline/", "image": {"identifier": "https://web.archive.org/web/20180309205930im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:0.502xh;0,0.129xh&resize=1200:*", "width": 1200, "height": 600}}, "fb": {"app_id": 112965278727107, "pages": 8028997215}, "article": {"publisher": "https://www.facebook.com/seventeen", "modified_time": "2018-03-09 04:22:57", "published_time": "2018-03-09 04:22:00", "section": "Celeb Couples"}, "twitter": {"site": "@seventeen", "card": "summary_large_image", "image": "https://web.archive.org/web/20180309205930im_/https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:0.502xh;0,0.129xh&resize=640:*"}, "google-site-verification": "uQMdsrh02fvs6lNVGcB04v0iEtK1MpGMQ3UF-Fy0RVI", "title": "Cole Sprouse and Lili Reinhart's Relationship Time - Are Jughead and Betty From Riverdale Dating IRL?", "description": "Jughead and Betty may be openly in love on Riverdale​, but Cole Sprouse and Lili Reinhart are far less forthcoming about their rumored real-life romance. Check out this timeline of their rumored relationship below!", "keywords": "Cole Sprouse, Lili Reinhart, cole sprouse lili reinhart relationship, are bughead dating irl, Sprousehart, Lili Reinhart and Cole Sprouse, Bughead, Cole and Lili Pictures, Cole Sprouse and Lili Reinhart Dating, Cole Sprouse and Lili Reinhart Relationship, Riverdale Cast", "news_keywords": "Cole Sprouse, Lili Reinhart, cole sprouse lili reinhart relationship, are bughead dating irl, Sprousehart, Lili Reinhart and Cole Sprouse, Bughead, Cole and Lili Pictures, Cole Sprouse and Lili Reinhart Dating, Cole Sprouse and Lili Reinhart Relationship, Riverdale Cast", "auto-publish": "timely", "thumbnail": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:1.00xh;0,0&resize=320:*", "sailthru.contenttype": "standard-article", "sailthru.tags": "Celebs & Entertainment", "sailthru.date": "2018-03-09T16:22:00Z", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:0.502xh;0,0.129xh", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cole-sprouse-lili-reinhart-cute-pictures-1520549072.jpg?crop=1.00xw:1.00xh;0,0", "sailthru.socialtitle": "A Complete Timeline of Cole Sprouse and Lili Reinhart's Relationship", "m1": ".content-hed", "m2": ".content-dek p"}, "movies": [], "publish_date": 1520562120.0, "source": "https://web.archive.org", "summary": ""}