{"url": "https://www.shape.com/celebrities/star-trainers/trainers-reveal-motivational-mantras-get-results", "text": "Power through an \"off\" day and keep seeing results with these expert tips for staying motivated through weight loss.\n\nIf you notice that your weight-loss motivation is waning, give yourself a break for one to three days, says Klapow. \"The more people try to ‘catch' it, the more elusive it becomes; by allowing it to run its natural course and at the same time having a set of habit-changing skills, you'll stay on track and your motivation levels will run their natural course.\"\n\n\"I tell people not to waste precious time and energy on staying highly motivated because it has a natural rhythm. Most people see a drop in motivation as a signal of failure, but it's not,\" he says.\n\n\"The key to weight-loss motivation is similar to the [amount of] fuel in a car — you don't need the motivation tank to be full to drive, you just need to prevent it from running empty,\" says Joshua C. Klapow, Ph.D. , adjunct associate professor at the University of Alabama at Birmingham and author of Living SMART: 5 Essential Skills to Change Your Health Habits Forever .\n\n01 of 19 Choose an Attainable Goal John Fedele/Getty Set a reasonable goal: Count on losing just 10 percent of your weight within six months, and focus on keeping it off for more than a year. But be careful about relying solely on figures. \"A number on the scale isn't a goal; it's a measurement of success,\" says Bonnie Goodman, a psychotherapist based in Fort Lauderdale, Florida, who specializes in behavioral therapy. Instead, focus on behaviors you wish to change: to reduce your daily fat intake to below 35 percent, or to cut out your afternoon soda or vending-machine snack. Also, consider setting non-weight-related goals, such as entering a 5K race. The pounds you'll automatically lose in the process will seem like a bonus — and may even act as a little weight-loss encouragement.\n\n02 of 19 Design a Plan that Suits Your Lifestyle Getty Images / Maria Korneeva Create your own plan so it will fit into the way you live. In theory, you need to cut out only 150 calories a day to lose 15 pounds in a year, so start small to have a better chance at maintaining your weight loss motivation. \"Little changes to your current eating style, such as downsizing portions or preparing foods differently, can add up to big results,\" says Daniel C. Stettner, Ph.D., LP, a licensed psychologist at Great Lakes Psychology Group in Michigan. Think about the foods you can — and can't — live without, then try to build your plan around them. If you're a born snacker, divide your daily calories into six or seven mini meals so you always feel like you're having a nibble. Whatever you do, don't give up your favorite foods. You'll inevitably feel deprived, which will only make your cravings stronger — and your willpower weaker. Why the 80/20 Rule Is an Awesome Way to Find Dietary Balance\n\n03 of 19 Put Your Plan on Paper Jacob Lund/Shutterstock Any successful venture requires a plan that describes its mission and specifics on how to achieve it — without one, you have no idea where you're starting, where you're going, or how you'll get there, says Jenn Walters, a certified personal trainer and co-founder of Fit Bottomed Girls. Start by listing all the reasons you can think of for slimming down — in other words, define your weight-loss motivation on paper. Once you've determined exactly what you want to achieve and your deadline, work backward to create a monthly plan of action with realistic and specific goals for losing weight (such as committing to healthy snacking).\n\n04 of 19 Keep Your Committments Mostovyi Sergii Igorevich/Shutterstock If you're struggling to stick with your weight-loss motivation, practice integrity in other areas of your life, suggests Andre Farnell, a certified strength and conditioning coach and owner of Better Body Expert. Pay off your debts, make good on your promises to friends, family, or co-workers, and take Marie Kondo's advice and clean out your closet, Practice sticking with promises or commitments you've made in other areas of your life in order to strengthen your own subconscious belief that you are able to uphold the promise to lose weight that you've made to yourself, says Farnell.\n\n05 of 19 Steer Clear of Comparisons Luis Alvarez/Getty Pinning and posting pictures of super models may seem like good weight-loss motivation, but according to research, it's more likely to hurt your progress. Scientists in the Netherlands divided women who wanted to lose weight into two groups: the first group was given a food journal with photos of thin models on the cover and interior pages, and the second group was given a journal with a neutral logo image on the front. While the neutral group lost weight, those given the journals sprinkled with supermodel images gained weight. Instead of comparing yourself to unrealistic fashion models, stay inspired by posting images of you at your healthiest for a serious dose of weight-loss inspiration.\n\n\n\n06 of 19 Focus On a Feeling nd3000/Shutterstock Too often we get frustrated by focusing on a specific number on the scale, or even a task we must do to reach our goal (such as working out), which is a pretty quick way to zap your zest, says Simon Rego, Ph.D., professor, chief or psychiatry, and director of psychology training at Montefiore Medical Center/Albert Einstein College of Medicine in New York. Concentrate on your mood after you've eaten a healthy meal or how you feel after a great workout — weight-loss motivation doesn't always have to come before an activity, says Rego. \"If you focus on how you feel each time you exercise, you'll get all the benefits of burning calories, plus the reinforcement of remembering how good it felt to do it, which should increase your motivation to do more.\" How to Speed Up Your Metabolism By Boosting Your Mood\n\n07 of 19 Celebrate Every Success baranq/Shutterstock Instead of waiting until you've reached the big finish line to reward yourself for weight loss, focus on small goals and give yourself rewards along the way. It can be something simple like taking yourself for a pedicure once you've reached your first goal. At the halfway point, plan something amazing (such as a day at the spa, suggests Susan Bartell, Psy.D., a psychologist and motivational speaker. You'll be less likely to throw in the towel when things get tough if you have interim rewards in place. \"Rewards reinforce positive behavior, but only if they're meaningful,\" says Goodman. \"When you reach a milestone in your weight-loss or exercise routine, treat yourself to something that celebrates the particular goal you achieved and helps further your progress.\"\n\n08 of 19 Hang Your Motivation By the Mirror g-stockstudio/Shutterstock Putting a special piece of your wardrobe on display is a great daily weight-loss inspiration. Pick something you'll look forward to wearing and hang it close to your mirror. \"I visualize myself wearing it and think about how good I will feel,\" says Marie-Pier Ouellet, a student in Montreal, Canada. Since it's an item you already own or plan to wear, it's much less likely to be an unrealistic goal (when compared to say, that photo of Gisele Bündchen) and will help spike your motivation to keep hitting the gym. How You'll Know When You've Reached Your Goal Weight\n\n09 of 19 Team up With a Friend or Group Jacob Lund/Shutterstock When it comes to losing weight, partnering up with a friend or a team can help you stay motivated. According to a study published in the journal Obesity, the social influence of team-based weight-loss competitions can help you lose up to 20 percent more weight than you would if you did it alone. Even more interesting is that team captains shed more weight than team members, which the researchers explain is likely due to their position and involvement in the group competition. According to the Mayo Clinic, having a friend who will take a walk or cook healthy meals with you can make it easier stay accountable and achieve your goals. Take it one step further by getting your family involved — play tag with the kids and hit the gym with your partner on weekends. 10 Workout Motivation Tips That Will Get You Off the Couch\n\n10 of 19 Clarify Your \"Why\" VGstockstudio/Shutterstock If you're really going to stay motivated to lose weight, the first thing you need to do is determine what actually motivates you, says Anne Dranitsaris, Ph.D., author of Who Are You Meant to Be? For example, if you're inspired by your family, focus on how exercising will help you remain active in your children's lives well into your old age, she says. \"In order to change your patterns of behavior, you first have to recognize your patterns and why they exist. If you can redirect that healthy weight-loss motivation into a new action, your goal will automatically seem more compelling and achievable.\"\n\n11 of 19 Enlist the Help of an Expert Getty Images / LWA Finding the right meal plan that works for you and doesn’t leave you hungry at the end of the day can be a difficult challenge to overcome. Consider turning to a dietitian or nutritionist for expert guidance on determining the right balance of healthy foods that are right for you.\n\nIf your struggle to get motivated is triggering feelings of depression, anxiety, or insecurity, you may want to contact a therapist for help.\n\n\n\n12 of 19 Ditch the Daily Weigh-In olegius/shutterstock The scale can be a helpful tool for measuring your progress, but many people get in the habit of weighing themselves too often. \"While some research shows that people manage (maintain) their weight better by weighing in daily, the same can't be said for losing weight,\" says Nicole Nichols, editor and fitness expert for PeopleOneHealth.com. \"Daily weigh-ins, or multiple weigh-ins per day, will only sap your weight-loss motivation with a roller coaster of emotions and can cause you to freak out by temporary up-ticks in the scale that have nothing to do with body mass or body fat,\" she says. Instead, Nichols recommends stepping on the scale once a week — or even every two weeks — to better track your progress. And in the meantime, paying attention to non-scale victories which can provide some serious inspiration.\n\n13 of 19 Maintain a Photo Journal of Your Progress Jacob Lund/Shutterstock You know what they say: A picture is worth a thousand words. Try tracking your progress by creating a weight-loss and fitness diary of photos, Take photos after a great workout or during a healthy meal to help you document the changes in your lifestyle and your body that you may not otherwise notice — and that the scale won't necessarily show. Keep these images for yourself and just scroll through them when you need a little boost of weight-loss inspiration. 16 Ways to Rekindle Exercise and Weight-Loss Motivation\n\n14 of 19 Silence Your Inner Critic sunok/Shutterstock Unfortunately, many people have a bad habit of using self-criticism as an inspirational tool, especially when it comes to weight-loss motivation, but not only does it not encourage, it could actually sabotage your efforts, says Vanessa Scotto, a life coach specializing in behavioral changes. \"When we kick into self-critical mode, we are actually engaging the portion of our brain that's linked into our fight-flight survival reflex,\" she says. This increases the secretion of cortisol (the \"stress hormone\"), which in turn causes cravings for fatty and sweet foods. Next time you find yourself in critique mode, place your hand on your heart. Just holding it there and taking a few deep breaths can help change your physiological state, silence the negativity, and allow you to look in the mirror and have a fresh experience, she says.\n\n15 of 19 Surround Yourself with Health photopixel/shutterstock Stage your home to reflect the new you, suggests Tara Zimliki, a personal trainer and owner of Tara's Bootcamp. Stock and organize the fridge with healthy, prepped foods in clear containers, present fruit in beautiful bowls on countertops, get a shoe rack to display your sneakers right by the front door, keep the dirty laundry off exercise equipment, etc. Adjusting your environment to reflect your weight loss and healthy lifestyle intentions can make it that much easier to stay on track, she says. (Stuck wondering how to get motivated to lose weight? Just one look at Khloe Kardashian's organized fridge will definitely deliver some serious motivation.)\n\n16 of 19 Turn to Technology fiskes/Shutterstock With more free weight-loss apps available than ever, instant weight-loss healthy living motivation is just a tap away. Whether you can't muster the drive to cook dinner (try a healthy eating app such as BigOven to find recipes based on what's already in your pantry), need a little support (download Fitocracy to team up with a buddy), or you're just looking for a new way to get moving (try Zombies, Run!), there's a great app to help keep your weight-loss motivation mobile.\n\n17 of 19 Recruit Gift Givers progressman/Shutterstock Rewarding yourself with gifts along the way is great in theory but tough in practice — your schedule is already jam-packed! Make it more fun and realistic by getting your friends involved. \"One of the best ideas I ever heard was from a SparkPeople.com member,\" says Nichols. \"She gave several of her friends $20 each to buy her a surprise gift, wrap it and everything. Then for each 10 pounds she lost, she would open one of the gifts purchased by her friends for a really fun and surprising reward along her journey.\"\n\n18 of 19 Set Goals Beyond the Scale solisimages/shutterstock Even if you do everything right, there will be times when the scale won't budge or the weight just doesn't seem to come off as quickly as you hoped. Don't let that discourage you! Measure your progress in other ways, says Nichols. Set goals for fitness — running or swimming farther, sticking to your routine each day or week — and celebrate each of these mini accomplishments, she says. \"Or set goals for healthy eating, such as packing your lunch for work each day or drinking 64 ounces of water a day, and celebrate reaching these goals.\" Celebrating these new milestones is a great way to maintain your weight-loss motivation and stay inspired to stick with your program, even on days (or weeks) when the scale doesn't seem to reflect your progress.", "images": ["https://www.shape.com/thmb/J8b6QLM2bh_lTtGEMcSIIoy2e04=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/fridge-full-of-healthy-foods-as-weight-loss-motivation_0-7ffb2c24b6904c5db9a15caf47b080b3.jpg", "https://www.shape.com/thmb/U1UYCRBlqpfBUfzStGdIilIDS8E=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/gift-giving-incentive-for-weight-loss-motivation-4475899c89b040b5bff9c26341f3972e.jpg", "https://www.shape.com/thmb/JWtLXnv3-kMbIS7Xt2TEFxaOtrw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(664x0:666x2)/GettyImages-1064104264-2000-e1584374171254-d43dfe6dc9924c5aaa99660f6f737161.jpg", "https://www.shape.com/thmb/GEQX8AlKA5H8NeIC81o9c-ANyZw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(859x238:861x240)/Muscle-Building-Workout-Plan-GettyImages-1339018482-2000-8db6490ebaee4270898e0f6590b910fa.jpg", "https://www.shape.com/thmb/Wpp3zw8jMs1g9sOWRL8iLTXZRIk=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(349x0:351x2)/woman-checking-off-calendar-d2cb29023a064d21ac921c1676a647d4.jpg", "https://www.shape.com/thmb/GTTSLGd1VeIXB_Fbi41-vmnbU4k=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/steop-weighing-yourself-for-weight-loss-motivation-d49f5138197e4219b3c1f46822f288a7.jpg", "https://www.shape.com/thmb/nkO5YX0x7aoy4NoCwc3-VOlZ0zs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg", "https://www.shape.com/thmb/pst-4Xx5jDZxQsEL_sZGqaFxAG4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/best-weight-loss-apps-GettyImages-1148661848-1-2000-9c73bc7d16ae4aaa92d950a2824b259d.jpg", "https://www.shape.com/thmb/QRDnVsvdyN_mWbHfWK_B7hmFWoU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/concerning-eating-habits-6c2da07a359e4ea282b6c517e0468b92.jpg", "https://www.shape.com/thmb/i9mOm4KpNxOQ_9r5V53uT0mJDfI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1499x0:1501x2)/SHP_AP_Goals_Recirc_4x5-f4cabac841264299a21e10334f72c4d6.jpg", "https://www.shape.com/thmb/5fUqlGnIR_L-IxOT8esphvWM7vM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-13655464601-7a544c7099124110ab6b31760389865f.jpg", "https://www.shape.com/thmb/N2fw993U3-5PMvBgY-qlqsu1HP4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(748x565:750x567)/Reasons-Why-Youre-Not-Losing-Weight-GettyImages-735932653-2f7d0a7ed3e148a097b6b7ecfd8bd0e7.jpg", "https://www.shape.com/thmb/9aPA9zXMG_5E9JPeKrTnYHRc_b0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-using-smartphone-apps-for-weight-loss-motivation-a7cb58a7d8514693bcbb0f959dbe177e.jpg", "https://www.shape.com/thmb/mteHiS5eEbGYes0SrmA7G0iFPvw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(499x0:501x2)/weight-loss-rules-woman-39ef2108646345bf862e41d5723f291d.jpg", "https://www.shape.com/thmb/xQCjVdIY673aE3AGAHxi2EWN8Z8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-with-business-plan-for-gym-weight-loss-motivation-248d96556ee04cee8335f84d0b2ff589.jpg", "https://www.shape.com/thmb/geG46ELoorQDqH6e8OPt57jRWXI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1278x265:1280x267)/daynightworkout-GettyImages-531694172-551f077864d64a188207d614cbdeec98.jpg", "https://www.shape.com/thmb/QBZAy-EkBOKYAkz5EeEu-1cSais=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/lose-belly-fat-2-weeks-zero-belly-diet-dbc0aabfed104c298583eda2aac118ce.jpg", "https://www.shape.com/thmb/PEuwvYoLTH1nha_jJesGJUd4kgo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-looking-in-mirror-for-weight-loss-motivation-bc6e9f56b4f34c0e987740e909b3dc34.jpg", "https://www.shape.com/thmb/4Tu4JaZBHYSbhAqtECMRmPsURbc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/find-your-why-for-weight-loss-motivation-fdeabfd232584dec92e0671def80b08f.jpg", "https://www.shape.com/thmb/xOtz-UbOqjg34b5orMx82v4dqBg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(655x623:657x625)/Reaching-Goal-Weight-GettyImages-1386177678-62955fa60b674f27aa42a22833943eb0.jpg", "https://www.shape.com/thmb/mkr_aoYGF1zl5noDR_bpyNTnw4I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-carrying-jeans-cleaned-out-closet-8feaa0cc157045bf8bc14aaf068ceca9.jpg", "https://www.shape.com/thmb/aE0fWTNflPAvUI1myMts7GCguEA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(621x0:623x2)/Erica-Lugo-Feature-b1d8dc62f81641ccbbf1004353bec5af.jpg", "https://www.shape.com/thmb/dIpHa0muLE6NOqkFm8iJSorqIPs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/weight-loss-motivation-sq-2000-a953ed1926b94673a1050965be4e684a.jpg", "https://www.shape.com/thmb/d9PPR9H0Pssis6iJS-03k2Nd7y4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-72867951-dd5cd6aef7b44427b467bd5bc430fedf.jpg", "https://www.shape.com/thmb/ZTHrcN4xo58CiEd5ROsKsXDeQms=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-1220404804-2000-1e7195eba92d45849049bd0b46a3dd8c.jpg", "https://www.shape.com/thmb/cYB8kPodKFct1a3MjexSIsSE1DI=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/rock-climbing-2000-0b11f6334fea4be89b899e097cf010f4.jpg", "https://www.shape.com/thmb/1mYdAlY5M8dtelIIovpmIJ_pYKY=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-doing-yoga-savasana-body-appreciation-weight-loss-motivation-c0b1c25847234df4a721cb6fff948582.jpg", "https://www.shape.com/thmb/MTtgktwI-4vtGuvCcmJcevG1UoU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/focus-on-a-feeling-for-weight-loss-success-e5e72fa5c25f4293ad3738bf73021fa3.jpg", "https://www.shape.com/thmb/4gqW_3ggHUn7euyNKdE5zjhg8k4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/5-Tips-to-Finally-Lose-Those-Last-5-Pounds-AdobeStock_304366382-418407245-2000-18edf8127cab4fea8c315fea5b41b96d.jpg", "https://www.shape.com/thmb/C0cj5OEdVO0Az72BKR55Ol5u2CA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-swimming-for-weight-loss-motivation-non-scale-goals-9fd22afdff5f4f8e83f4e25d723e98cd.jpg", "https://www.shape.com/thmb/4HlYM5E_0fBwIiSc1wmkg84ho6Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1582x932:1584x934)/0324230-workout-motivation-lead-9b3ebf91d04a4a2fa965b8d5037a7b5a.jpg", "https://www.shape.com/thmb/VpyjtfFwj8w3Pl8KTF9IqjHv7I8=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/group-selfie-weight-loss-motivation-6b16a6ec588a404f885924ff2e3acde3.jpg", "https://www.shape.com/thmb/5BJhq77cT4VIZJnlcAH8deG92kM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1039x798:1041x800)/10-Science-Backed-Strategies-to-Lose-Fat-and-Keep-It-Off-GettyImages-668066982-2000-51f668a29d19413b966218984ee8ff6f.jpg", "https://www.shape.com/thmb/p66Ta19-w-sQCEc1ufOblhsbdxU=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-meditating-on-self-love-for-weight-loss-motivation-9b9cc9a8de824645b22ff91c4fc27ce4.jpg", "https://www.shape.com/thmb/MQGZ8my6Q6W2lQzjVMbSseA1BEM=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/woman-getting-massage-as-reward-weight-loss-motivation-d81271c90804412d89cf63ea23f17525.jpg", "https://www.shape.com/thmb/_yqUSNRL4eHCtJPBPklzYyIhxXs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/get-competitive-to-help-weight-loss-motivation-547aca4d08604de1aa122e60e05c208d.jpg"], "top_img": "https://www.shape.com/thmb/nkO5YX0x7aoy4NoCwc3-VOlZ0zs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg", "keywords": [], "authors": ["Jessica Smith"], "canonical_link": "https://www.shape.com/weight-loss/tips-plans/22-ways-stay-motivated-lose-weight", "title": "19 Weight-Loss Motivation Tips from Experts", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Wondering how to get motivated and stay motivated to lose weight after you've been at it for a while? Follow these expert tips for finding weight loss motivation.", "emailcontenttype": "LISTSC", "emailvertical": "SHAPE", "sailthru.author": "Jessica Smith", "sailthru.tags": "lifestyle-mind-and-body,weight-loss-management", "parsely-section": "Health and Wellness", "parsely-tags": "Health and Wellness,Fitness,Weight Management,Motivation", "article": {"section": "shape", "author": "https://www.facebook.com/SHAPEmagazine/"}, "fb": {"app_id": 165082593548215, "pages": 10053803772}, "og": {"type": "article", "site_name": "Shape", "url": "https://www.shape.com/weight-loss/tips-plans/22-ways-stay-motivated-lose-weight", "title": "These 19 Weight-Loss Motivation Tips *Actually* Work to Transform Your Mindset", "description": "Wondering how to get motivated and stay motivated to lose weight after you've been at it for a while? Follow these expert tips for finding weight loss motivation.", "image": "https://www.shape.com/thmb/nkO5YX0x7aoy4NoCwc3-VOlZ0zs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg"}, "twitter": {"card": "summary_large_image", "site": "@Shape_Magazine", "title": "These 19 Weight-Loss Motivation Tips *Actually* Work to Transform Your Mindset", "description": "Wondering how to get motivated and stay motivated to lose weight after you've been at it for a while? Follow these expert tips for finding weight loss motivation.", "image": "https://www.shape.com/thmb/QvLfMSC2UOyHPcVS4mIzZuh6dzk=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(1739x503:1741x505)/weight-loss-motivation-fb-2000-7e27e3441e3b4887a166adc59703e192.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.114.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.114.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.114.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.114.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.114.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://www.shape.com", "summary": ""}