{"url": "https://tvline.com/2018/11/11/the-walking-dead-recap-season-9-episode-6-whisperers/", "text": "So this is what life after Rick looks like, huh? Intriguing.\n\nPicking up where “What Comes After” left off, Sunday’s episode of The Walking Dead began fleshing out the five newbies that Judith rescued, made clear that take-no-prisoners Carol was alive and kicking (ass), revealed the legs of a love triangle in the making, unveiled several new hairdos and — at long last! — gave us our first taste of the Whisperers. Was it enough to make you want to come back for seconds? First let’s review the goings-on in “Who Are You Now?” then you can hit the comments with your thoughts on “What the Show Is Now.”\n\n‘I HAVEN’T GIVEN UP, AND I NEVER WILL’ | As the plus-sized installment began, Michonne, sporting a slick, half-shaved new ’do, was having one of those heart-to-hearts with Rick in her head that we all have with our lost loved ones. “I know you’re here,” she said, unaware of how right she was, thanks to Anne. “I’m still here, too. But it hasn’t gotten any easier.” If anything, “the path ahead has only grown darker.” Yet she — everyone — clung to the little things… like a toy cowboy that resembled Rick, like the bird Daryl watched pluck a worm from a walker’s ear to feed its babies, like the flower Carol spotted blooming in concrete. And maybe most importantly, Michonne kept dreaming. From there, we returned to the woods where Rosita, Eugene, Aaron and others were searching frantically for Judith. When they found her with Yumiko, Magna, Connie, Kelly and Luke — and the herd not far behind — Eugene gave us a sense of how much things had changed over the course of the time jump by turning into an impressive walker-killing machine. Despite his heroics, they still had to beat a hasty retreat. Though bringing along the newbies would break mom Michonne’s security protocol, Judith put her little foot down. “If they don’t go,” she declared, “I don’t go.” So back to Alexandria, they all went.\n\n‘THIS IS ALEXANDRIA… THIS IS HOME’ | Once the group reached Alexandria, Judith — definitely her brother’s sister — reassured the strangers that they’d be safe there. “Promise,” she added, taking Magna’s hand. However, once Michonne caught wind of the new arrivals, she didn’t exactly roll out the welcome mat. Though she allowed Yumiko to be taken to the infirmary so that Siddiq could treat her head injury, the rest of the group would have to spend the night in holding before going before the council the following morning for a vote to decide their fate. Come judgment day, the group (except for a recuperating Miko) introduced themselves as follows to the council, which was made up of Gabriel, Michonne, Aaron, Laura, Siddiq, Nora and some guy I swear we’ve never seen: Magna had been a truck-stop waitress who’d become a fighter; Luke had been a music teacher and still considered himself one (since “education never ends, even in the face of monsters and mayhem”); hearing-impaired Connie had been a top-notch journalist who now thought of herself as sister Kelly’s guardian angel; and Kelly had been a high-school kid who, since the rise of the dead, had had to grow up. That all sounded very nice. And the community, Michonne said, wanted to be generous. However… uh-oh.\n\n‘THERE’S A REASON FOR EVERYTHING’ | Michonne then asked to see Magna’s left hand. Turned out, she was sporting a prison tattoo, one that told Michonne she’d done hard time. And it got worse. Though Magna’s group had appeared to lay down their arms before entering Alexandria, Michonne, really living up to her chief-of-security title, called out the ex-con for carrying a concealed weapon (a knife in her belt). Now Gabriel could go ahead and take a vote on the group’s fate, Michonne said, somehow not adding, “The prosecution rests.” Before Michonne stalked out of the assembly, Magna called after her. “Can I ask you a question?” Without breaking her stride, Michonne shot back simply, “No.” Later, we discovered that a) Gabriel had enough radio equipment to start WKRP in Alexandria, and b) he had become romantically involved with Rosita. (WTH? First Anne, now Rosita — the preacher gets more action than Daryl!) The couple were convinced they could reach more lovable newcomers like Magna’s pals if only their signal could be boosted by a remote amplifier. Though they knew Michonne would object, and in a big way, Rosita still elected to go out a ways and install the amplifier — with, as her accomplice and technical adviser, a smitten Eugene!\n\n‘THIS WORLD COULD USE A FEW MORE DREAMERS’ | Meanwhile, in the Kingdom, Carol, her hair now long and white, marveled at the state of the community. “Is there any part of this place that’s not falling apart?” she asked Jerry (rhetorically). “Our loyalty to you, my queen,” he replied, jovial as ever and delighting in teasing her as the wife of the king and mother of prince Henry. Speaking of whom, the resourceful, now-older boy was quick to fix a busted pipe on the boiler (?) that nearly overheated disastrously. But he was well aware that a Band-Aid was no longterm solution. “Dad,” he griped to Ezekiel, “we’re holding things together with plastic and tape.” They needed better tools and someone who really knew how to use them. That someone could be Henry — if the king would allow him to go study under Earl at the Hilltop. Unfortunately, Ezekiel didn’t want him trained so much as “I want him safe.” Besides, the big fair that he hoped would reunite the communities was just around the corner. Oh, and another thing. “Hilltop feels so distant,” he added. And it had ever since they’d lost the glue that had held together the communities (Rick). Still, Carol was very much in favor of them loosening the reins on Henry, at least enough to let him become a cleverer engineer.\n\n‘HEY THERE, BOSS LADY’ | Next thing we knew, Carol was escorting her son to the Hilltop… but taking the scenic route (even Henry could tell that they’d missed their turnoff). Shortly, they heard a woman screaming for help, and without a second thought, off ran Henry… straight into a trap set by Regina, Jed and the remains of the Saviors. Since the Sanctuary had fallen, the baddies were in dire straits. So they’d be taking all of the goodies that Carol and Henry had been bringing to the Hilltop. (Being as vile as they are, let’s be real — they’d have taken the goodies regardless!) At least, since Carol had once spared Jed, he’d leave them with a pulse. Oh, but he did want her sparkly engagement ring. Ezekiel’s missus readily handed it over, but Henry couldn’t bear to see it on Jed’s finger, and attacked. To no avail, mind you. But he tried. “I meant to tell ya,” Jed cracked to Carol before departing, “I really like what you’ve done to your hair.” That night, after Henry expressed his shock that his mom just gave in like that, she stole away secretly and surrounded the sleeping Saviors with gas. Jed woke up at the last second and, terrified, swore she’d never see them again. “I know,” she replied, setting the lot of ’em on fire! The following day, Henry apologized for his harsh words toward Carol and learned where their detour was taking them: to pick up Daryl. “Need a ride, stranger?” she asked.\n\n‘IT DOESN’T MATTER IF YOU’RE A GOOD OR BAD PERSON ON THE INSIDE, THE NUMBERS DON’T CARE’ | Back in Alexandria, Judith did her homework within earshot of Negan, his spirits much raised since last we saw him. But he wasn’t interested in helping her with theoretical math problems about two planes traveling toward one another, he wanted to help with something real. When Judith told him that a real problem was the fact that her mom was going to make the newcomers leave, he related the story of how, as a boy, he used to drive his mom crazy by bringing home stray dogs all the time, till one of them, which had seemed as sweet as the rest, had killed all of his other rescues. After that, he didn’t bring home any more, he concluded. He wised up. “Yeah,” retorted Judith, a definite contender for TV’s cutest, most precocious kid, “and look how great everything turned out for you.” That night, as Magna was scolded by her friends for rocking the vote against them, she argued that she’d only kept the knife because “I wanted us to have options.” As Luke noted, at that very moment, she was wearing yet another option: Yumiko’s knife-concealing necklace! Though leaving likely meant that they would soon perish, “if that’s our fate,” Connie argued, “so be it.” They weren’t going to do battle with a community that had kids in it.\n\n‘YOU’LL UNDERSTAND SOMEDAY’ | Unwilling to let go of the idea of Alexandria as a safe haven, Magna snuck away, knife in hand, and watched from the window outside Michonne’s house… as her and Rick’s son R.J. toddled into his mom’s arms! After seeing that, no way could Magna go through with whatever plot she had hatched. Instead, she knocked on the door, handed over the knife and told Michonne that she’d missed one. What’s more, she understood. “If I had all this,” Magna admitted, “I wouldn’t trust me, either.” When Michonne turned around, there was Judith, sitting on the stairs with the pistol her dad had left for her to protect her loved ones. When Michonne noted that she was supposed to be protecting Judith, not the other way around, the little girl suggested that her dad would have wanted her to save Magna & Co. “He would’ve been proud,” Michonne couldn’t deny. “Your brother, too.” Then why wouldn’t Michonne help him? wondered Judith, adding that she knew her mom sometimes spoke to Rick and Carl. Judith was starting to forget their voices, so “I hope you can still hear them.” Clearly, that did the trick, because the next day, when the newbies were supposed to be shown the door, Michonne rode up and told them that, while Alexandria couldn’t take them, she’d escort them to the Hilltop, whose leader might allow them to take up residence.\n\nThe Walking Dead Season 9 Photos View Gallery 271 Images\n\n‘I CANNOT KEEP ON KEEPING ON’ | Finally, while installing Rosita and Gabriel’s amplifier at a height that was as scary as any zombie, Eugene spotted the herd whose tracks he and Ro had seen earlier headed straight for them. Considering that the tracks had been pointed in the opposite direction before, the herd, the brainiac reasoned, “must’ve flipped a hardcore U on the DL.” (Sound like any villains we’ve been eagerly anticipating?) Unfortunately — or extra unfortunately — Eugene busted his knee hurrying down to the ground, and while hobbling from the walkers with Rosita, feared he wasn’t going to make it. As such, “there’s something I’ve been working up the testicular gravitas to tell you,” he began to say. “Don’t make this weird!” she snapped. Rather than hear out his confession of love, she urged him onward, and to elude the herd, they buried themselves as deeply as they could in muck. Then, as the herd passed on the path just above them, it happened: For the first time, we — as well as Eugene and Rosita — heard the walkers, speaking softly enough for their voices to resemble the low moans of a zombie. “They must be close… Don’t let them get away.”\n\nSo, your reaction to the Whisperers’ mini-introduction? The new crew? Everyone’s new looks? And am I crazy, or was Eugene kinda… hot? Hit the comments.", "images": ["https://secure.gravatar.com/avatar/45e7bb898c1c2072c21b4dcc6adf82f4?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/a79405aea5dd10a36e268318418da6ec?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b3bfef676d90210f657fad8dd133f8ce?s=32&d=blank&r=pg", "https://www.indiewire.com/wp-content/uploads/2023/09/aad1ccc3303d9d96b30732b05541d7ff.png?resize=232,175", "https://tvline.com/wp-content/uploads/2018/11/the-walking-dead-season-9-episode-6-carol-henry.png?w=300", "https://tvline.com/wp-content/uploads/2018/08/twd_916_gp_1109_0119_rt-1.jpg?w=620&h=418&crop=1", "https://secure.gravatar.com/avatar/db9b00b43b530edd4dd15c788b3c19f1?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/the-walking-dead-the-ones-who-live-andrew-lincoln.jpg?w=620&h=420&crop=1", "https://secure.gravatar.com/avatar/b7f62f647ca257ca45c3d664b59e2929?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg", "https://tvline.com/wp-content/uploads/2023/11/Found-Sir-Mark-Paul-Gosselaar-.jpg?w=1240&h=840&crop=1", "https://secure.gravatar.com/avatar/0f5a7360ec499f2b71ec4e1c5aea762a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/5c5bfe017c9b865c262207ea95645cb2?s=32&d=blank&r=pg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://tvline.com/wp-content/uploads/2018/11/the-walking-dead-season-9-episode-6-danai-gurira.png?w=300", "https://secure.gravatar.com/avatar/ceb935724c049cf661055aa898bfda58?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/596438a4d060d6158575caa88b8d72aa?s=32&d=blank&r=pg", "https://www.sportico.com/wp-content/uploads/2023/11/GettyImages-1777281369-e1701289656546.jpg?resize=232,175", "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0705_0250_rt.jpg?w=300", "https://tvline.com/wp-content/uploads/2023/11/the-voice-lila-forde.jpg?w=621&h=420&crop=1", "https://tvline.com/wp-content/uploads/2018/11/the-walking-dead-season-9-episode-6-khary-payton-henry.png?w=300", "https://secure.gravatar.com/avatar/138cdeafcb5cd8dc075d89a1904194a8?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/ncis-sydney-episode-3-recap.jpg?w=620&h=422&crop=1", "https://secure.gravatar.com/avatar/267d57813a740e624cff900a34a191f0?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/2174cb55e9468b969f8352d5ce4b8f38?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/the-voice-kara-tenae.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2018/08/twd_906_gp_0629_0225_rt.jpg?w=300", "https://secure.gravatar.com/avatar/51e49fc644270cb6f8877e1880f28a91?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0ce44568dc82a8ca21d1c773f6a23670?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/94b67fbdb62edea32863ed40c5367f9c?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/8f63320876c042a83bf3e726dff78903?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/9bbe0255dee2e83f1ef3b89942068f49?s=32&d=blank&r=pg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://secure.gravatar.com/avatar/93040b997dd7d1d22792c30b6ec23bbf?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/dfd2585310242a36d39b48f6f762e83b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/c14ffc2b9e50d032700272718f59f774?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/9f24b2535e99db148349fb17ff1c1d27?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/fbc18e7ed1aac2901bc19153eeb9bd14?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/7ac62172e2a783f8aa6ffd12bdc1c565?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/cd32afa7e4f246d159456aa1436c7aea?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/2e14c98f4acecff2facd486f032b32dc?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/29f5910cbab81d66a9d2ecc5aab7401d?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/2b490e381056e086ff81c64729a0dd99?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/yellowstone-season-2-episode-8-kevin-costner-jpg.jpg?w=621&h=420&crop=1", "https://secure.gravatar.com/avatar/20fd3921bf3c226c6049d254020aef33?s=32&d=blank&r=pg", "https://spy.com/wp-content/uploads/2023/10/sdfgve.png?resize=232,175", "https://deadline.com/wp-content/uploads/2023/11/GettyImages-1768680938.jpg?resize=232,175", "https://tvline.com/wp-content/uploads/2023/11/yellowstone-207-jamie-beth.jpg?w=620&h=420&crop=1", "https://secure.gravatar.com/avatar/e91d060bc5596b844e106b7e52a28a7e?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg?w=618&h=420&crop=1", "https://secure.gravatar.com/avatar/385944c9f3afaa07b546e1ee17dfd010?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/11/the-walking-dead-season-9-episode-6-danai-gurira-seth-gilliam.png?w=300", "https://tvline.com/wp-content/uploads/2023/11/FTWD_811_SJ_0222_1657-RT.jpg?w=618&h=420&crop=1", "https://secure.gravatar.com/avatar/27669c13b9437c3c43bb8d8924ed7176?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/11/screen-shot-2018-11-06-at-1-49-36-pm.png?w=300", "https://secure.gravatar.com/avatar/1525bb1ecefd9e34c4dfad52792161d4?s=32&d=blank&r=pg", "https://variety.com/wp-content/uploads/2023/11/Elon-Musk.jpg?resize=232,175", "https://secure.gravatar.com/avatar/113f74a29e73b6bc484fb07a80dc9344?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0467e2d0ea6b6df9f69394af494111b7?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/f8008abfa86ca225b2c8ea96a4203509?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/5346e30301ec761aa4ba278694edca2a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/c8468ca8e52c462538cc036afb82187d?s=32&d=blank&r=pg"], "top_img": "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg", "keywords": [], "authors": ["Charlie Mason"], "canonical_link": "https://tvline.com/recaps/the-walking-dead-recap-season-9-episode-6-whisperers-998558/", "title": "Walking Dead Recap: Flash-Forward to New Characters, New Couples and (Finally!) the Arrival of the Whisperers", "meta_data": {"description": "'The Walking Dead' recap: Season 9, Episode 6 reveals who's coupled up after the time jump and how we first meet the Whisperers.", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.2.3", "author": "Charlie Mason", "content_type": "Article", "post_id": 998558, "title": "<i>Walking Dead</i> Recap: Flash-Forward to New Characters, New Couples and (Finally!) the Arrival of the Whisperers", "published_at": "2018-11-11 19:19:09", "image": "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg?w=300", "comment_count": 68, "tags": "The Walking Dead", "topics": "Recaps", "body": "So this is what life after Rick looks like, huh? Intriguing.\r\nPicking up where \"What Comes After\" left off, Sunday's episode of The Walking Dead began fleshing out the five newbies that Judith rescued, made clear that take-no-prisoners Carol was alive and kicking (ass), revealed the legs of a love triangle in the making, unveiled several new hairdos and — at long last! — gave us our first taste of the Whisperers. Was it enough to make you want to come back for seconds? First let's review the goings-on in \"Who Are You Now?\" then you can hit the comments with your thoughts on \"What the Show Is Now.\"\r\n'I HAVEN'T GIVEN UP, AND I NEVER WILL' | As the plus-sized installment began, Michonne, sporting a slick, half-shaved new ’do, was having one of those heart-to-hearts with Rick in her head that we all have with our lost loved ones. \"I know you're here,\" she said, unaware of how right she was, thanks to Anne. \"I'm still here, too. But it hasn't gotten any easier.\" If anything, \"the path ahead has only grown darker.\" Yet she — everyone — clung to the little things… like a toy cowboy that resembled Rick, like the bird Daryl watched pluck a worm from a walker's ear to feed its babies, like the flower Carol spotted blooming in concrete. And maybe most importantly, Michonne kept dreaming. From there, we returned to the woods where Rosita, Eugene, Aaron and others were searching frantically for Judith. When they found her with Yumiko, Magna, Connie, Kelly and Luke — and the herd not far behind — Eugene gave us a sense of how much things had changed over the course of the time jump by turning into an impressive walker-killing machine. Despite his heroics, they still had to beat a hasty retreat. Though bringing along the newbies would break mom Michonne's security protocol, Judith put her little foot down. \"If they don't go,\" she declared, \"I don't go.\" So back to Alexandria, they all went.\r\n'THIS IS ALEXANDRIA… THIS IS HOME' | Once the group reached Alexandria, Judith — definitely her brother's sister — reassured the strangers that they'd be safe there. \"Promise,\" she added, taking Magna's hand. However, once Michonne caught wind of the new arrivals, she didn't exactly roll out the welcome mat. Though she allowed Yumiko to be taken to the infirmary so that Siddiq could treat her head injury, the rest of the group would have to spend the night in holding before going before the council the following morning for a vote to decide their fate. Come judgment day, the group (except for a recuperating Miko) introduced themselves as follows to the council, which was made up of Gabriel, Michonne, Aaron, Laura, Siddiq, Nora and some guy I swear we've never seen: Magna had been a truck-stop waitress who'd become a fighter; Luke had been a music teacher and still considered himself one (since \"education never ends, even in the face of monsters and mayhem\"); hearing-impaired Connie had been a top-notch journalist who now thought of herself as sister Kelly's guardian angel; and Kelly had been a high-school kid who, since the rise of the dead, had had to grow up. That all sounded very nice. And the community, Michonne said, wanted to be generous. However… uh-oh.\r\n'THERE'S A REASON FOR EVERYTHING' | Michonne then asked to see Magna's left hand. Turned out, she was sporting a prison tattoo, one that told Michonne she'd done hard time. And it got worse. Though Magna's group had appeared to lay down their arms before entering Alexandria, Michonne, really living up to her chief-of-security title, called out the ex-con for carrying a concealed weapon (a knife in her belt). Now Gabriel could go ahead and take a vote on the group's fate, Michonne said, somehow not adding, \"The prosecution rests.\" Before Michonne stalked out of the assembly, Magna called after her. \"Can I ask you a question?\" Without breaking her stride, Michonne shot back simply, \"No.\" Later, we discovered that a) Gabriel had enough radio equipment to start WKRP in Alexandria, and b) he had become romantically involved with Rosita. (WTH? First Anne, now Rosita — the preacher gets more action than Daryl!) The couple were convinced they could reach more lovable newcomers like Magna's pals if only their signal could be boosted by a remote amplifier. Though they knew Michonne would object, and in a big way, Rosita still elected to go out a ways and install the amplifier — with, as her accomplice and technical adviser, a smitten Eugene!\r\n'THIS WORLD COULD USE A FEW MORE DREAMERS' | Meanwhile, in the Kingdom, Carol, her hair now long and white, marveled at the state of the community. \"Is there any part of this place that's not falling apart?\" she asked Jerry (rhetorically). \"Our loyalty to you, my queen,\" he replied, jovial as ever and delighting in teasing her as the wife of the king and mother of prince Henry. Speaking of whom, the resourceful, now-older boy was quick to fix a busted pipe on the boiler (?) that nearly overheated disastrously. But he was well aware that a Band-Aid was no longterm solution. \"Dad,\" he griped to Ezekiel, \"we're holding things together with plastic and tape.\" They needed better tools and someone who really knew how to use them. That someone could be Henry — if the king would allow him to go study under Earl at the Hilltop. Unfortunately, Ezekiel didn't want him trained so much as \"I want him safe.\" Besides, the big fair that he hoped would reunite the communities was just around the corner. Oh, and another thing. \"Hilltop feels so distant,\" he added. And it had ever since they'd lost the glue that had held together the communities (Rick). Still, Carol was very much in favor of them loosening the reins on Henry, at least enough to let him become a cleverer engineer.\r\n'HEY THERE, BOSS LADY' | Next thing we knew, Carol was escorting her son to the Hilltop… but taking the scenic route (even Henry could tell that they'd missed their turnoff). Shortly, they heard a woman screaming for help, and without a second thought, off ran Henry… straight into a trap set by Regina, Jed and the remains of the Saviors. Since the Sanctuary had fallen, the baddies were in dire straits. So they'd be taking all of the goodies that Carol and Henry had been bringing to the Hilltop. (Being as vile as they are, let's be real — they'd have taken the goodies regardless!) At least, since Carol had once spared Jed, he'd leave them with a pulse. Oh, but he did want her sparkly engagement ring. Ezekiel's missus readily handed it over, but Henry couldn't bear to see it on Jed's finger, and attacked. To no avail, mind you. But he tried. \"I meant to tell ya,\" Jed cracked to Carol before departing, \"I really like what you've done to your hair.\" That night, after Henry expressed his shock that his mom just gave in like that, she stole away secretly and surrounded the sleeping Saviors with gas. Jed woke up at the last second and, terrified, swore she'd never see them again. \"I know,\" she replied, setting the lot of ’em on fire! The following day, Henry apologized for his harsh words toward Carol and learned where their detour was taking them: to pick up Daryl. \"Need a ride, stranger?\" she asked.\r\n'IT DOESN'T MATTER IF YOU'RE A GOOD OR BAD PERSON ON THE INSIDE, THE NUMBERS DON'T CARE' | Back in Alexandria, Judith did her homework within earshot of Negan, his spirits much raised since last we saw him. But he wasn't interested in helping her with theoretical math problems about two planes traveling toward one another, he wanted to help with something real. When Judith told him that a real problem was the fact that her mom was going to make the newcomers leave, he related the story of how, as a boy, he used to drive his mom crazy by bringing home stray dogs all the time, till one of them, which had seemed as sweet as the rest, had killed all of his other rescues. After that, he didn't bring home any more, he concluded. He wised up. \"Yeah,\" retorted Judith, a definite contender for TV's cutest, most precocious kid, \"and look how great everything turned out for you.\" That night, as Magna was scolded by her friends for rocking the vote against them, she argued that she'd only kept the knife because \"I wanted us to have options.\" As Luke noted, at that very moment, she was wearing yet another option: Yumiko's knife-concealing necklace! Though leaving likely meant that they would soon perish, \"if that's our fate,\" Connie argued, \"so be it.\" They weren't going to do battle with a community that had kids in it.\r\n'YOU'LL UNDERSTAND SOMEDAY' | Unwilling to let go of the idea of Alexandria as a safe haven, Magna snuck away, knife in hand, and watched from the window outside Michonne's house… as her and Rick's son R.J. toddled into his mom's arms! After seeing that, no way could Magna go through with whatever plot she had hatched. Instead, she knocked on the door, handed over the knife and told Michonne that she'd missed one. What's more, she understood. \"If I had all this,\" Magna admitted, \"I wouldn't trust me, either.\" When Michonne turned around, there was Judith, sitting on the stairs with the pistol her dad had left for her to protect her loved ones. When Michonne noted that she was supposed to be protecting Judith, not the other way around, the little girl suggested that her dad would have wanted her to save Magna & Co. \"He would've been proud,\" Michonne couldn't deny. \"Your brother, too.\" Then why wouldn't Michonne help him? wondered Judith, adding that she knew her mom sometimes spoke to Rick and Carl. Judith was starting to forget their voices, so \"I hope you can still hear them.\" Clearly, that did the trick, because the next day, when the newbies were supposed to be shown the door, Michonne rode up and told them that, while Alexandria couldn't take them, she'd escort them to the Hilltop, whose leader might allow them to take up residence.\r\n\r\n'I CANNOT KEEP ON KEEPING ON' | Finally, while installing Rosita and Gabriel's amplifier at a height that was as scary as any zombie, Eugene spotted the herd whose tracks he and Ro had seen earlier headed straight for them. Considering that the tracks had been pointed in the opposite direction before, the herd, the brainiac reasoned, \"must've flipped a hardcore U on the DL.\" (Sound like any villains we've been eagerly anticipating?) Unfortunately — or extra unfortunately — Eugene busted his knee hurrying down to the ground, and while hobbling from the walkers with Rosita, feared he wasn't going to make it. As such, \"there's something I've been working up the testicular gravitas to tell you,\" he began to say. \"Don't make this weird!\" she snapped. Rather than hear out his confession of love, she urged him onward, and to elude the herd, they buried themselves as deeply as they could in muck. Then, as the herd passed on the path just above them, it happened: For the first time, we — as well as Eugene and Rosita — heard the walkers, speaking softly enough for their voices to resemble the low moans of a zombie. \"They must be close… Don't let them get away.\"\r\nSo, your reaction to the Whisperers' mini-introduction? The new crew? Everyone's new looks? And am I crazy, or was Eugene kinda… hot? Hit the comments.", "og": {"type": "article", "title": "Walking Dead Recap: Flash-Forward to New Characters, New Couples and (Finally!) the Arrival of the Whisperers", "url": "https://tvline.com/recaps/the-walking-dead-recap-season-9-episode-6-whisperers-998558/", "description": "So this is what life after Rick looks like, huh? Intriguing. Picking up where “What Comes After” left off, Sunday’s episode of The Walking Dead began", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg", "width": 618, "height": 420, "alt": "the walking dead season 9 episode 6 recap whisperers"}, "locale": "en_US"}, "article": {"published_time": "2018-11-12T03:19:09+00:00", "modified_time": "2018-11-12T03:49:25+00:00"}, "twitter": {"site": "@TVLine", "card": "summary_large_image", "title": "Walking Dead Recap: Flash-Forward to New Characters, New Couples and (Finally!) the Arrival of the Whisperers", "description": "'The Walking Dead' recap: Season 9, Episode 6 reveals who's coupled up after the time jump and how we first meet the Whisperers.", "image": "https://tvline.com/wp-content/uploads/2018/11/twd_906_gp_0702_0285_rt.jpg?w=618"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1541887200.0, "source": "https://tvline.com", "summary": ""}