{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/brian-austin-green-net-worth/", "text": "Info Category: Richest Celebrities › Actors Net Worth: $8 Million Date of Birth: Jul 15, 1973 (50 years old) Place of Birth: Van Nuys Gender: Male Height: 6 ft (1.83 m) Profession: Actor, Rapper, Television producer Nationality: United States of America 💰 Compare Brian Austin Green's Net Worth\n\nWhat is Brian Austin Green's Net Worth and Salary?\n\nBrian Austin Green is an American actor who has a net worth of $8 million. Brian Austin Green is most widely recognized for his role as the baby-faced character, David Silver, on the hit 1990's series, \"Beverly Hills, 90210\". Post-\"90210\", he has appeared in various and sundry television films, and has had a fairly successful television career, appearing in supporting or recurring roles on such shows as \"Freddie\", \"Terminator: The Sarah Connor Chronicles\", \"CSI: Miami\", \"Desperate Housewives\", \"Smallville\", and \"Anger Management\". While many people enjoy watching his work on television, he is most envied for being the man who managed to snag actress/model Megan Fox.\n\nEarly Life\n\nBrian Green was born on July 15th of 1973 in Los Angeles County, California. Brian is the son of George Green, a country musician. After attending high school in North Hollywood, Brian Green studied at the Hamilton High School Academy of Music. When he became an actor, Brian Green added the middle name \"Austin\" in order to set himself apart from another performer with the exact same name.\n\nCareer\n\nAt the age of 13, Brian Austin Green booked his first major role on the soap opera Knots Landing. He spent three years on the show until 1989, and during this period he also found time to appear on shows like Good Morning, Miss Bliss.\n\nIn 1990, Green's breakthrough came with a leading role in Beverly Hills 90210. Cast as David Silver, Brian Austin Green was elevated to widespread fame. This newfound exposure also helped him win guest roles on shows like Growing Pains, Melrose Place, Saved by the Bell, Biker Mice from Mars, Sabrina, the Teenage Witch, and many others during the 90s.\n\nAfter Beverly Hills 90210 wrapped in 2000, Brian Austin Green won a minor role in Ressurection Blvd. He then met his future wife Megan Fox on the set of Hope & Faith. Further guest-starring roles came with shows like Freddie, The Twilight Zone, Las Vegas, CSI: Crime Scene Investigation, and George Lopez.\n\nBrian Austin Green then experienced something of a resurgence after joining the cast of Terminator: The Sarah Connor Chronicles. Although he began with a recurring role, he was promoted to series regular before the show was ultimately canceled at the end of its second season. Over the next period, Brian Austin Green guest-starred on CSI: Miami and appeared on Saturday Night Live.\n\nIn 2009, he appeared in a three-episode arc on Smallville as the villain Metallo. He then enjoyed another multi-episode arc in Desperate Housewives before making a guest appearance in the sitcom Anger Management. The role was well-received, and Green was promoted to series regular in 2013. Over the next period, Green appeared in shows such as Happy Endings and Wedding Band.\n\nRelationships\n\nFrom 1992 to 1998, Green dated actress Tiffani Thiesson, who also appeared on Beverly Hills 90210. In 1999, he started dating Vanessa Marcil, another Beverly Hills 90210 cast member. They later had a son and became engaged, but ended their relationship in 2003.\n\nIn 2004, Green started dating actress Megan Fox. Although they became engaged in 2006, they called it off in 2009. Just one year later, they reaffirmed their plans to marry and were wed in Hawaii soon afterward. However, they divorced in 2015. In 2016, the couple proved that their relationship still had tons of twists and turns left, and they got back together. In 2020, they announced their separation once again. Over the course of their relationship, they have had three children together.\n\nReal Estate\n\nIn 2009, Fox and Green bought a home in the Los Feliz neighborhood of Los Angeles for $2.95 million. They sold this house in 2014 for $3.75 million. As part of their decoupling process in 2016, Brian and Megan began selling some of their real estate assets. They sold one Los Angeles home for $2.6 million and another for $1.299 million.\n\nLater in 2016 when they had reconciled, Megan and Brian spent $3.3 million on a new 2-acre property in Malibu. The seller was Brad Pitt's manager Cynthia Pett-Dante (wife of comedic actor Peter Dante). In 2018, Megan sued Cynthia for $5 million, alleging the seller failed to disclose a serious mold problem in the house.", "images": ["https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2020/04/Megan-Fox.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2009/12/Tiffani-Amber-Thiessen.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/09/Megan-Mullally.jpg", "https://vz.cnwimg.com/thumb-400x400/wp-content/uploads/2010/03/Brian-Austin-Green.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/wp-content/uploads/2010/03/Brian-Austin-Green.jpg?x81397", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2011/12/peter-dante.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Brian-Austin-Green.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/brian-austin-green-net-worth/", "title": "Brian Austin Green Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Brian Austin Green Net Worth and Salary: Brian Austin Green is an American actor who has a net worth of $8 million. Brian Green is probably best known for", "slick": {"wpversion": "1.4.0", "wppostid": 5548, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Brian-Austin-Green.jpg?x81397", "group": "post", "category": "actors:Actors;richest-celebrities:Richest Celebrities"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Brian Austin Green Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/brian-austin-green-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Brian-Austin-Green.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Brian Austin Green's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-11-15T00:39:59+00:00", "published_time": "2020-07-03T18:24:35+00:00", "section": "Actors", "tag": "megan fox net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/03/Brian-Austin-Green.jpg?x81397", "title": "Brian Austin Green Net Worth", "description": "Brian Austin Green Net Worth and Salary: Brian Austin Green is an American actor who has a net worth of $8 million. Brian Green is probably best known for"}}, "movies": [], "publish_date": 1593800675.0, "source": "https://www.celebritynetworth.com", "summary": ""}