{"url": "https://ew.com/tv/2018/03/21/x-files-finale-chris-carter-interview/", "text": "Is this the end of The X-Files? And if so, who's really dead? And who's not? What's the story with that pregnancy shock? Below The X-Files creator Chris Carter takes our burning questions about the season 11 finale in the wake of speculation about the show's future and star Gillian Anderson's declaration that she's finished playing Dana Scully. WARNING: Spoilers ahead!\n\nENTERTAINMENT WEEKLY: Okay, first: Walter Skinner. Just seeing his limp foot isn't very conclusive—at least, in terms of TV rules. So are we to assume he might not really be dead?\n\nCHRIS CARTER: It certainly begs many questions. If you pay close attention to that sequence, did he dive under that car or was he run down? He's motionless, but a lot could be drawn from that as the Cigarette Smoking Man never checked if he was done.\n\nSpeaking of which: Cigarette Smoking Man. Surely you'll commit to him being dead at last … right?\n\n[Chuckles] You know, he rejuvenated somehow to come back last season. Scully's visions of his showed him with some kind of special power of rejuvenation. You wonder as he was pushed off into that water if he may not be dead. There's this title we posted instead of The Truth is Out There this time, which is \"Salvator Mundi\" [seemingly referring to a painting of Christ by Leonardo Da Vinci], and that had many edges to that sword. One being William being somewhat Christ-like, his resurrection. Mulder saving the world by killing his father. And the Cigarette Smoking Man—a savior in his own mind because he was going to start the planet anew.\n\nAnd Monica? C'mon, you have to at least give me Monica.\n\nShe's obviously got a wound that looks fatal. But once again, no one stopped to take her pulse.\n\nChris! You don't like creative permanence, do you? All right, so does Skinner ever tell Scully that the Smoking Man is William's \"father,\" or does she just figure that out intuitively, or based on her visions?\n\nYou know, she has intuition as we've set up, but he actually tells her in the car, except it's done where we go into Scully's head. We see him all but say the Cigarette Smoking Man is William's father.\n\nCan you talk about making the decision to have Scully pregnant again, creatively speaking?\n\nMulder and Scully, there was a lot of foundation for this building to that moment, when they have that pillow talk in episode 3 about the future and old age and having more children. It was set up early on, you can see now, that this moment was coming.\n\nSo are we to assume that the father of Scully's new baby is definitely Mulder?\n\nYes. But we also have to remember that Scully has alien DNA so there are questions atop that certainty.\n\nGillian has said she's done with the show. You've said, \"Not so fast.\" What would the show look like if Fox ordered another season without her?\n\nI honestly don't know right now. There's so much that's up in the air right now with Fox's sale to Disney, and with Gillian's announcement—which I respect—and with more X-Files stories to be told…right now it's anyone's guess.\n\nDo you have any sense of the timing for figuring that out at this point?\n\nYou know, it's funny. The episode airs tonight and it's the end of a year of my life devoted to this. I'm happy not to think about it for a little bit.\n\nThe finale feels like a potential ending, certainly a relatively happy one for Mulder and Scully. If there's never another X-Files episode, would you be okay with that?\n\nI know there's more life in this show, whether it's—they're doing a really interesting X-Files narrative game right now—while it would never be the same without Gillian, as I was saying I do think there are more stories to be told. If this was the last episode, would I be happy? I don't know. There are so many questions that this begs now. I'm standing with them on the end of that pier and thinking about the impossibility of it and the impossibility of not knowing what the future holds for them.\n\nA few more random questions: There was also a motif in the background this season, including in this finale: The \"Have You Seen This Man?\" dream man. I'm curious if that was just for fun or if there was a message behind it?\n\nWe were all interested in that Internet meme and we decided he was going with us this season. He's a perfect X-Files character. He was on the drum kit in episode 3, and on the billboard as you clearly noticed in the finale. I think he made every episode this season.\n\nHow would you have worked in Doggett if Robert Patrick had returned?\n\nI put him in the plot of My Struggle 3. He, unfortunately, wasn't available. I had to reconceive that story using the character of Mulder's half-brother—who was going to be in the episode anyway—and he stepped in where Doggett was going to step in.\n\nWhat was Monica's endgame, ultimately?\n\nIt was to protect Mulder and Scully at all costs, and while she was in the league with the devil she had ulterior motives.\n\nOne of your episodes this season—episode 7—was compared by some to Netflix's Black Mirror. Do you have an opinion on that show as it occupies a similar space as yours?\n\nWhen I think about coming back to network television with The X-Files after being so long off the air, how much television had changed, considering the first episode of Black Mirror was a man having sex with a pig, we were in a new television realm. It certainly affects the way we think of the show and television generally.\n\nMulder seems a bit pessimistic about modern-day America this season. Do you feel the same way?\n\n[Long pause]. I do. I try to fight my cynicism every day. I think we now live in this mode of such sensationalism. I think it's driven certainly by this political moment, but I think it's driven more by this media moment and the Internet. And it's really hard for me to imagine ever going back.", "images": ["https://ew.com/thmb/IKruLrAxY8HSZtbvKAieg75qpus=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc82-86-sh_1356_hires2-2000-440f3cd1267847a49393a9402c122a6e.jpg", "https://ew.com/thmb/fQRYgjlw2-StUjX_ygfytmFY9C4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/david_l-6-eac76a329e434b0d95d9a6226b5688aa.jpg", "https://ew.com/thmb/iR5jHW_p84F7_khHyTu7bxlGpJc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/x-files-1-945414b0f14b466188af27a45c1636f1.jpg", "https://ew.com/thmb/3sQLf3VH4P5e2_DkLZy9CRaBFp8=/75x75/filters:no_upscale():max_bytes(150000):strip_icc()/james-hibberd-image-25aebda8e43d444688728ae95407a4cc.png", "https://ew.com/thmb/ACHozEK_N0ltcPLj4L0tD1tpq84=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-x-files_0-6c88e4c4649e45dfa7e91a49b42f5f38.jpg", "https://ew.com/thmb/-5sWoSmtLNgWTZzVgLHkR1VgHrs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc44pt-sh_1623_hires2-2000-85b57b077a7f4855b0fa89844063bcf1.jpg", "https://ew.com/thmb/DaBiBkcanjWf4U4N8zMLYanZcxw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/000265866hr-2000-d8712ebe68134703af6d73c7062f8fa9.jpg", "https://ew.com/thmb/DZaa3Nebf5KvNrgwkiu8ExpuJjA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/x-files-finale_0-1-e599665645a04b298cb9ccdb8cfe8d5d.jpg", "https://ew.com/thmb/FJNOEeF83SZ1A8DohS3NQEk2g4g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/x-files-update-d967494093844b9bba074cb82140eee7.jpg", "https://ew.com/thmb/ovweZLZXPegMPrsDnctxHM6hEqU=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/Pilot-X-Files-110422-390aee415b604f07862e0870e496295c.jpg", "https://ew.com/thmb/9JWLSUcZsYHzGES0ayvOh2-3CF8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_201-sc17-rf_0001_r_hires2-2000-5651b2f846ff485e89260a642ff675fe.jpg", "https://ew.com/thmb/TpHMmL29yCpIZMECwPkTKtWKmE8=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/x-files-05-8daedb440efc498b92178baebf7227e7.jpg", "https://ew.com/thmb/DHR9Fd4NTJhCcbr25MyUcTRXiBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc44pt-sh_1684_hires2-2000-fb1ccdab76ff41649a7500c2d86871af.jpg", "https://ew.com/thmb/OMsVwbFTQgZ8AOgzvTIdHRwWKAY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/placeholderimage-e2715228ea5b42a5ab6fead459dbcd35.jpg", "https://ew.com/thmb/X9Ky5jJieOM6Gxjc9x1mpYVtgd0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/gettyimages-859058680-2000-7c218d2b480f4b30be7c49181a094eed.jpg", "https://ew.com/thmb/-UwA30gLy-bQbOy2zztb5KBLgSA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/X-Files-0e6bb76d7a234ed7bb077d15e9643400.jpg", "https://ew.com/thmb/DoHfdBKI4GxfnbGC6L0iSObHZ20=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/x-files_0-ba79868445004a498d761d49b94a7a72.jpg", "https://ew.com/thmb/_JrqMw2Zr5BbOM4j-pE8rL3qDmI=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-x-files-1-fb4310ebbafe4261bf505c61f3615097.jpg"], "top_img": "https://ew.com/thmb/DHR9Fd4NTJhCcbr25MyUcTRXiBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc44pt-sh_1684_hires2-2000-fb1ccdab76ff41649a7500c2d86871af.jpg", "keywords": [], "authors": ["Ew'S Editorial Guidelines"], "canonical_link": "https://ew.com/tv/2018/03/21/x-files-finale-chris-carter-interview/", "title": "The X-Files finale: Chris Carter explains that shock ending", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Who's really dead? Who's not? 'X-Files' creator Chris Carter is interviewed about events in season 11 finale -- which could be the show's final episode", "parsely-section": "TV", "parsely-tags": "Celebrity,People,TV,Chris Carter,The X-Files", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "fb": {"app_id": 2485718348341688}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/tv/2018/03/21/x-files-finale-chris-carter-interview/", "title": "'The X-Files' finale: Chris Carter explains that shock ending", "description": "Who's really dead? Who's not? 'X-Files' creator Chris Carter is interviewed about events in season 11 finale -- which could be the show's final episode", "image": "https://ew.com/thmb/DHR9Fd4NTJhCcbr25MyUcTRXiBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc44pt-sh_1684_hires2-2000-fb1ccdab76ff41649a7500c2d86871af.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "'The X-Files' finale: Chris Carter explains that shock ending", "description": "Who's really dead? Who's not? 'X-Files' creator Chris Carter is interviewed about events in season 11 finale -- which could be the show's final episode", "image": "https://ew.com/thmb/DHR9Fd4NTJhCcbr25MyUcTRXiBs=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/xf-s2_210-sc44pt-sh_1684_hires2-2000-fb1ccdab76ff41649a7500c2d86871af.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.18.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.18.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.18.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.18.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.18.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": 1521583200.0, "source": "https://ew.com", "summary": ""}