{"url": "https://tvline.com/2013/02/14/scandal-season-2-spoilers-tony-goldwyn-fitz-olivia-time-jump/", "text": "If you think it’s hard watching Scandal‘s Olivia Pope get the hook, try being the guy breaking the fierce fixer’s heart.\n\nWhen last we tuned into the sophomore ABC drama, President Fitzgerald Grant (played by Tony Goldwyn) was dealt two blows — first with the discovery that his road to the White House took a very sketchy detour. But in tandem with that, he realized that the love of his life was among the election-rigging scheme team.\n\nOh, and also during that very bad day he ushered a frail Supreme Court Justice to her death, to boot.\n\nTVLine spoke with POTUS’ portrayer about his first (and difficult) reading of that dynamics-changing script, the “devastating” actions of she whom Fitz had put on “the highest pedestal,” and the Season 2 scene that has surprised him the most.\n\nRELATED | Scandal Post Mortem: Shonda Rhimes Defends Killer Twist and Fitz’s Shocking Decision\n\nTVLINE | We’re coming off quite an episode. What do you think raced through Fitz’s head when Verna revealed to him the truth about the election rigging?\n\nIt was, I think, a three-part reaction. Maybe four parts. First, it was complete shock at what she was saying to him, because at first he thought she was in her delirium. When he does realize what she’s saying, the realization that Olivia was involved is absolutely crushing for him because, you know… he “gets” Mellie. And he’s not terribly shocked that Cyrus is an opportunist, even though he’s deeply hurt and disappointed. But Olivia is someone who Fitz had put on a pedestal — the highest pedestal, really. She is someone he came to rely on as a reflection of the best part of himself or the man that he aspired to be, which was the antithesis of his father. So her having betrayed him in that way invalidates everything for him and confirms his worst fears, in a sense, about himself. If she is corrupt, then everything loses all meaning. And that’s absolutely devastating.\n\nTVLINE | And the way Verna drove the dagger in a bit further, with the comment about his father….\n\nWhen Verna says, “I owed it to your father” to tell you the truth… That’s a moment where he, for me, was first saying, “[My father] wins. He was right about me,” and I think the bottom falls out of his life. And when I walk to the [hospital room] door, in that moment I think he has the opposite reaction. He sort of feels, “I’m not going to let [my father] win. He’s not going to beat me. I made a commitment to be something, to do this job right. And this was not my decision to steal [the election].” I think he believes he could have won it, maybe, and he’s not going to let Verna, this sort of surrogate for his father, take him down — so he makes this insane decision to kill her.\n\nTVLINE | Actors, of course, can be very protective of their characters. What was your reaction when you heard for the first time that Fitz would end Verna’s life?\n\nWe got this script very late; I don’t think any of us got it before the table read. So when we sat down to read it out loud together and I got to the scene that precedes that — at Verna’s funeral, when Olivia comes up to me and says, “I will wait for you Fitz. I’ll wait as long as you need,” and I turn to her and say, “Oh yeah, about that; I changed my mind” — I was completely shocked. I literally couldn’t speak the words. I couldn’t figure out where that came from because [it preceded the flashback to Verna’s reveal]. As far as I knew, the last time I spoke to Liv, I said, “Wait for me,” and suddenly coming out of my mouth are these words that are the antithesis of what I’ve felt. I somehow forced the words out and [series creator] Shonda [Rhimes] looked at me and mouthed, “It’s going to be OK, don’t worry.” And then the scene came up, the scene with Verna that followed, and I realized, “Oh my God, I’m going to kill her.” I was shocked by that, but I was less shocked than I was by my reversal with Liv. I couldn’t process that. I had, like, a literal and physical reaction.\n\nTVLINE | I wanted to ask about that funeral scene. Up until then, every scene between you and Kerry Washington was either simmering or boiling over. Was it kind of odd for you two to do your first scene where it was just ice cold?\n\nBecause I didn’t understand what was informing it, reading it was really bizarre. But actually doing it wasn’t so hard for me because I had the context of how much her betrayal meant to me. Kerry would have a very different perspective on this, but for me, at that moment, Fitz feels that’s he’s been completely used by her, that everything he attributed to her was phony and she was no different from the rest of them and all of her protestations of loving him and blaming him and being a victim of him, and the Sally Hemmings business, was all bulls–t. That she really wanted him president because she wanted to trade on that power. I suddenly saw her as the worst kind of political opportunist who, sure, in one sense, can say she was in love with me, but she wasn’t in love with me. She was using me. Remember that scene where we touch the Constitution and I say, “It’s everything” and she says, “It’s everything. It’s a new world”? To connect in terms of our political ideals was so profound for him, and to have that betrayed was the worst thing that could possibly happen.\n\nVIDEO | Scandal Sneak Peek: Fitz Gives [Spoiler] the Big Chill, David Deals With a Bloody Mess\n\nTVLINE | Adding to the bittersweetness of the funeral scene was the look Olivia was giving Fitz as she said, “I’ll wait for you.” Her eyes were like saucers and so full of hope. She had this new outlook on a future she had thought impossible just a few scenes prior.\n\nI know. And she’d always been the opposite. I’d always been the one fighting for her and she was pushing me away constantly, so to all of a sudden have that switched…. It’s brilliantly written. In a way, it’s so easy to play because the writing was so good. And now I’m fascinated to see where this is going to go, because I don’t know — how do they reconnect?\n\nTVLINE | Meanwhile, where do things stand with Mellie and Fitz in this Thursday’s episode, picking up 10 months later?\n\nYou know, it’s not good. You’ll see this week. It ain’t good. He said, “You’re all I’ve got…. You’re the only one who has always been honest about who you are,” and I think that he credits her with that. They try to make it work. They do try, but it’s very, very difficult and I think that sends Fitz into a real tailspin. He’s very depressed, so it’s not going to be easy with Mellie.\n\nTVLINE | The one confrontation we didn’t see was with Cyrus. How are things between the president and his chief of staff?\n\nFitz boxes Cyrus out. This is never explained, but for me, he has to keep Cyrus close because he can’t fire him, because he knows too much. If Cyrus were to turn against him, that would be very bad, so he has to control Cyrus. Fitz is in a very tough place right now.\n\nTVLINE | Out of Season 2 to date, which scene or moment has surprised you the most?\n\nThe one I mentioned [above]. That scene in the church when I tell Olivia I’ve changed my mind, and I say that mean thing to her about how sleeping with my mistress is one thing, but marrying her is another. That really shocked me.\n\nTVLINE | Your next TV directing gig is with Scandal, right?\n\nI’m going to be directing Scandal next month. At the moment, it’s supposed to be Episode 20. That’s not in stone, but I think it’s going to be 20.\n\nWant more scoop on Scandal, or for any other show? Email mattmtvguy@gmail.com and your question may be answered via Matt’s Inside Line.", "images": ["https://tvline.com/wp-content/uploads/2023/11/hannah-waddingham-home-for-christmas-1.jpg?w=1240&h=840&crop=1", "https://secure.gravatar.com/avatar/988335e1ca0acf0bbf869b3d9053ca5f?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0c2dbd2b0b3fafe0104b107a6c557d0d?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/d647bc91d8499ff55faf0796ecfbfd65?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2013/02/scandal_0214_goldwyn.jpg", "https://secure.gravatar.com/avatar/191bb2caf86bafa940c9e4617469ea5b?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2014/05/matt_mitovich_final_v3.jpg?w=300&h=300&crop=1", "https://secure.gravatar.com/avatar/40c3074fb2d95888fa98058a09cf67ca?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/d2cf067902ae43ba6e0a70cb895f51a1?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/552f89ec8fe89998dbc72629de585ff4?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/686f687c321aaf1ab86ff49dbf34ce2c?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0d8bfd8435331289c7f11812eecc36bc?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/560058ea085386f035b9914b48c5b1ae?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg?w=300", "https://secure.gravatar.com/avatar/a88e6450120cc8e3c025b35aa92d05e4?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/fargo-season-5-jon-hamm.jpg?w=1239&h=840&crop=1", "https://secure.gravatar.com/avatar/f83fed70cfd039da38915c0306054e91?s=32&d=blank&r=pg", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://secure.gravatar.com/avatar/03bc8d1f90765cefb37b4eb86f8924a2?s=32&d=blank&r=pg", "https://variety.com/wp-content/uploads/2023/11/GettyImages-1201005823.jpg?resize=232,175", "https://www.indiewire.com/wp-content/uploads/2017/06/team-america-world-police.jpg?resize=232,175", "https://secure.gravatar.com/avatar/e317211a226cfcc4c6e8273abfd502e8?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/570beb225fd050b05bc84349b25632f6?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/470639cee1530fb72e02728dd5c68850?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b9c9b0863d9980e649201e8f0a6fa31b?s=32&d=blank&r=pg", "https://www.sportico.com/wp-content/uploads/2023/11/GettyImages-1777281369-e1701289656546.jpg?resize=232,175", "https://secure.gravatar.com/avatar/4f960a7b7f8ae4af9d989658d8acdb1b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b7bc3c8c5a9ad73b9d315c020096fafb?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/e17c24055bd935cdbe9deede1427a118?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/cf7dce7a69121584f3559fe781b2e62a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/3a1c8034ef4a5d7499ee820c4fa4e102?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/833c05d30007e90287b43a7c716650a0?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/07e1e0a39cc292834effc1eac06751c0?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/db0dbed1f60b4b0601a8325c5167acd4?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/5c830433873357ec77b2f3f7705bc063?s=32&d=blank&r=pg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://tvline.com/wp-content/uploads/2013/02/scandal_fitzverna.jpg?w=300", "https://tvline.com/wp-content/uploads/2023/11/loki-renewed-cancelled-season-3.jpg?w=1240&h=840&crop=1", "https://secure.gravatar.com/avatar/a56054c204932aa6aea4f8afadd719dc?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/f9927c4277e8f41fc160465da6563916?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/lawmen-bass-reeves-lauren-e-banks-interview-jennie-rodeo.jpg?w=2191&h=1540&crop=1", "https://tvline.com/wp-content/uploads/2023/11/survivor-kendra-exit-interview.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2023/11/Lessons-in-chemistry-finale.jpg?w=1240&h=840&crop=1", "https://secure.gravatar.com/avatar/f1dd61639e3a5c23e6a732f50c3cad65?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/a5cde3e1ae9aa0b0afa92736c950999f?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_fellie.jpg", "https://secure.gravatar.com/avatar/3eb6efca3245f8e23a2cffd523549c61?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/d90fc0f5c8d64a2c38be36e06777fe5e?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b989f13569b929b18a9da0d87a3f6e5a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/1e17796deed0f3469bf60827a25cf163?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/f9e08f6aa1ad32907f32604d7fb4047a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/f491c482a39d8fd5c9ce25baff42c7ec?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg?w=514&h=360&crop=1", "https://secure.gravatar.com/avatar/f5ceed366771ac0d1387ae8560e02ef1?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/ae38ccebd22fdd3062015cf696eff778?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg", "https://spy.com/wp-content/uploads/2023/10/sdfgve.png?resize=232,175", "https://secure.gravatar.com/avatar/44b4b94e2819dcf05930e88fce938cf2?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/03b4b01968b6c89a20ceacee093e1a98?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b3c45753d4ad1771e4aad19b0c152ff6?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/de3fe6a1d20ab34a2e338be8c8e7bc99?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b65c61982d65b4fb1c912c2c3488c099?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/db2e24562a4e6040156c205778e93614?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/c762dfc85b50ad601a5ef8934c85342c?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/428b0970ff803746486745e39bdc4444?s=32&d=blank&r=pg", "https://deadline.com/wp-content/uploads/2023/11/AP23334043176558.jpg?resize=232,175", "https://secure.gravatar.com/avatar/879a8cb8b61d511e66ea3cbdf7fb632b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/3943438d9f761971bfa03830cc3cbbda?s=32&d=blank&r=pg"], "top_img": "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg", "keywords": [], "authors": ["Matt Webb Mitovich"], "canonical_link": "https://tvline.com/interviews/scandal-season-2-spoilers-tony-goldwyn-fitz-olivia-time-jump-406844/", "title": "‘Scandal’ Season 2 Spoilers – Tony Goldwyn on Fitz", "meta_data": {"description": "If you think it's hard watching Scandal's Olivia Pope get the hook, try being the guy breaking the fierce fixer's heart. When last we tuned into the sophomore ABC drama, President Fitzgerald Grant (played by Tony Goldwyn) was dealt two blows -- first with the discovery that his road to the White ...", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.2.3", "author": "Matt Webb Mitovich", "content_type": "Article", "post_id": 406844, "title": "Tony Goldwyn Discusses <I>Scandal'</i>s Heartbreaking Twist: 'I Literally Couldn't Speak the Words'", "published_at": "2013-02-14 05:30:09", "image": "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg?w=300", "comment_count": 89, "tags": "Tony Goldwyn", "topics": "Previews", "body": "If you think it's hard watching Scandal's Olivia Pope get the hook, try being the guy breaking the fierce fixer's heart.\r\n\r\nWhen last we tuned into the sophomore ABC drama, President Fitzgerald Grant (played by Tony Goldwyn) was dealt two blows -- first with the discovery that his road to the White House took a very sketchy detour. But in tandem with that, he realized that the love of his life was among the election-rigging scheme team.\r\n\r\nOh, and also during that very bad day he ushered a frail Supreme Court Justice to her death, to boot.\r\n\r\nTVLine spoke with POTUS' portrayer about his first (and difficult) reading of that dynamics-changing script, the \"devastating\" actions of she whom Fitz had put on \"the highest pedestal,\" and the Season 2 scene that has surprised him the most.\r\n\r\nRELATED | Scandal Post Mortem: Shonda Rhimes Defends Killer Twist and Fitz’s Shocking Decision\r\n\r\nTVLINE | We're coming off quite an episode. What do you think raced through Fitz’s head when Verna revealed to him the truth about the election rigging?\r\nIt was, I think, a three-part reaction. Maybe four parts. First, it was complete shock at what she was saying to him, because at first he thought she was in her delirium. When he does realize what she’s saying, the realization that Olivia was involved is absolutely crushing for him because, you know… he \"gets\" Mellie. And he’s not terribly shocked that Cyrus is an opportunist, even though he’s deeply hurt and disappointed. But Olivia is someone who Fitz had put on a pedestal -- the highest pedestal, really. She is someone he came to rely on as a reflection of the best part of himself or the man that he aspired to be, which was the antithesis of his father. So her having betrayed him in that way invalidates everything for him and confirms his worst fears, in a sense, about himself. If she is corrupt, then everything loses all meaning. And that’s absolutely devastating.\r\n\r\nTVLINE | And the way Verna drove the dagger in a bit further, with the comment about his father….\r\nWhen Verna says, \"I owed it to your father\" to tell you the truth… That’s a moment where he, for me, was first saying, \"[My father] wins. He was right about me,\" and I think the bottom falls out of his life. And when I walk to the [hospital room] door, in that moment I think he has the opposite reaction. He sort of feels, \"I’m not going to let [my father] win. He’s not going to beat me. I made a commitment to be something, to do this job right. And this was not my decision to steal [the election].\" I think he believes he could have won it, maybe, and he’s not going to let Verna, this sort of surrogate for his father, take him down -- so he makes this insane decision to kill her.\r\n\r\nTVLINE | Actors, of course, can be very protective of their characters. What was your reaction when you heard for the first time that Fitz would end Verna's life?\r\nWe got this script very late; I don’t think any of us got it before the table read. So when we sat down to read it out loud together and I got to the scene that precedes that -- at Verna’s funeral, when Olivia comes up to me and says, \"I will wait for you Fitz. I’ll wait as long as you need,” and I turn to her and say, “Oh yeah, about that; I changed my mind” -- I was completely shocked. I literally couldn’t speak the words. I couldn’t figure out where that came from because [it preceded the flashback to Verna's reveal]. As far as I knew, the last time I spoke to Liv, I said, “Wait for me,\" and suddenly coming out of my mouth are these words that are the antithesis of what I’ve felt. I somehow forced the words out and [series creator] Shonda [Rhimes] looked at me and mouthed, “It’s going to be OK, don’t worry.” And then the scene came up, the scene with Verna that followed, and I realized, “Oh my God, I’m going to kill her.” I was shocked by that, but I was less shocked than I was by my reversal with Liv. I couldn’t process that. I had, like, a literal and physical reaction.\r\n\r\nTVLINE | I wanted to ask about that funeral scene. Up until then, every scene between you and Kerry Washington was either simmering or boiling over. Was it kind of odd for you two to do your first scene where it was just ice cold?\r\nBecause I didn’t understand what was informing it, reading it was really bizarre. But actually doing it wasn’t so hard for me because I had the context of how much her betrayal meant to me. Kerry would have a very different perspective on this, but for me, at that moment, Fitz feels that’s he’s been completely used by her, that everything he attributed to her was phony and she was no different from the rest of them and all of her protestations of loving him and blaming him and being a victim of him, and the Sally Hemmings business, was all bulls--t. That she really wanted him president because she wanted to trade on that power. I suddenly saw her as the worst kind of political opportunist who, sure, in one sense, can say she was in love with me, but she wasn’t in love with me. She was using me. Remember that scene where we touch the Constitution and I say, \"It’s everything\" and she says, \"It’s everything. It’s a new world\"? To connect in terms of our political ideals was so profound for him, and to have that betrayed was the worst thing that could possibly happen.\r\n\r\nVIDEO | Scandal Sneak Peek: Fitz Gives [Spoiler] the Big Chill, David Deals With a Bloody Mess\r\n\r\nTVLINE | Adding to the bittersweetness of the funeral scene was the look Olivia was giving Fitz as she said, \"I'll wait for you.\" Her eyes were like saucers and so full of hope. She had this new outlook on a future she had thought impossible just a few scenes prior.\r\nI know. And she’d always been the opposite. I’d always been the one fighting for her and she was pushing me away constantly, so to all of a sudden have that switched…. It’s brilliantly written. In a way, it's so easy to play because the writing was so good. And now I’m fascinated to see where this is going to go, because I don’t know -- how do they reconnect?\r\n\r\nTVLINE | Meanwhile, where do things stand with Mellie and Fitz in this Thursday's episode, picking up 10 months later?\r\nYou know, it’s not good. You’ll see this week. It ain’t good. He said, “You’re all I’ve got…. You’re the only one who has always been honest about who you are,” and I think that he credits her with that. They try to make it work. They do try, but it’s very, very difficult and I think that sends Fitz into a real tailspin. He's very depressed, so it’s not going to be easy with Mellie.\r\n\r\nTVLINE | The one confrontation we didn’t see was with Cyrus. How are things between the president and his chief of staff?\r\nFitz boxes Cyrus out. This is never explained, but for me, he has to keep Cyrus close because he can’t fire him, because he knows too much. If Cyrus were to turn against him, that would be very bad, so he has to control Cyrus. Fitz is in a very tough place right now.\r\n\r\nTVLINE | Out of Season 2 to date, which scene or moment has surprised you the most?\r\nThe one I mentioned [above]. That scene in the church when I tell Olivia I’ve changed my mind, and I say that mean thing to her about how sleeping with my mistress is one thing, but marrying her is another. That really shocked me.\r\n\r\nTVLINE | Your next TV directing gig is with Scandal, right?\r\nI’m going to be directing Scandal next month. At the moment, it’s supposed to be Episode 20. That’s not in stone, but I think it’s going to be 20.\r\n\r\nWant more scoop on Scandal, or for any other show? Email mattmtvguy@gmail.com and your question may be answered via Matt's Inside Line.", "og": {"type": "article", "title": "Tony Goldwyn Discusses Scandal’s Heartbreaking Twist: ‘I Literally Couldn’t Speak the Words’", "url": "https://tvline.com/interviews/scandal-season-2-spoilers-tony-goldwyn-fitz-olivia-time-jump-406844/", "description": "If you think it’s hard watching Scandal’s Olivia Pope get the hook, try being the guy breaking the fierce fixer’s heart. When last we tuned into the sophomore ABC drama, President…", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg", "width": 514, "height": 360}, "locale": "en_US"}, "article": {"published_time": "2013-02-14T13:30:09+00:00", "modified_time": "2013-02-14T17:24:12+00:00"}, "twitter": {"site": "@TVLine", "creator": "@MattMitovich", "card": "summary_large_image", "title": "Tony Goldwyn Discusses Scandal’s Heartbreaking Twist: ‘I Literally Couldn’t Speak the Words’", "description": "If you think it’s hard watching Scandal’s Olivia Pope get the hook, try being the guy breaking the fierce fixer’s heart. When last we tuned into the sophomore ABC drama, President…", "image": "https://tvline.com/wp-content/uploads/2013/02/scandal_0207_olitz_dw.jpg?w=514"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1360792800.0, "source": "https://tvline.com", "summary": ""}