{"url": "https://www.celebritynetworth.com/richest-businessmen/paul-nassif-net-worth/", "text": "Info Category: Richest Business Net Worth: $40 Million Place of Birth: Los Angeles Gender: Male Profession: Plastic Surgeon Nationality: United States of America 💰 Compare Paul Nassif's Net Worth\n\nWhat is Dr. Paul Nassif's net worth?\n\nPaul Nassif is a plastic surgeon who has a net worth of $40 million. Paul Nassif earned his first fortune as one of the most in-demand rhinoplasty surgeon's in California. Paul is known as a skilled facial plastic and reconstructive surgeon. He became widely-famous thanks to appearances on reality shows such as \"Dr. 90210,\" and \"The Real Housewives of Beverly Hills.\" His ex-wife, Adrienne Maloof, was at one time a cast member on \"Real Housewives.\"\n\nEarly Life\n\nPaul S. Nassif, MD was born in Los Angeles, California on June 6, 1962. He is Lebanese-American. Nassif went to Loyola High School in Los Angeles and then went on to attend the University of Southern California. He graduated in 1974. Nassif attended Rosalind Franklin University of Medicine and Science/Chicago Medical School for his first two years of his medical education. He graduated from the University of Southern California School of Medicine in 1992, which he attended for the last two years of his general medical education.\n\nSurgeon's License\n\nNassif interned in general surgery residency at the University of New Mexico Health Sciences Center. He then had a residency in an otolaryngology head and neck surgery at the University of New Mexico from 1993 to 1997. In 1998, Dr. Nassif completed a facial plastic and reconstructive surgery fellowship at St. Louis University School of Medicine in 1998.\n\nHe is licensed in both California and Nevada and practices facial plastic surgery, specifically rhinoplasty, in Beverly Hills, and also has patients from all over the world. Nassif is a member of the American Society for Aesthetic Plastic Surgery.\n\nReality TV\n\nDr. Nassif is best known for featuring on the E! series \"Botched,\" which focuses on reversing bad plastic surgery. The plastic surgery themed show premiered in June 2014 and has aired for six seasons. Dr. Nassif also appeared in the first three seasons of \"The Real Housewives of Beverly Hills\" alongside his now ex-wife Adrienne Maloof, who was a main cast member. In October 2015, it was announced that an eight episode spin off series of \"Botched\" called \"Botched by Nature\" would air. The show premiered on August 9, 2016. He has been featured on Dr. 90210 and has appeared on NBC Nightly News, Inside Edition, CBS Healthbeat, Entertainment Tonight, the Today Show, Good Morning America, and EXTRA.\n\nOther Ventures\n\nNassif also teaches at the University of Southern California and the University of California, Los Angeles schools of medicine. Nassif has his own skincare line out, Nassif MD Dermaceutical. The skincare line focuses on anti-aging and skin rejuvenation.\n\nPersonal Life\n\nNassif married businesswoman Adrienne Maloof on May 2, 2002. The couple has three sons together. Nassif filed for separation from Adrienne in July 2012 after allegations of domestic violence against him. Their divorce was finalized on November 8, 2012. Nassif married medical assistant Brittany Pattakos in September 2019. In June 2020, they announced they were expecting their first child together.\n\nReal Estate\n\nIn 2015, Dr. Nassif paid $4.9 million for property in LA's Bel-Air neighborhood. He proceeded to construct a 12,000 square-foot luxurious mansion. Nassif listed this home for sale in July 2022 for $30 million. He ultimately sold it for $20.4 million in June 2023. The sale was an auction, so after fees Paul's take was around $18.5 million. Here are two videos of Paul's mansion, one posted by Paul himself in October 2022, and the second posted by the auction house that ultimately handled the sale:\n\nA month before listing the Bel-Air mansion Nassif paid $14 million for a home in Dana Point, California.", "images": ["https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2020/05/terry-dubrow.png", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/02/brent.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thumb-400x400/wp-content/uploads/2010/11/GettyImages-468384478.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2020/05/hd.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/06/Garth-Fisher.jpg", "https://vz.cnwimg.com/wp-content/uploads/2010/11/GettyImages-468384478.jpg?x81397", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/11/GettyImages-468384478.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-businessmen/paul-nassif-net-worth/", "title": "Paul Nassif Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Dr. Paul Nassif net worth: Paul Nassif is a plastic surgeon who has a net worth of $40 million. Paul Nassif has earned his net worth from his specialty in rhinoplasty.", "slick": {"wpversion": "1.4.0", "wppostid": 12492, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/GettyImages-468384478.jpg?x81397", "group": "post", "category": "richest-businessmen:Richest Business"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Paul Nassif Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-businessmen/paul-nassif-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/GettyImages-468384478.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Paul Nassif's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-06-15T15:50:47+00:00", "published_time": "2020-09-29T00:34:00+00:00", "section": "Richest Business", "tag": "richest doctors"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/11/GettyImages-468384478.jpg?x81397", "title": "Paul Nassif Net Worth", "description": "Dr. Paul Nassif net worth: Paul Nassif is a plastic surgeon who has a net worth of $40 million. Paul Nassif has earned his net worth from his specialty in rhinoplasty."}}, "movies": [], "publish_date": 1601339640.0, "source": "https://www.celebritynetworth.com", "summary": ""}