{"url": "https://tvline.com/2018/02/26/the-voice-season-14-premiere-recap-kelly-clarkson-block/", "text": "Weird, isn’t it? As played out as the shoe-throwing had gotten by the end of The Voice last season, I actually thought I’d miss it when I tuned in to Monday’s Season 14 premiere. (Hey, I acknowledged that it was weird!) But nah, the episode zipped along, energized by the return of Alicia Keys and the addition of not only new coach Kelly Clarkson (funny as hell) but also the Block (a feature that allows coaches to prevent a rival from nabbing one and only one contestant).\n\nAs for the Blind Auditions, they were good — some quite good — but there were none that made me say, as the coaches love to, this person could win. Among them, I didn’t hear the next Chris Blue (whose edgy, artful “Blue Blood Blues” I’ve become obsessed with). In fact, only one of this first batch of hopefuls even earned an A- from me. In the interest of being a tougher grader, I’m trying this season to keep in mind that, as in TVLine’s polls, A = awesome, and it’s not a hateful dis to say that a vocalist was merely very good — in other words, a B. (If I ever do what Kelly recommended to deal with Blake Shelton and Adam Levine’s squabbling and watch with a glass of wine, I’m sure that determination will go out the window.)\n\nNow then, let’s review the singers, shall we? You can see what I thought of them below, then vote for your favorite in the poll that follows this recap and hit the comments with your own critiques.\n\nBritton Buchanan (Team Alicia), “Trouble” — Grade: B | Were The Voice a charm competition, this 17-year-old “’90s Matt Damon” lookalike would be an early frontrunner. (He describes his hometown as being small enough that everybody knows of each other but doesn’t know each other, and insists he’s never been to a party.) Even though it isn’t a charm competition, Britton still sounds like a safe bet to make it to the Top 12, his deep, bluesy voice bringing to mind Jonny Lang and inspiring Blake to use his Block on Adam. Not a perfect performance but memorable and, perhaps more importantly, promising.\n\nBrynn Cartelli (Team Kelly), “Beneath Your Beautiful” — Grade: A- | Though this Kelly fan is just 14, Adam suggested that she sounded “like a 36-year-old who’s been through it.” Which I think he only meant to mean she sounded mature. I thought what she sounded was stunning. She sang with a vulnerability that really drew me in — how can a vocal be so solid and fragile at the same time? — and as the song crescendoed, inviting her to go big, she RSVP’d yes without losing any of her vocal control. If this wasn’t just a terrific one-off audition but a sign of Brynn’s innate polish, she could develop into this season’s Addison Agen.\n\nRayshun LaMarr (Team Adam), “Don’t Stop Believing” — Grade: C | It feels lousy to give a C to a lymphoma cancer survivor who sang the Journey number that helped buoy him during his treatment, buuut… Although the 33-year-old from Fort Washington, Md., has a humongous voice that he’s able to mix gravel into when he wants to — and he clearly can give a great performance — he veered into cheesiness on the chorus and never really came back out. Unless he wants to go the way of Jon Mero, his coach might want to advise him to rein that in going forward.\n\nKyla Jade (Team Blake), “See Saw” — Grade: B | By the time this 30-year-old JHud backup singer had finished her Aretha Franklin cover, it was obvious that she didn’t belong behind anyone — there was star power in that mammoth voice of hers (and the divalicious look didn’t hurt, either!). But the strange thing about her performance was, it didn’t really take off — or move Blake and Kelly to swivel their chairs — till she started hitting her runs toward the end. So maybe the lesson here is, “If you’ve got it, flaunt it — and sooner than later!”?\n\nKelsea Johnson (Team Alicia), “Like I’m Gonna Lose You” — Grade: B+ | Odd observation: Kyla’s pitch-perfect performance was probably technically superior to Kelsea’s, yet Kelsea’s, full of raw passion from the word go, was more exciting, which I suspect bodes better for her moving forward in the competition. It also doesn’t hurt that, at their sweetest, the 21-year-old knockout’s vocals are so rich, you could stir ’em into your coffee like creamer. If she can control her powerful voice — or if she has more control over it than this first impression gave — there’s no reason why she shouldn’t make it to the Top 12.\n\nDrew Cole (Team Adam), “Sex and Candy ” — Grade: B | “I did not move to Los Angeles to be a bartender,” said this 25-year-old before his performance. Which is ironic, because his voice is pretty intoxicating. It’s distinct, unusual, twangy like a guitar rather than twangy like a country singer. And he works his way up and down from his eyebrow-raising falsetto with the kind of finesse that one hopes for from foreplay. If he keeps it up, he won’t for much longer be best known as the viral-video guitar player whose strumming put a smile on the face of a golden retriever.\n\nD.R. King (Team Kelly), “Believer” — Grade: C+ | Maybe it was nerves. Maybe it was an issue of breath control. Maybe it was a harder song than D.R. (“not to be confused with the reverend”) realized. But for whatever reason, he sounded as winded on the verses as I do when I’ve sprinted to the kitchen during a commercial break that’s turned out to be shorter than I expected. He redeemed himself on the choruses, singing with a power that had to have shaken the lights overhead. However, the unevenness of this performance suggests that he won’t survive the Battles.\n\nKaleb Lee (Team Blake), “Never Wanted Nothing More” — Grade: B- | For most of the Floridian’s fine but not exceptional Kenny Chesney cover, I kept wanting to rewind and rewatch him singing “You Are My Sunshine” with his son in his pre-performance introduction. It was the producers’ usual cheap ploy to get us attached to the contestant, but in this case, it was so cute that it worked. (Am I going softer in my old age?) At least, as the number progressed and Kaleb went bigger and raspier, he began to seem less like a nice guy on karaoke night and more like possibly this season’s Adam Cunningham. And that last note… dang!\n\nJustin Kilgore (Team Kelly), “Tomorrow” — Grade: B+ | This wannabe Steve Grand earned a four-chair turn — and inspired Alicia to block Blake — with a voice as rich as ice cream and a twang that sounded as authentic as a dirt road. And if I hadn’t already been loving Kelly on the panel — side note: I already was — her hard sell to get him on her team would have done the trick 10 times over. She quoted Elf to shut down Adam (“You sit on a throne of lies!”) and, hearing a noise in the auditorium, deadpanned to Justin, “That was the Lord saying, ‘Pick Kelly!’ That was Jesus Christ Himself.” Hi. Lar. I. Ous.\n\nSo, what did you think of the premiere? Coach Kelly? The contestants? Vote in the polls below, then hit the comments.", "images": ["https://secure.gravatar.com/avatar/1dbc7a048a6f8d49c60bf284ec696584?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/6e0a4e638eea50c3b7ab0d1e212a7249?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/12a0f91689d0a0f63ef4db19b2649d84?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/35217587bedc603b1d3a6c920983e598?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/1013bc3b10f55013d15d4ed78e88691a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/4e55d680efa23953d5ff7dc9b96acfdf?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/02/britton.png?w=300", "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2023/11/reyka-season-2-release-date-usa.jpg?w=620&h=420&crop=1", "https://tvline.com/wp-content/uploads/2023/11/cowboy-christmas-romance-lifetime.jpg?w=1240&h=840&crop=1", "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg", "https://tvline.com/wp-content/uploads/2023/11/survivor-45-1.jpg?w=620&h=420&crop=1", "https://pixel.quantserve.com/pixel?a.1=&a.2=p-31f3D02tYU8zY", "https://deadline.com/wp-content/uploads/2023/11/kissinger-getty.jpeg?resize=232,175", "https://secure.gravatar.com/avatar/41086ccb7e3fb6d586f5e13a76e0c26a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/d2f9182e433d0d646bc5b19307501248?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/4c732e6cf83ef3d58eedbadb4ef3fcfe?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0a2e75d583a51a5f0b77b8aecd243e78?s=32&d=blank&r=pg", "https://www.indiewire.com/wp-content/uploads/2017/06/team-america-world-police.jpg?resize=232,175", "https://secure.gravatar.com/avatar/a524d70c077bb76fbc6f81b1655b1f85?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b7470e717bdb3fdda704a3a69b9cba43?s=32&d=blank&r=pg", "https://www.sportico.com/wp-content/uploads/2023/11/GettyImages-1777281369-e1701289656546.jpg?resize=232,175", "https://secure.gravatar.com/avatar/b798be7d02f60865ee4c02f9158a557d?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/b9495b6e94f98064755f8784e6748b36?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/6ab5c50bbe9fa7108d1356cd9f509719?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/7a3938dc5b65cb8c8f110f0bce103493?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/0bed0b8b3aff88233cf5b04d56cdb3a9?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/6f7add74d861eb03b7a825ef6bd326cd?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/612b17235a23cb6ee52ed34342ad511b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/08ea84d8ab803888169cb83510ca7b44?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/90d4f75201ea3f46b730d26b3df9952f?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/3775e7d17a85c63d27b8d6356aaf506a?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/f246477b6ee555c1f7a08db50f1e1213?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/152cfa52923e8d661feaf9985059b459?s=32&d=blank&r=pg", "https://sb.scorecardresearch.com/p?c1=2&c2=6035310&c3=&c4=&c5=&c6=&c15=&cv=2.0&cj=1", "https://secure.gravatar.com/avatar/0949b23ede113cf52993c4fb2656ee8b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/ccc4053611df4221b7af206f090767e1?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/8acd51dfe73797baf46c93f55c1c5ba7?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/02/kyla.png?w=300", "https://secure.gravatar.com/avatar/c4dec679e8acf10aae27f38e2771a9e2?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/65b12d79dbbf4e5a1d59820617f9787f?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/64ae4e082d370107cccb6cbfd5eae97f?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/3382433223f668bc68d4e83fa32fbdea?s=32&d=blank&r=pg", "https://variety.com/wp-content/uploads/2023/11/MS-S10_VTR10-Show-TP_00117_f-e1701302724490.jpg?resize=232,175", "https://secure.gravatar.com/avatar/dcf632a7427e461d8938db17232bd4b0?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/3039facb3a03ba6bd61651122c2e57d3?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/a47eec15ff2feb5bf9bbe32c491c4c60?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/irrational-found-renewed-season-2-nbc.jpg?w=1240&h=840&crop=1", "https://secure.gravatar.com/avatar/7e8ee229bd1d641db183375c5289f9d6?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/01d1399cf21489ee78a533d1522a0572?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/c0fcb62ae956f96e0d0b86d4a1aac15b?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/ff39e931b2feebed98b59285a52565ea?s=32&d=blank&r=pg", "https://spy.com/wp-content/uploads/2023/10/sdfgve.png?resize=232,175", "https://secure.gravatar.com/avatar/856a8e9f7f58a23235e52de23f15e04f?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/obit-evan-ellingson.jpg?w=620&h=420&crop=1", "https://secure.gravatar.com/avatar/1cd969484d64cf2e9a3ecb74a50e7a33?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2023/11/law-and-order-svu-kelli-giddish-return-season-25-rollins.jpg?w=1000&h=625&crop=1", "https://secure.gravatar.com/avatar/073c84c95737e507b838bdb4f7a34413?s=32&d=blank&r=pg", "https://secure.gravatar.com/avatar/31453c9edcecb31c441d4095b8cc1412?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2018/02/the-voice-season-14-dr-king.png?w=300", "https://tvline.com/wp-content/uploads/2021/11/zoeys-extraordinary-christmas-1.jpg?w=620&h=420&crop=1", "https://secure.gravatar.com/avatar/49c05e77ada0117b13d4b9ac5cfdfd21?s=32&d=blank&r=pg", "https://tvline.com/wp-content/uploads/2022/07/the-boys-season-3-finale-recap-1.jpg?w=620&h=420&crop=1"], "top_img": "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg", "keywords": [], "authors": ["Charlie Mason"], "canonical_link": "https://tvline.com/news/the-voice-season-14-premiere-recap-kelly-clarkson-block-918485/", "title": "The Voice Season 14 Premiere Recap: The New Kid and the Block", "meta_data": {"description": "In the Season 14 premiere of 'The Voice,' Kelly Clarkson joined the coaches, and the Block was unleashed — and our recap has all the deets.", "robots": "max-image-preview:large", "apple-itunes-app": "app-id=1377345661", "generator": "WordPress 6.2.3", "author": "Charlie Mason", "content_type": "Article", "post_id": 918485, "title": "<i>The Voice</i> Season 14 Premiere Recap: The New Kid and the Block", "published_at": "2018-02-26 19:00:04", "image": "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg?w=300", "comment_count": 73, "tags": "The Voice", "topics": "Recaps", "body": "Weird, isn't it? As played out as the shoe-throwing had gotten by the end of The Voice last season, I actually thought I'd miss it when I tuned in to Monday's Season 14 premiere. (Hey, I acknowledged that it was weird!) But nah, the episode zipped along, energized by the return of Alicia Keys and the addition of not only new coach Kelly Clarkson (funny as hell) but also the Block (a feature that allows coaches to prevent a rival from nabbing one and only one contestant).\r\n\r\nAs for the Blind Auditions, they were good — some quite good — but there were none that made me say, as the coaches love to, this person could win. Among them, I didn't hear the next Chris Blue (whose edgy, artful \"Blue Blood Blues\" I've become obsessed with). In fact, only one of this first batch of hopefuls even earned an A- from me. In the interest of being a tougher grader, I'm trying this season to keep in mind that, as in TVLine's polls, A = awesome, and it's not a hateful dis to say that a vocalist was merely very good — in other words, a B. (If I ever do what Kelly recommended to deal with Blake Shelton and Adam Levine's squabbling and watch with a glass of wine, I'm sure that determination will go out the window.)\r\nNow then, let's review the singers, shall we? You can see what I thought of them below, then vote for your favorite in the poll that follows this recap and hit the comments with your own critiques.\r\nBritton Buchanan (Team Alicia), \"Trouble\" — Grade: B | Were The Voice a charm competition, this 17-year-old \"'90s Matt Damon\" lookalike would be an early frontrunner. (He describes his hometown as being small enough that everybody knows of each other but doesn't know each other, and insists he's never been to a party.) Even though it isn't a charm competition, Britton still sounds like a safe bet to make it to the Top 12, his deep, bluesy voice bringing to mind Jonny Lang and inspiring Blake to use his Block on Adam. Not a perfect performance but memorable and, perhaps more importantly, promising.\r\n\r\nBrynn Cartelli (Team Kelly), \"Beneath Your Beautiful\" — Grade: A- | Though this Kelly fan is just 14, Adam suggested that she sounded \"like a 36-year-old who's been through it.\" Which I think he only meant to mean she sounded mature. I thought what she sounded was stunning. She sang with a vulnerability that really drew me in — how can a vocal be so solid and fragile at the same time? — and as the song crescendoed, inviting her to go big, she RSVP'd yes without losing any of her vocal control. If this wasn't just a terrific one-off audition but a sign of Brynn's innate polish, she could develop into this season's Addison Agen.\r\nRayshun LaMarr (Team Adam), \"Don't Stop Believing\" — Grade: C | It feels lousy to give a C to a lymphoma cancer survivor who sang the Journey number that helped buoy him during his treatment, buuut… Although the 33-year-old from Fort Washington, Md., has a humongous voice that he's able to mix gravel into when he wants to — and he clearly can give a great performance — he veered into cheesiness on the chorus and never really came back out. Unless he wants to go the way of Jon Mero, his coach might want to advise him to rein that in going forward.\r\nKyla Jade (Team Blake), \"See Saw\" — Grade: B | By the time this 30-year-old JHud backup singer had finished her Aretha Franklin cover, it was obvious that she didn't belong behind anyone — there was star power in that mammoth voice of hers (and the divalicious look didn't hurt, either!). But the strange thing about her performance was, it didn't really take off — or move Blake and Kelly to swivel their chairs — till she started hitting her runs toward the end. So maybe the lesson here is, \"If you've got it, flaunt it — and sooner than later!\"?\r\n\r\nKelsea Johnson (Team Alicia), \"Like I'm Gonna Lose You\" — Grade: B+ | Odd observation: Kyla's pitch-perfect performance was probably technically superior to Kelsea's, yet Kelsea's, full of raw passion from the word go, was more exciting, which I suspect bodes better for her moving forward in the competition. It also doesn't hurt that, at their sweetest, the 21-year-old knockout's vocals are so rich, you could stir ’em into your coffee like creamer. If she can control her powerful voice — or if she has more control over it than this first impression gave — there's no reason why she shouldn't make it to the Top 12.\r\nDrew Cole (Team Adam), \"Sex and Candy \" — Grade: B | \"I did not move to Los Angeles to be a bartender,\" said this 25-year-old before his performance. Which is ironic, because his voice is pretty intoxicating. It's distinct, unusual, twangy like a guitar rather than twangy like a country singer. And he works his way up and down from his eyebrow-raising falsetto with the kind of finesse that one hopes for from foreplay. If he keeps it up, he won't for much longer be best known as the viral-video guitar player whose strumming put a smile on the face of a golden retriever.\r\nD.R. King (Team Kelly), \"Believer\" — Grade: C+ | Maybe it was nerves. Maybe it was an issue of breath control. Maybe it was a harder song than D.R. (\"not to be confused with the reverend\") realized. But for whatever reason, he sounded as winded on the verses as I do when I've sprinted to the kitchen during a commercial break that's turned out to be shorter than I expected. He redeemed himself on the choruses, singing with a power that had to have shaken the lights overhead. However, the unevenness of this performance suggests that he won't survive the Battles.\r\n\r\nKaleb Lee (Team Blake), \"Never Wanted Nothing More\" — Grade: B- | For most of the Floridian's fine but not exceptional Kenny Chesney cover, I kept wanting to rewind and rewatch him singing \"You Are My Sunshine\" with his son in his pre-performance introduction. It was the producers' usual cheap ploy to get us attached to the contestant, but in this case, it was so cute that it worked. (Am I going softer in my old age?) At least, as the number progressed and Kaleb went bigger and raspier, he began to seem less like a nice guy on karaoke night and more like possibly this season's Adam Cunningham. And that last note… dang!\r\nJustin Kilgore (Team Kelly), \"Tomorrow\" — Grade: B+ | This wannabe Steve Grand earned a four-chair turn — and inspired Alicia to block Blake — with a voice as rich as ice cream and a twang that sounded as authentic as a dirt road. And if I hadn't already been loving Kelly on the panel — side note: I already was — her hard sell to get him on her team would have done the trick 10 times over. She quoted Elf to shut down Adam (\"You sit on a throne of lies!\") and, hearing a noise in the auditorium, deadpanned to Justin, \"That was the Lord saying, 'Pick Kelly!' That was Jesus Christ Himself.\" Hi. Lar. I. Ous.\r\nSo, what did you think of the premiere? Coach Kelly? The contestants? Vote in the polls below, then hit the comments.", "og": {"type": "article", "title": "The Voice Season 14 Premiere Recap: The New Kid and the Block", "url": "https://tvline.com/news/the-voice-season-14-premiere-recap-kelly-clarkson-block-918485/", "description": "Weird, isn’t it? As played out as the shoe-throwing had gotten by the end of The Voice last season, I actually thought I’d miss it when I tuned in to Monday’s Season 14 premiere.", "site_name": "TVLine", "image": {"identifier": "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg", "width": 620, "height": 420, "alt": "the voice season 14 premiere recap kelly clarkson block"}, "locale": "en_US"}, "article": {"published_time": "2018-02-27T03:00:04+00:00", "modified_time": "2018-02-27T12:19:49+00:00"}, "twitter": {"site": "@TVLine", "card": "summary_large_image", "title": "The Voice Season 14 Premiere Recap: The New Kid and the Block", "description": "In the Season 14 premiere of 'The Voice,' Kelly Clarkson joined the coaches, and the Block was unleashed — and our recap has all the deets.", "image": "https://tvline.com/wp-content/uploads/2018/02/nup_180480_5015.jpg?w=620"}, "msapplication-TileImage": "https://tvline.com/wp-content/uploads/2018/06/logo-tvline.png?w=270", "viewport": "width=device-width, initial-scale=1"}, "movies": [], "publish_date": 1519596000.0, "source": "https://tvline.com", "summary": ""}