{"url": "www.inquisitr.com/4913434/khloe-kardashian-didnt-get-banned-from-cleveland-cavaliers-games-debunked/", "text": "Khloe Kardashian and Tristan Thompson have been having relationship issues ever since the NBA star was busted cheating on the reality star back in April. Now, rumors are circulating that Khloe has been banned from attending Cleveland Cavaliers games.\n\nAccording to a May 23 report by Gossip Cop, Khloe Kardashian has not been forbidden from attending Tristan Thompson’s basketball games at home in Cleveland. The rumor originated from a report by Media Take Out. The site claimed that LeBron James specifically asked Tristan to keep Khloe away from Quicken Loans Arena on game days.\n\n“‘Lebron James asked Tristan to ban the Kardashian from all remaining playoff games,’ insisted the website. The outlet maintained the prohibition applied to the NBA finals as well. The online publication cited unspecified “reports” as the basis for its contentions, but a Google search indicated the claims originated with MTO. In fact, when lemmings like HollywoodLife also spread these allegations, they credited MediaTakeOut as the source. But none of the sites that copied the misinformation bothered to fact-check or do any investigating,” Gossip Cop reports.\n\nHowever, Khloe Kardashian herself seemed to debunk the rumors when she showed up at the Cleveland Cavaliers game with her younger sister, Kylie Jenner, to cheer on her baby daddy. Of course, this isn’t the first time that Khloe has allegedly been banned from the team’s games. Multiple reports have suggested that LeBron James did not want Khloe at the games due to the “Kardashian curse,” which is a rumor that all of the Kardashian women ruin the careers of the men they have dated.\n\nAlleged victims of the Kardashian curse include Kim Kardashian’s exes Kris Humphries and Reggie Bush, Khloe Kardahian’s former husband, Lamar Odom, and Kourtney Kardashian’s baby daddy, Scott Disick.\n\nLast year, People Magazine reported that Khloe Kardashian wrote a blog post about her game day rituals for days when Tristan Thompson is playing with the Cavs. Khloe revealed that after the National Anthem plays she always says a prayer asking for Tristan to be protected, saying that it may look like she’s talking to herself, but that she doesn’t want “her baby getting hurt.”\n\nAs previously reported by the Inquisitr, Khloe Kardashian and Tristan Thompson are trying to work through their relationship issues after the NBA star was busted cheating on the Keeping Up with the Kardashians star last month, just days before she gave birth to their first child, daughter True. Although they are said to be uncertain about the future, Khloe has been attending all of Tristan’s home games.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4913434/khloe-kardashian-didnt-get-banned-from-cleveland-cavaliers-games-debunked", "title": "Khloe Kardashian Didn’t Get Banned From Cleveland Cavaliers Games [DeBunked]", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Khloe Kardashian and Tristan Thompson have been having relationship issues ever since the NBA star was busted cheating on the reality star back in April. Now, rumors are circulating that Khloe has been banned from attending Cleveland Cavaliers games. According to a May 23 report by Gossip Cop, Khloe Kardashian has not been forbidden from [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Khloe Kardashian Didn’t Get Banned From Cleveland Cavaliers Games [DeBunked]", "url": "https://www.inquisitr.com/4913434/khloe-kardashian-didnt-get-banned-from-cleveland-cavaliers-games-debunked", "type": "article", "description": "Khloe Kardashian and Tristan Thompson have been having relationship issues ever since the NBA star was busted cheating on the reality star back in April. Now, rumors are circulating that Khloe has been banned from attending Cleveland Cavaliers games. According to a May 23 report by Gossip Cop, Khloe Kardashian has not been forbidden from [&hellip;]"}, "article": {"published_time": "2018-05-24T22:07:56", "modified_time": "2018-05-24T22:07:56", "author": "Amanda Lynne"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Khloe Kardashian Didn’t Get Banned From Cleveland Cavaliers Games [DeBunked]", "description": "Khloe Kardashian and Tristan Thompson have been having relationship issues ever since the NBA star was busted cheating on the reality star back in April. Now, rumors are circulating that Khloe has been banned from attending Cleveland Cavaliers games. According to a May 23 report by Gossip Cop, Khloe Kardashian has not been forbidden from [&hellip;]"}}, "movies": [], "publish_date": 1527188876.0, "source": "http://www.inquisitr.com", "summary": ""}