{"url": "https://www.visitdeepcreek.com/pages/MemberNews1", "text": "Posted 10/18/23\n\nTIME AND ALLY FINANCIAL HONOR KEYSER DEALER\n\n(New York, NY, October 18, 2023) – The nomination of Fredrick J. Timbrook, dealer principal at Timbrook Chevrolet in Keyser, West Virginia, for the 2024 TIME Dealer of the Year award was announced today by TIME.\n\nTimbrook is one of a select group of 49 dealer nominees from across the country who will be honored at the 107th annual National Automobile Dealers Association (NADA) Show in Las Vegas, Nevada, on February 3, 2024.\n\nThe TIME Dealer of the Year award is one of the automobile industry’s most prestigious and highly coveted honors. The award recognizes the nation’s most successful auto dealers who also demonstrate a long-standing commitment to community service. Timbrook was chosen to represent the West Virginia Automobile Dealers Association in the national competition – one of only 49 auto dealers nominated for the 55th annual award from more than 16,000 nationwide.\n\n“My retail automotive career has given me the opportunity to help others achieve their goals and dreams,” nominee Timbrook said. “As a result of my success in this business, I have also been able to financially support many causes that improve people’s lives.”\n\nTimbrook graduated from Liberty University in Lynchburg, Virginia, in 1992 with a B.S. in finance. Even though his father, Fred, ran a Pontiac and Cadillac dealership in Cumberland, Maryland, where Timbrook worked as a teenager, he never planned on a career in the auto industry – nor staying in the town where he grew up.\n\n“Of course, life can change in a moment and my dad ended up purchasing the Cumberland store due to the sudden death of the owner when I was a junior in college,” he said. “I joined him after graduating, and my first ‘real job’ was body shop estimator.”\n\nTimbrook worked his way through every department, developing an in-depth knowledge of dealership operations and gaining the experience necessary to take on a leadership role. In 2001, when he was 31 years old, he bought the business.\n\n“My father sold the dealership and the real estate to me – for full price – because he wanted me to experience the responsibility that goes with owning a store,” he said. “He was a great mentor and continued to help me build the company until his retirement in 2017. His sacrifices in the past paved the way for our future.”\n\nToday, Timbrook Automotive has grown to encompass 12 new-car stores and two powersports dealerships in Maryland, West Virgina, Virginia, and Pennsylvania, representing Chevrolet, Chrysler, Dodge, Ford, GMC, Honda, Hyundai, Jeep, Kia, Nissan, and Ram. His two daughters Caroline Rogers, and Lauren Timbrook are the next generation to join the family enterprise.\n\n“All of our team members, some of whom have been with the company longer than I have, are truly outstanding,” Timbrook said. “Most of our locations have general managers who are also partners in the store, which has provided me the opportunity to focus on growing the company overall.”\n\nHe is proud that Timbrook Automotive has been named favorite new-car dealer multiple times by the readers of Cumberland Times-News in the publication’s annual Readers’ Choice poll.\n\nTimbrook is actively involved in dealer associations in the states that his car dealerships serve, including West Virginia, Maryland, and Pennsylvania. “With so many issues facing our industry, my advocacy on behalf of fellow dealers ensures that our rights and investments are protected,” he said.\n\nIn the area of community service, his most important contribution is helping to launch CityReach Church in Cumberland along with his wife, Kristin, in 2015. Timbrook is currently lead pastor.\n\n“As the name implies, CityReach is focused on reaching our community with the life-changing message of Jesus through various types of community outreach events,” he said.\n\nTo that end, the church prepares and distributes food boxes containing a complete holiday dinner for those in need at Easter, Thanksgiving, and Christmas. In addition, they host backpack giveaways, clothing drives, and playground cleanups. The One Fest, a recent CityReach event in downtown Cumberland, featured music, children’s activities, and an “everything with wheels” giveaway of Trek mountain bikes, Honda motorcycles, and a Kia Soul.\n\nThe CityReach Hope Homes provide 9-to-12-month faith-based resident programs for men and women struggling with addiction. These free programs are designed to help individuals break free from drugs and get back on their feet.\n\n“I preach and teach almost every week, and I personally interact with residents of the Hope Homes several times per week,” says Timbrook. “I have seen men and women go from living on the street, completely addicted to heroin, crack, or meth, to becoming productive members of society who know their value and worth. Some have even started a career in the automotive industry and are working for our company.”\n\nDealers are nominated by the executives of state and metro dealer associations around the country. A panel of faculty members from the Tauber Institute for Global Operations at the University of Michigan will select one finalist from each of the four NADA regions and one national Dealer of the Year. Three finalists will receive $5,000 for their favorite charities and the winner will receive $10,000 to give to charity, donated by Ally.\n\nIn its 13th year as exclusive sponsor, Ally also will recognize dealer nominees and their community efforts by contributing $1,000 to each nominee’s 501(c)3 charity of choice. Nominees will be recognized on AllyDealerHeroes.com, which highlights the philanthropic contributions and achievements of TIME Dealer of the Year nominees.\n\n“At TIME, we are proud to uphold the decades-long tradition of honoring automotive dealers who make a positive impact and show dedication to their communities through our TIME Dealer of the Year award,” said TIME CEO Jessica Sibley. “We are excited to keep this tradition of applauding these community contributions together with our partners at Ally.”\n\nDoug Timmerman, president of dealer financial services, Ally, said, “Auto dealers nominated for the TIME Dealer of the Year award have demonstrated an unwavering commitment to not only the industry but to their respective communities through volunteerism, sponsorships, and supporting charitable causes, no matter the market climate. Whether their clients are purchasing a first car or upgrading for a growing family, these selected dealers have successfully extended their relationships beyond the showroom and have been steadfast in driving their communities forward.”\n\nTimbrook was nominated for the TIME Dealer of the Year award by Jared Wyrick, president of the West Virginia Automobile Dealers Association. He and his wife, Kristin, have three grown children and reside in Ridgeley, West Virginia.", "images": ["https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/248.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Annual_AGF_Logo.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/Maryland-Tourism-Logo_URL_4C_website2.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/SLA_sm-2.png", "https://www.facebook.com/tr?id=2253073318299933&ev=PageView&noscript=1", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/MountainMarylandLogo_NEWwebsite-3.jpg", "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2018/07/gcchamber_stackedlogo_20210916.jpg", "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAALkAAABkAQAAAADydqwAAAAAAnRSTlMAAHaTzTgAAAAZSURBVEjH7cEBDQAAAMKg909tDjegAAB4MwnEAAEAx8GgAAAAAElFTkSuQmCC"], "top_img": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-32x32.png", "keywords": [], "authors": [], "canonical_link": "https://www.visitdeepcreek.com/member-news/", "title": "Member News", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "og": {"locale": "en_US", "type": "article", "title": "Member News", "description": "Commissioners Seek to Fill Vacancy on Board of Education Posted 11/27/23 November 22, 2023, Oakland, MD – Pursuant to the Maryland Education Code, the Board of Garrett County Commissioners “shall appoint a qualified individual to fill any vacancy in an elected member’s position on the [elected Board of Education] for the remainder of the term…", "url": "https://www.visitdeepcreek.com/member-news/", "site_name": "Garrett County Chamber of Commerce"}, "article": {"modified_time": "2023-11-27T15:57:44+00:00"}, "twitter": {"card": "summary"}, "generator": "WordPress 6.1.1", "msapplication-TileImage": "https://growthzonesitesprod.azureedge.net/wp-content/uploads/sites/2994/2021/12/cropped-SLA_sm-2-270x270.png", "google-site-verification": "0ybERtUepYNzK3mfAaYBnaB8PEQIF0svZs4YjZzsDPs"}, "movies": [], "publish_date": null, "source": "https://www.visitdeepcreek.com", "summary": ""}