{"url": "https://web.archive.org/web/20190417020625/https://www.nbcsports.com/washington/golf/tiger-woods-arrested-dui-charge-florida", "text": "A tradition unlike any other... that magical drive down Magnolia Lane … okay that’ll do. There is no need to get cute, not when the golf’s first Major of the year – and most prestigious event on the calendar – The Masters is here.\n\nThe tee times are set, the Champions dinner scarfed down. Now there’s only one thing left to do before the Honorary Starters get this tournament started: help guide you through who can win and who is going to win this year’s Masters.\n\nThe panel of golf experts offering their predictions, picks and analysis are:\n\nKenny Kim\n\nHost of the Fantasy Golf Degenerates podcast\n\n@KendoVT\n\nGeoffrey Fienberg\n\nThe Pat Mayo Experience/DK Live\n\n@gfienberg17\n\nChris Garosi\n\nSenior Fantasy Writer, The Fantasy Fix\n\n@chrisgarosi\n\nBryan Snow\n\nPartner at GupsCorner.com\n\n@BPSnow11\n\nDoug McKinney\n\nJunkies TV Producer, NBC Sports Washington\n\n@DougieFreshNBCS\n\nGarrett Johnston\n\nGolf Journalist for Golf.com, Caddie Network, USOpen.com contributor (Covered 25 majors)\n\n@JohnstonGarrett\n\nPick to win:\n\nKim: Rickie Fowler\n\nDJ and Rory are the favorites for good reason and I think both will contend, but I think Fowler finally gets that monkey off his back this week. His iron game and putting is always solid. The key to his high finishes this season has been his off the tee game and he looked strong with his driver at Valero last week gaining 3.5 strokes on the field off the tee. His life is in a good place as he is newly engaged and we saw a newly engaged Sergio Garcia put on the Green Jacket a couple years ago. Being happy at home can go a long way into improving other aspects of your life. Rickie’s got the form, the stats, the girl, and will be wearing the Green Jacket on Sunday.\n\nFienberg: Rickie Fowler\n\nI'm keeping it real here and letting you all know that I - like many other grown men who are long past the age of being able to dress like Rickie - remain fanboys of his despite his lack of wins compared to the Tour's other top stars. Yet here we are and little Rickie has turned 30-years-old so he’s officially on the clock. And no track suits his quest for a major more than Augusta. If you make me take off my fanboy hat, I'll give you Jon Rahm.\n\nGarosi: Paul Casey\n\nEverything seems to point to Rory McIlroy taking his first Masters win in 2019. Rory has top 10 finishes in all seven of his 2019 tournaments. He’s finished in the top 10 at the Masters in each of the last five years. If the weather turns nasty, he can handle it. Except, the recent history of winners is that they come in at longer odds than where Rory currently sits. Eight of the last 10 Masters’ winners have come in at 20/1 odds or longer. So, I’m going to wander down the list to Paul Casey as my pick to win the 2019 Masters. Casey has solid pedigree at August (four straight top 15s with three finishes in the top six) and excellent form (four top 3 finishes including a win in 2019).\n\nSnow: Rory McIlroy\n\nThis is almost a dead heat for me between Tiger and Rory but I won’t let my heart get the better of me. With his worst finish ALL YEAR being 9th, Rory is the hottest player on the planet, and with 5 straight top 10s at Augusta, he has course history on his side. Past that he is top 10 in all major statistical categories as well. Rory wins this week to challenge Rose as the #1 player in the world.\n\nMcKinney: Rory McIlroy\n\nFor a second there, I thought I was going to be the only one going with the favorite? I am well aware of the enormous pressure on him trying to close out the Majors Grand Slam. Guess what, so is Rory. And this thing has to happen at some point right? There is so much to like about Rory this weekend: 1) he has stats that will play up to Augusta (1st in SG: off-the-tee, SG: tee-to-green and SG: total); 2) his form in the 2019 calendar year is outstanding (9-1-6-2-4-5-4) and 3) he has five top 10 finishes in his last five appearances at The Masters. It's going to happen and I don't see why it can't this weekend.\n\nJohnston: Louis Oosthuizen\n\nEvery player that walks these famous grounds will tell you this is a second shot golf course. And world-class iron-play is right in Louis’ wheelhouse. He’s quietly the hottest golfer not in the Top 10 right now coming off Valspar and Match Play close calls.\n\nSleeper Pick(s):\n\nKim: Hideki Matsuyama\n\nWhile everyone is talking about Rory, DJ, Tiger, and the like, one name that seems to have slipped under the radar is Hideki Matsuyama. After struggling at Augusta his first few tries he has seemed to figure the course out with four straight Top 20s including two Top 10s. He’s long enough to compete even if the course is wet and his iron game is one of the best in the field. Like usual it all comes down to his putter. He gained 2.7 strokes on the greens in his last stroke play outing at TPC Sawgrass so hopefully he can take that momentum into this week.\n\nFienberg: Hideki Matsuyama\n\nTo many outsiders he's kind of become a forgotten entity, as many young American golfers have risen to the moment, in combination with his injury plagued 2018. But if you look closer his form and stats have started to resemble the much-hyped Hideki of old and people close to the pulse of the PGA Tour have taken notice. As have I; with a 40/1 ticket.\n\nGarosi: Henrik Stenson\n\nWith the ubiquity of information, sleepers are tough to come by especially in a tournament with the small field the Masters presents. The bottom 20% of the field has little to no chance to win and only a slightly greater chance to make the cut. So, let’s aim for a guy who seems to have some warts and that man is the Swede Henrik Stenson. He was in poor form early in 2019 struggling with nearly every aspect of his game. However, he’s put up three top 25 finishes in his last four starts on Tour and has made the weekend in five of his last six trips to August with every finish in the top 25.\n\nSnow: Keegan Bradley\n\nAdmittedly, anytime you roster Keegan you click submit, cross your fingers, and close your eyes because who knows when that train will derail, BUT, I believe he is a solid sleeper play this week for a few reasons. 1. He is a cut machine, missing only 2 cuts in his last 30 events. 2. Augusta is a second shot course and Keegan is a great iron player and hits greens at an elite level. If he can avoid his one blowup round on the weekend he will T20.\n\nMcKinney: Jordan Spieth\n\nAs we can all see - Kenny and Geoff like to copy each other's answers - cheaters! Well, I'm going in the complete opposite direction. They both have Spieth listed below in a category you don't want to be featured in, but I like Spieth for a lot of reasons this weekend. He's going to be low-owned in all formats (DFS, One and Done, betting), so there is money to be made. His form on the season may not be spectacular, but I liked what I saw from him last weekend at the Valero Texas Open - not just his iron play and putting, but how he handled some adversity on Saturday's roller coaster round. And even if he hasn't played his best golf in 2019, whenever Jordan Spieth and Augusta National Golf Club hook up, we see the best from the young Texan. In five tries here, he has an 11th place finish, a 3rd place finish, two 2nd place finishes and a win. Can a Green Jacket winner be considered a sleeper? Well, the way people are discounting him this weekend...I'd say so. I will be rostering Spieth in all formats and plays this week.\n\nJohnston: Brandt Snedeker\n\nThis tournament means so much to him. You could tell when he cried in his presser here after losing to Trevor Immelman in 2008. His short game is so consistent, and that will keep him on the leaderboard even though he’s not a sexy pick.\n\nLongshot Pick(s):\n\nKim: Charles Howell III\n\nCH3 is coming back home and finally competing at Augusta after a long layoff. He has been having a solid season with eight Top 20s in twelve events including a win at the RSM Classic. He has gained strokes tee to green in every event this season and his chipping and putting have been very strong. He finished 19th the last time he played here and I think he can beat that this week.\n\nFienberg: Patrick Cantlay\n\nFor those who've followed my works this season, know I haven't kept this to myself at all: any chance that I got I would let the people know, that I do believe Cantlay is capable of greatness and The Masters does seem to suit what he does well. I've become even more emboldened in this pick as The Masters draws closer, seeing many respected people in this space have also started to take his chances to win this week very seriously. I will be using him as my 'One and Done' this week as well, so you can tell I'm taking the plunge on this risk/reward option.\n\nGarosi: Charles Howell III\n\nCharles Howell III never wins, right? Well, he won the RSM Classic in 2018. I know, I know – the RSM isn’t exactly the Masters. He hasn’t played at Augusta since 2012 when he finished 19th. His best finish this year? A sixth place finish at the Genesis Open which is a corollary course to Augusta and where we can often find solid values for the Masters.\n\nSnow: Viktor Hovland\n\nAt $6,200 (on Draftkings) and being an Amateur, this is a true longshot pick. The 2018 US Amateur champ is great off the tee and hits his irons pure. If he can avoid getting eaten alive by Augusta greens then he will make the cut.\n\nMcKinney: Kevin Kisner, Patrick Cantlay\n\nKevin Kisner may have made some waves with his comments to Barstool Sports about not liking his chances in this year's rotation of majors tracks, but he is not fooling me. Not only is he coming off a win in his last start - Dell-Technologies Match Play - but Kisner has really impressed in majors recently, making the cut in 11 of the 12 events played. In that span, 'Kiz' has gone T7-T28 (The Masters)-Cut-T2-T12. Not to mention, Kisner is an SC native and played golf at the University of Georgia, I like him contending this weekend.\n\nWe had Jim Nantz on \"The Junkies\" less than two weeks ago and he selected Patrick Cantlay as his pick to win. Cantlay may not have much of a track record here (T-47 as an amateur, MC last year), but he has had a nice year on Tour: every cut he's made he has placed in the Top 25 (including four Top 10's) and he ranks 10th in SG: Total.\n\nJohnston: Bernhard Langer\n\nNever underestimate great experience at Augusta. This two-time Champ is in his early 60s and still outplayed Jason Day in 2016’s 3rd round to earn a spot in the penultimate group that Sunday.\n\nFade Pick(s):\n\nKim: Jordan Spieth\n\nSpieth showed flashes last week but still only finished in 30th place. The crazy thing is that’s his best result of the season. He only has one Top 10 since last year’s Masters! His form is just not there for me to pull the trigger on him. He has the course history thing going for him but he’s currently 172nd in Strokes Gained: Tee to Green. Prior to his first five appearances at Augusta the lowest SG:T2G ranking he had was 37th in 2014. The last four years he was no lower than 14th. Definitely a fade for me.\n\nFienberg: Jordan Spieth\n\nThis isn't me jumping on a bandwagon. I've been calling for Jordan's regression even when he had all of his magic beans working for him. But it looks like that bag of magic beans has emptied and he's searching for many parts of his game. Note: I'm not much of course history truther.\n\nGarosi: Phil Mickelson\n\nPhil Mickelson comes in with little form having missed two of his last three cuts. His history at Augusta is also bumpy with two missed cuts in the last five years.\n\nSnow: Patrick Reed\n\nThe 2018 Green Jacket winner is struggling of late with his last four event finishes being 24th, MC, 47th, and 50th. Struggling off the tee and with his iron play I will avoid him even though he is a former winner, especially when he has guys like Kuchar, Sergio, and Stenson all at a cheaper price this week.\n\nMcKinney: Patrick Reed, Bryson DeChambeau\n\nWhile I would not fade Patrick Reed's Champions dinner menu (Caesar salad, steak, mac-n-cheese and awesome desserts), I am afraid I have to fade the defending champ this weekend mostly due to his form and quite frankly he just doesn't seem to have much confidence in his game right now.\n\nAs for DeChambeau, the price tag on \"The Mad Scientist\" is way too high for my liking. Plus, outside a Top 20 at The Players, DeChambeau has finished 56-46-40\n\nJohnston: Justin Thomas\n\nSo much talent. So much firepower. Just don’t think he’s patient enough on the greens here.", "images": ["https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2017/08/22/2017-08-23t00-44-16.276z-1280x720.jpg?itok=Cj3xpjyk&timestamp=1503455403", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/14/justin-thomas-us-open-golf-usat.png?itok=xgcqKjKc", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/07/06/tigerphil.jpg?itok=FFTG_Mpy", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2017/08/22/2017-08-23t00-58-11.578z-1280x720.jpg?itok=R0jwOWfR&timestamp=1503455403", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/27/tiger-woods-military-caddie.jpg?itok=PLlVUiuP", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/2018/09/25/compass_pointe-course13.jpg", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2019/04/11/masters-usat.jpg?itok=VukxBTL_", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/09/18/rydercup-usat.jpg?itok=mGGAUc4H", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/07/18/rory-mcilroy-open-usat.png?itok=bTcVZz8e", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/07/22/caretjug.jpg?itok=GmoI41qW", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2017/06/30/david_lingmerth_usat.jpg?itok=FpA8tPYG", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2017/08/22/2017-08-23t00-31-41.621z-1280x720.jpg?itok=D7aNquad&timestamp=1503455403", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2019/04/11/masters_predictions.png?itok=OrL-RpEO&timestamp=1554994201", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/best19hole.jpg", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/08/09/dustin-johnson-pga_usat.png?itok=b1nBCP2-", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2017/08/22/steph_curry_trophy_usat.jpg?itok=Ra-7Ksjn", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/07/18/tiger-woods-open-championship-usat.png?itok=KGF6lgBk", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/bestpar3.jpg", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/27/tiger_woods_swing.jpg?itok=xa0Pn1kB", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/25/usatsi_9357064_141983962_lowres.jpg?itok=zx-sFiok", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/09/25/compass_pointe-course13.jpg?itok=1pbETbPw", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2017/08/22/2017-08-23t00-18-33.233z-1280x720.jpg?itok=jsFLzHYP&timestamp=1503455102", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/30/screen_shot_2018-06-30_at_12.57.57_pm.png?itok=Xk7WBLmD", "https://web.archive.org/web/20190417020625im_/http://examplecom.112.2o7.net/b/ss/examplecom/1/H.20.3--NS/0/5227934", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2018/08/09/potomac_video1522444783434_7000k_1920x1080_1267024963904.jpg?itok=SqZ11QjB&timestamp=1533830636", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2018/01/25/woods.png?itok=5VX3ZxfA&timestamp=1516895127", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/11/brooks-koepka-us-open-2017-usat.png?itok=CgtVzNJT", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/bestview.jpg", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/03/26/tigerwoods.png?itok=UnuB5ZCN", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/whiskeycreek18.jpg", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2017/05/29/usatsi_9579438_0.jpg?itok=xqmO0bRx", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2017/07/03/the_open_usat.jpg?itok=H94ni5Xr", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/half_6__desktop_large_/public/2017/08/22/2017-08-23t00-14-44.537z-1280x720.jpg?itok=XKFBgVAM&timestamp=1503455102", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2018/06/28/tiger-woods-9th-hole-tee-qln-usat.jpg?itok=_ERSmpa4", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/styles/article_hero_image/public/2019/04/11/masters_predictions.png?itok=sYYq-2rp", "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/2017/05/29/usatsi_9579438_0.jpg"], "top_img": "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/2017/05/29/usatsi_9579438_0.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20190417020625/https://www.nbcsports.com/washington/golf/tiger-woods-arrested-dui-charge-florida", "title": "Tiger Woods arrested for DUI charge in Florida", "meta_data": {"tp": {"EnableExternalController": "true"}, "description": "The golf star seems to have bigger problems than making a comeback.", "robots": "follow, index", "rating": "general", "generator": "Drupal 7 (https://www.drupal.org)", "og": {"site_name": "NBC Sports Washington", "type": "article", "title": "Tiger Woods arrested Monday morning", "url": "https://web.archive.org/web/20190417020625/https://www.nbcsports.com/washington/golf/tiger-woods-arrested-dui-charge-florida", "description": "The golf star seems to have bigger problems than making a comeback.", "updated_time": "2017-05-29T12:54:52-04:00", "image": "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/2017/05/29/usatsi_9579438_0.jpg"}, "twitter": {"card": "summary_large_image", "title": "Tiger Woods arrested Monday morning", "url": "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/golf/tiger-woods-arrested-dui-charge-florida", "description": "The golf star seems to have bigger problems than making a comeback.", "image": "https://web.archive.org/web/20190417020625im_/https://www.nbcsports.com/washington/sites/csnma/files/2017/05/29/usatsi_9579438_0.jpg"}, "article": {"published_time": "2017-05-29T12:40:24-04:00", "modified_time": "2017-05-29T12:54:52-04:00"}, "viewport": "width=device-width, initial-scale=1, maximum-scale=1.0, user-scalable=no"}, "movies": [], "publish_date": 1496076024.0, "source": "https://web.archive.org", "summary": ""}