{"url": "www.cosmopolitan.com/uk/entertainment/news/a45792/taylor-swift-tom-hiddleston-relationship-timeline/", "text": "1 May, 2016. A photo appears of Tom Hiddleston and Idris Elba leaving a dinner held at Anna Wintour's home in new York. But who's that lurking in the background? Why it's Taylor Swift!\n\n2 May, 2016. Taylor and Tom dance it up real nice at the Met Gala. But they're just friends. Honest…\n\n1 June, 2016. Taylor Swift and Calvin Harris break up, according to People magazine. And it's mutual apparently, so there's no drama.\n\n15 June, 2016. Hiddleswift is ON! The Sun publish photos of Taylor and Tom smooching it up near Taylor's Rhode Island home. Everyone loses their shit, including Calvin, who unfollows Taylor and her brother Austin on Instagram. He even blocks some Swifties.\n\n16 June, 2016. Calvin reacts to the Hiddleswift photos in the best way.\n\n17 2016, June. He then decides to open the door and break his silence on the whole thing.\n\n21 June, 2016. Tom meets Taylor's parents Andrea and Scott at their home in Nashville, which seems a bit weird considering they've been together for about 18 minutes.\n\nThat night, Taylor and Tom are spotted dancing together (we're sensing a theme here…) at one of Taylor's squad members Selena Gomez's gigs also in Nashville. They're joined by Tay-Tay's BFF Abigail Anderson and her manfriend Matt.\n\n22 June, 2016. Taylor thinks Tom's The One, apparently. EXCITING!\n\n24 June, 2016. Kanye West releases the video for Famous: the song in which he raps about sleeping with Taylor Swift. The video features a waxwork of Taylor and a whole host of other celebs. We like to think Tom, 35, was a shoulder to cry on for 26-year-old Taylor.\n\n25 June, 2016. It's time for Tom to introduce Taylor to his mum, while they're in England. They then head off to Rome and Australia's Gold Coast, where Tom is due to film the latest Thor movie.\n\n29 June, 2016. Taylor's ex Calvin thinks Taylor is only with Tom so she can be in the running to be a Bond Girl.\n\n4 July, 2016. Here's where it gets a bit embarrassing: Tom wears an 'I heart T.S. T-shirt while celebrating Independence Day together at the her Rhode Island home.\n\nThey're joined by a bunch of her buddies, including Ed Sheeran. Ruby Rose, Ryan Reynolds and his ladywife, Blake Lively. Enter Hiddleswift's social media debut aka the moment Ryan realised he'd make a terrible mistake…\n\nThe world starts questioning whether Hiddleswift is actually a thing, or are they just filming her next music video? But then we decide they're not really in a relationship or making her next music video – they're just filming the next Nicholas Sparks film.\n\n8 July, 2016. We hear Calvin's new single Ole for the first time. And, no big deal, but it's about Taylor and Tom's relationship apparently…\n\n10 July, 2016. Tom's back in Oz for Thor. This is where his gives his first interview about Taylor. It's awkward AF.\n\n14 July, 2016. He has another go at talking about Taylor – this time to The Hollywood Reporter. The Hollywood Reporter. He says: \"Well, um. How best to put this? That notion is — look, the truth is that Taylor Swift and I are together and we're very happy. Thanks for asking. That's the truth. It's not a publicity stunt.\"\n\n13 July, 2016. Rumour has it, Tom's about to propose to Taylor!\n\n15 July, 2016. Official squad member Martha Hunt speaks to People magazine about Taylor and Tom: \"I love that they're both happy and free together. It's amazing. I'm all about people being happy in love.\"\n\n17 July, 2016. Kim Kardashian releases clips of a recorded phone call between her husband Kanye and Taylor, which reveals she did indeed agree to the Famous lyrics. Again, hopefully Tom is at the end of the phone telling Taylor that everything's going to be okay.\n\n22 July, 2016. A source close to Tom says he wants to 'spend the rest of his life' with Taylor.\n\n24 July, 2016. Tom talks about him and Taylor AGAIN: \"I don't know, it comes down to being authentic,\" he tells People. \"Everything you do you have to make sure you truly believe in it and as long as you know that, it doesn't matter what anyone else says about it because the nature of being a public figure is that everyone will have an opinion about anything you do, and as long as you know why you've done something and you've committed to it with authenticity then you're okay.\"\n\n1 August, 2016. Word on the street is that Tom missed out on being the face (and package) of Armani's new underwear line because of Taylor. They didn't want the campaign to be all about their relationship.\n\n9 August, 2016. Tom finally admits it's 2016, and joins Instagram. His first photo is of him dressed up as Thor baddie, Loki sans Taylor. Shame.\n\n11 August, 2016. Holly Willoughby and Phillip Schofield take the piss out of Hiddleswift, and, well, lol.\n\n14 August, 2016. Tom speaks to the media about going out with Taylor aggggggaaaaaaiiiiiiiiinnnnnnn: \"I've learned that there are many sides to a story, and that sometimes there are a lot of stories out there which are false and the hardest thing is to try to not let those falsehoods affect your own life, that's what I would say,\" he tells The Hollywood Reporter.\n\n25 August, 2016. Taylor and Tom have their first fight… *gasp*. Us Weekly says their first \"major argument\" stemmed from his filming schedule for Thor: Ragnarok in Australia. Tom reportedly tries to patch things up by flying to Rhode Island to see Taylor for a \"quick two-day stay.\" Publicly, the two have not been spotted together since their trip to Australia in July.\n\n6 September, 2016. It's reported that Taylor's worried Tom's not with her for the right reasons. According to an insider at DailyMail.com, Taylor feels super \"uncomfortable\" over Tom's desire to be \"so public\" with their romance, and so isn't sure whether she's keen to parade it down the Emmys red carpet on 18th September.\n\n7 September, 2016. Hiddleswift is O-V-E-R according to a number of publications. Us Weekly's sources say the publicity is what caused the relationship's demise. \"Tom wanted the relationship to be more public than she was comfortable with. Taylor knew the backlash that comes with public displays of affection but Tom didn't listen to her concerns when she brought them up.\"\n\n8 September, 2016. Despite what we first thought, Tom's friends insist it was in fact Tom who did the dumping and not Taylor. Interesting.\n\n10 November, 2017: Taylor releases her much-anticipated album Reputation, and fans think there's a song on there about Taylor using Tom to leave Calvin.\n\nThe lyrics include: \"The ties were black / the lies were white / I wanted to leave him, I needed a reason. You were driving the getaway car, we were flying but we'd never get far / But with three of us, honey, it's a side show and a circus ain't a love story and now we're both sorry.\"\n\nRemember the video footage of Tom and Taylor dancing together at the Met Gala 2016? Well that would explain the \"ties were black\" bit. And fans believe that 'Getaway Car' could be a metaphor for Tom helping her to escape her relationship with Calvin, which links to the 'I wanted to leave him, I needed a reason'.\n\nBit of a bummer for everyone involved...\n\nFollow Anna on Twitter.", "images": ["https://hips.hearstapps.com/hmg-prod/images/taylor-swift-performs-onstage-during-night-one-of-taylor-news-photo-1698854598.jpg?crop=0.656xw:0.438xh;0.168xw,0.0522xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=1200:*", "https://hips.hearstapps.com/hmg-prod/images/charli-xcx-and-george-daniel-from-the-1975-are-engaged-65661e9bc8778.png?crop=1.00xw:0.897xh;0,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=300:*", "https://hips.hearstapps.com/hmg-prod/images/best-netflix-releases-december-6565d1e654f4c.jpg?crop=0.484xw:0.967xh;0.277xw,0.0326xh&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/mv5bmjqxntm4mjg1nv5bml5banbnxkftztgwndyynzm4njmat-v1-6565daf26c436.jpeg?crop=0.774xw:1.00xh;0.114xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/tate-mcrae-think-later-track-list-release-date-6565c07c86cdc.jpg?crop=0.666xw:1.00xh;0.176xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=0.667xw:1.00xh;0.167xw,0&resize=2048:*", "http://www.cosmopolitan.com/_assets/design-tokens/cosmopolitan/static/images/logos/logo.3c052be.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/best-gin-gifts-for-christmas-2023-653152f312d4d.jpg?crop=0.505xw:1.00xh;0,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=%2523DA8EEA&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/pinterest.e8cf655.svg?primary=%2523DA8EEA&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=%2523DA8EEA&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/images/logos/ipso-regulated.9922b5a.svg?primary=white", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/play.db7c035.svg?primary=%2523ffffff", "http://www.cosmopolitan.com/_assets/design-tokens/en-gb/static/images/logos/network-logo.eae65ae.svg?primary=%2523ffffff", "https://hips.hearstapps.com/hmg-prod/images/bestoutdoorterracesjustindesouza-1657993858.jpg?crop=0.502xw:0.997xh;0,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/youtube.ce3e1ae.svg?primary=%2523DA8EEA&id=social-button-icon", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/facebook.a5a3a69.svg?primary=%2523DA8EEA&id=social-button-icon", "https://hips.hearstapps.com/vidthumb/images/stt-amber-gill-yt-1641312470.jpg?crop=1xw:1xh;center,top&resize=1200:*", "https://hips.hearstapps.com/rover/profile_photos/d24fe1be-89c2-4f04-a521-5d99b68790df_1574940374.png?fill=1:1&resize=160:*", "https://hips.hearstapps.com/hmg-prod/images/heartstopper-season-3-news-cast-date-64b6878888031.jpg?crop=0.487xw:0.974xh;0.250xw,0&resize=360:*", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/x.3361b6d.svg?primary=currentColor&id=link-out-embed", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/search.f1c199c.svg", "http://www.cosmopolitan.com/_assets/design-tokens/fre/static/icons/social/instagram.f282b14.svg?primary=currentColor&id=link-out-embed", "https://hips.hearstapps.com/hmg-prod/images/best-gin-gifts-for-mum-christmas-2023-653152f312d4d-copy-65428ae646255.jpg?crop=0.5025xw:1xh;center,top&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/molly-mae-and-tommy-together-6565cccad43aa.jpg?crop=0.505xw:1.00xh;0.293xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/squid-game-the-challenge-302-and-301-6565bf69b9910.jpg?crop=0.505xw:1.00xh;0.295xw,0&resize=360:*", "https://hips.hearstapps.com/hmg-prod/images/doctor-who-60th-anniversary-transgender-ripdoctorwho-6564c9d79e391.jpg?crop=0.746xw:0.537xh;0.174xw,0.128xh&resize=360:*"], "top_img": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=1200:*", "keywords": [], "authors": [], "canonical_link": "https://www.cosmopolitan.com/uk/entertainment/news/a45792/taylor-swift-tom-hiddleston-relationship-timeline/", "title": "a timeline of their relationship", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "X-UA-Compatible": "IE=edge,chrom=1", "msapplication-tap-highlight": "no", "title": "Taylor Swift and Tom Hiddleston - a timeline of their relationship", "description": "From dancing at the Met Gala to that Reputation song - here's everything that happened during Taylor and Tom's relationship", "keywords": "taylor swift,Tom Hiddleston, Calvin Harris, taylor swift tom hiddleston, hiddleswift, taylor swift tom hiddleston relationship, taylor swift tom hiddleston relationship timeline, taylor swift tom hiddleston split, taylor swift tom hiddleston break up, taylor swift tom hiddleston photos, taylor swift tom hiddleston reputation, taylor swift tom hiddleston getaway car", "og": {"type": "article", "site_name": "Cosmopolitan", "title": "Fans think this Taylor Swift Reputation song is about her relationship with Tom Hiddleston", "description": "Plus, a timeline of their super-short relationship", "image": {"identifier": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=1200:*", "width": 1200, "height": 600}, "url": "https://www.cosmopolitan.com/uk/entertainment/news/a45792/taylor-swift-tom-hiddleston-relationship-timeline/"}, "theme-color": "#000000", "fb": {"app_id": 211620818858710}, "article": {"publisher": "https://facebook.com/cosmopolitanuk", "section": "Entertainment", "modified_time": "2022-07-29T10:24:35Z", "published_time": "2017-11-10T12:34:00Z"}, "twitter": {"site": "@CosmopolitanUK", "image": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=640:*", "card": "summary_large_image"}, "google-site-verification": "9QqScyr6oRc1iBU6yEjb9Ww8aQvv8v-cCm0TKu2J2iw", "robots": "max-image-preview:large,max-snippet:-1,max-video-preview:30", "thumbnail": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1xw:1xh;center,top&resize=320:*", "sailthru.image.full": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1.00xw:0.502xh;0,0.224xh&resize=320:*", "sailthru.image.thumb": "https://hips.hearstapps.com/hmg-prod/images/legacy-fre-image-placeholder-1655513735.png?crop=1xw:1xh;center,top", "auto-publish": "timely", "sailthru.excerpt": "1 May, 2016. A photo appears of Tom Hiddleston and Idris Elba leaving a dinner held at Anna Wintour's home in new York. But who's that lurking in the background? Why it's Taylor Swift!2 May, 2016. Taylor and Tom dance it up real nice at the Met Gala. But they're", "sailthru.tags": "entertainment,Entertainment", "sailthru.date": "2017-11-10 12:34:00", "sailthru.socialtitle": "Fans think this Taylor Swift Reputation song is about her relationship with Tom Hiddleston", "sailthru.contenttype": "standard-article", "m1": ".content-hed", "m2": ".content-dek p", "next-head-count": 47}, "movies": [], "publish_date": 1510317240.0, "source": "http://www.cosmopolitan.com", "summary": ""}