{"url": "https://en.wikipedia.org/wiki/Larry_Nassar", "text": "American physician, serial child molester\n\nLawrence Gerard Nassar (born August 16, 1963)[4] is an American convicted sex offender, serial child molester, and former sports medicine physician. For 18 years, he was the team doctor of the United States women's national gymnastics team, where he used his position to exploit and sexually assault hundreds of young athletes.\n\nIn 2016, Nassar was charged with sexually assaulting at least 265 young women and girls[5] under the guise of medical treatment.[6][7] His victims included numerous Olympic and United States women's national gymnastics team gymnasts.[8]\n\nNassar was sentenced to 60 years in federal prison on December 7, 2017, after pleading guilty to possession of child pornography and tampering with evidence on July 11, 2017. On January 24, 2018, Nassar was sentenced to an additional 40 to 175 years in Michigan State Prison, after pleading guilty in Ingham County to seven counts of sexual assault.[2][9] On February 5, 2018, he was sentenced to an additional 40 to 125 years in Michigan State Prison after pleading guilty to an additional three counts of sexual assault in Eaton County.[10]\n\nOn the orders of the judge in charge of the federal case, his state prison sentences are to run consecutively with his federal sentence, ensuring a de facto sentence of life imprisonment without parole.[1][2] Nassar will be transferred to a Michigan state prison when he is released from federal custody; his two state sentences will be served concurrently.[11] He is a central figure of the 2020 film Athlete A, a documentary about the scandal.\n\nEarly life and education [ edit ]\n\nNassar was born in Farmington Hills, Michigan in 1963.[12] In 1978, he began working as a student athletic trainer for the women's gymnastics team at North Farmington High School at age 15 on the recommendation of his older brother Mike, who was an athletic trainer at the school. Nassar graduated from North Farmington High School in 1981.[13][14] He studied kinesiology at the University of Michigan, where he earned his undergraduate degree in 1985.[14] During this time, he worked for the university's football and track and field teams.[15]\n\nCareer [ edit ]\n\nIn 1993, Nassar graduated as a Doctor of Osteopathic Medicine from Michigan State University College of Osteopathic Medicine. He completed his residency training in family practice at St. Lawrence Hospital before completing a fellowship in sports medicine in 1997.[15]\n\nHe began working as an assistant professor at MSU's Department of Family and Community Medicine in the College of Human Medicine in 1997, where he earned $100,000 a year (equivalent to $182,297 in 2022[16]).[13] Nassar is listed as a co-author on at least six research papers on the treatment of gymnastics injuries.[17]\n\nSports medicine career [ edit ]\n\nNassar began working as an athletic trainer for the USA Gymnastics national team in 1986.[15] In 1988, Nassar began working with John Geddert at Twistars, a gymnastics training club.[15] He began working as a team doctor at Holt High School in 1996.[15] He served as the national medical coordinator for USA Gymnastics from 1996 until 2014.[15]\n\nSexual assault accusations and convictions [ edit ]\n\nFemale athletes have stated they complained to authorities - including various employees at Michigan State University - about Nassar's behavior starting in at least 1997,[18] with some athletes stating abuse occurred in 1994[7] but USA Gymnastics did not take action against him until 2015. According to court filings and interviews, Maggie Nichols and her coach, Sarah Jantzi, reported Nassar to USA Gymnastics officials on June 17, 2015, after the coach overheard Nichols and another gymnast talking about Nassar's behavior.[19]\n\nIn September 2016, USA Gymnastics cut ties with Nassar \"after learning of athlete concerns\".[20] On September 20, 2016, The Indianapolis Star had reported that Rachael Denhollander and another former gymnast had accused Nassar of sexual abuse.[21] After having been reassigned from clinical and teaching duties in August, Nassar was fired by Michigan State University on September 20, 2016.[20]\n\nIn February 2017, three former gymnasts, Jeanette Antolin, Jessica Howard, and Jamie Dantzscher, gave an interview for 60 Minutes in which they said that Nassar had sexually abused them. They also alleged that the \"emotionally abusive environment\" at the national team training camps run by Béla and Márta Károlyi, at the Karolyi Ranch near Huntsville, Texas, gave Nassar an opportunity to take advantage of the gymnasts and made them afraid to speak up about the abuse.[22] Rachael Denhollander, one of the first women to accuse Nassar publicly,[23] said in court in May 2017 that Nassar had sexually abused her on five doctor's visits in 2000 when she was 15 years old.[24]\n\nIn May 2017, victim impact statements during pre-trial hearings, sentencing, and later interviews, several victims described Nassar's modus operandi: after having gained a girl's trust and friendship, he would insert his ungloved finger into her vagina during physical therapy, describing this as normal \"pressure point\" therapy for pain relief. On some of these occasions a parent was in the room, unaware of what happened.[25][26]\n\nIn October 2017, Olympic gold medalist McKayla Maroney, using the #MeToo hashtag on Twitter, said that Nassar had repeatedly molested her from 2008, when she was 13 years old, until she retired from the sport in 2016.[27] Maroney subsequently filed a lawsuit against Nassar, Michigan State University, the United States Olympic Committee, and USA Gymnastics.[28] The lawsuit accused USA Gymnastics of covering up the sexual abuse by requiring her to sign a non-disclosure agreement in her $1.25 million settlement. Maroney's attorney John Manly called Nassar a \"pedophile doctor\".[29]\n\nIn November 2017, Olympic gold medalist Aly Raisman said during a 60 Minutes interview, that Nassar had also sexually abused her,[30] when she was 15 years old.[31] Gabby Douglas sent a tweet saying that \"dressing in a provocative/sexual way incites the wrong crowd.\"[32] She was criticized for it by fellow Olympic teammate Simone Biles and others, who interpreted the tweet as criticism of Raisman and \"victim-shaming\".[31] Douglas apologized for the tweet[33] and said that she was also a victim of Nassar's abuse.[34]\n\nIn January 2018, former national team member Maggie Nichols said that Nassar abused her. Nassar had connected with her on Facebook and complimented her appearance on numerous occasions. Nichols stated, \"I was only 15 and I just thought he was trying to be nice to me. Now I believe this was part of the grooming process.\"[8] Also in January 2018, Biles came forward with accounts that she, too, had been sexually abused by Nassar.[35] In January 2018, Jordyn Wieber made an impact statement at Nassar's court sentencing, in which she also accused Nassar of sexually abusing her during her time at USA Gymnastics and talked of the effects of the abuse on her life.[36][37]\n\nFBI failure to investigate and FBI false statements [ edit ]\n\nOn September 15, 2021, four elite American gymnasts, McKayla Maroney, Simone Biles, Maggie Nichols, and Aly Raisman, testified before the U.S. Senate regarding the mishandling by FBI agents of abuse allegations brought against Nassar and how the agents made false statements regarding their reports and misinformation about the botched investigation.\n\nMaroney testified that she was met with silence by an FBI agent after telling the agent of Nassar's \"... molestations in extreme detail.\" She further stated that the FBI falsified her statement, said the agents involved should be indicted, and criticized Deputy Attorney General Lisa Monaco for not appearing at the hearing. Raisman testified that the FBI made her feel that the \"abuse didn't count\" but she felt it \"was like serving innocent children up to a pedophile on a silver platter.\" After the testimony by the gymnasts, FBI Director Christopher A. Wray testified, speaking to the gymnasts that he was \"deeply and profoundly sorry that so many people let you down over and over again.\"\n\nAccording to a report issued in July 2021 by the Department of Justice Inspector General Michael Horowitz, at least 70 more athletes were subjected to abuse between the time of reports to the FBI and the arrest of Nassar by state authorities, while Nassar's victims stated that the number abused in that period was 120.[38][39][40]\n\nIn April 2022, 13 of Nassar's victims filed a lawsuit against the FBI for negligence and other alleged investigatory failures related to the investigation.[41]\n\nOn November 22, 2016, Nassar was indicted on several state charges of sexual assault of a child from 1998 to 2005. The crimes allegedly began when the victim was six years old.[42] He was charged with 22 counts of first-degree criminal sexual conduct with minors: 15 in Ingham County and seven in neighboring Eaton County. The allegations asserted that Nassar had molested seven girls under the guise of providing legitimate medical treatment, both at his home and at a clinic on the MSU campus.[43] Bail was set at $1 million, and Nassar was released from jail the same day after posting bond.[44] On December 8, 2016, he was arraigned when he pleaded not guilty to all charges.[45] He remained free on bail until he was arrested after the FBI had found more than 37,000 images of child pornography and a video of Nassar molesting underage girls. He was denied bail and ordered to remain in federal prison.[46]\n\nOn April 6, 2017, his medical license was revoked for three years.[47]\n\nOn July 11, 2017, Nassar pleaded guilty to receiving child pornography in 2004, possession of pornographic images of children dating from 2004 to 2016, and tampering with evidence by destroying and concealing the images. Judge Janet T. Neff sentenced Nassar to 60 years in federal prison (three consecutive terms of 20 years) on December 7, 2017, followed by supervised release for the rest of his life.[1]\n\nOn November 22, 2017, Nassar pleaded guilty in Ingham County Circuit Court to seven counts of first-degree criminal sexual conduct with minors under the age of 16. He admitted to molesting seven girls, three of whom were under the age of 13. He pleaded guilty to an additional three counts of first-degree criminal sexual conduct in Eaton County on November 29.[48] As of January 18, 2018, 135 women had accused Nassar of sexual assault while he worked for USA Gymnastics and Michigan State University.[49] During the following week, the number rose to 150.[50] In a lawsuit that was filed in April 2017, a woman claimed that Nassar had sexually assaulted her while he was in medical school in 1992.[7]\n\nOn January 24, 2018, Judge Rosemarie Aquilina of Ingham County sentenced Nassar to a minimum of 40 to a maximum of 175 years in prison for the sexual assault of minors.[9] Upon release, Nassar would have to register as a Michigan sex offender for the rest of his life. That part of the sentence was purely symbolic, as Nassar’s federal and state sentences are consecutive, essentially guaranteeing he will die in prison. Aquilina allowed Nassar's accusers to present extended victim impact statements and dismissed objections raised to this ruling by Nassar.[49] During the sentencing, the judge informed Nassar that he had missed numerous chances to receive treatment for his sexual urges, as Nassar had been aware of these urges himself from a young age. She also said that there were likely dozens of additional victims who had not come forward, and made it clear that Nassar will never be free again.[2]\n\nNassar was practicing without a Texas medical license while he worked at the Karolyi Ranch, which since 2001 had been the USA Gymnastics designated U.S. Women's National Gymnastics Training Center in Huntsville, Texas. According to McKayla Maroney, this was where Nassar molested young women for more than 15 years. Practicing medicine without a license in Texas is a third-degree felony, although it is rarely prosecuted.[51] On January 31, 2018, a Michigan judge said that there were \"over 265 identified victims and an infinite number of victims\" of sexual misconduct.[5]\n\nOn February 5, 2018, Judge Janice Cunningham of Eaton County sentenced Nassar to a minimum 40 to a maximum of 125 years in prison for the three counts of criminal sexual assault to which he had pleaded November 29, 2017.[52] Nassar apologized for his years of abuse, saying that the strong effects that his victims' statements had on him \"pales in comparison\" to the suffering he inflicted on them. Despite this, Cunningham stated that Nassar was still in \"denial\" about the \"devastating impact\" of his crimes.[11] The Eaton County sentence will run concurrently with the Ingham County sentence. Nassar's state sentences will begin upon completion of his federal child pornography sentence. Neff ordered any sentences imposed at the state level to run consecutively with the federal sentence.[1][2][52]\n\nIncarceration [ edit ]\n\nNassar spent time in the Eaton County jail and the federal detention center at FCI Milan near Milan, Michigan. In February 2018, he was transferred to the United States Penitentiary (USP) in Tucson, Arizona.[53] According to his lawyers, Nassar was assaulted almost as soon as he was placed in the general population at USP Tucson, and an investigation determined that Nassar could not be safely held at Tucson.[54] In August 2018, The Detroit News reported that Nassar was transferred to the Federal Transfer Center in Oklahoma City, Oklahoma, and was moved to the United States Penitentiary, Coleman in Florida shortly afterward,[55] where he would remain until July 2023.[56]\n\nOn July 9, 2023, Nassar was stabbed by another inmate who was upset by a lewd comment Nassar made about girls while they were watching Wimbledon on TV. He was stabbed twice in the neck, six times in the chest, twice in the back, and suffered a collapsed lung. He survived the attack in stable condition.[57][58] After being treated at a nearby hospital, he was transferred to USP Lewisburg, and is currently serving his time there.[56][59]\n\nNassar's earliest potential release from federal prison is January 30, 2068. He will likely die serving his federal sentence, as it far exceeds human life expectancy, and his earliest possible release will be when he is 104 years old. However, if Nassar is still alive when he becomes eligible for release from federal prison, upon his release he would be immediately transferred to a Michigan state prison to serve his concurrent state sentences. He would then have to serve a minimum of 40 years in state prison before being eligible for parole. Per Aquilina, if Nassar survives, he will have to register as a sex offender in Michigan for the rest of his life.\n\nAftermath [ edit ]\n\nAs of 2018, more than 150 federal and state lawsuits had been filed against Nassar, Michigan State University, the US Olympic Committee, USA Gymnastics, and the Twistars Gymnastics Club.[60] The entire 18 member board of USA Gymnastics, including Steve Penny, tendered their resignations. Michigan State University (MSU) President Lou Anna Simon and MSU Director of Athletics Mark Hollis have both resigned, and other MSU officials are also under scrutiny.[61]\n\nNassar's crimes committed at MSU and USA Gymnastics have drawn comparisons to coach Jerry Sandusky's sexual abuse crimes at Penn State University.[62] In both of these cases, institutional authorities \"turned the other way\" or tried to hide the activities of a child molester instead of immediately contacting law enforcement.[63][64]\n\nMichigan Attorney General Bill Schuette promised a full investigation into how Nassar was able to abuse young women for decades while working at the state's university.[65] MSU agreed to pay $500 million to 332 of Nassar's alleged victims, settling lawsuits filed by the victims. This was the largest amount of money in history settled by a university for a sexual abuse case.[66] On Christmas Eve 2019, Schuette's successor, Dana Nessel, announced that she was suspending the investigation.[67]\n\nMore than 140 victims of Nassar's abuse appeared on stage together at the Microsoft Theater in Los Angeles, California, on July 18, 2018, to receive the Arthur Ashe Award for Courage at the 2018 ESPY Awards ceremony. Gymnasts Sara Klein and Aly Raisman and softball player Tiffany Thomas Lopez accepted the award on everyone's behalf and served as spokeswomen. Klein identified herself as Nassar's first victim 30 years before.[68][69] They acknowledged lead detective Andrea Munford of the Michigan State Police, former assistant Attorney General Angela Povilaitis, and Judge Rosemarie Aquilina of the 30th circuit court in Ingham County, Michigan for their work. Aquilina also attended the ceremony, and singer MILCK performed her song \"Quiet\",[70] written from her own experience of sexual abuse.[71]\n\nIn late July 2018, it was reported that Nassar was seeking a new sentencing hearing due to concerns of perceived bias by Aquilina,[72] but his request was denied by Eaton County Judge Janice Cunningham.[73]\n\nIn 2019, HBO released a documentary about Nassar's serial sexual abuse and subsequent cover-ups by the various institutions he worked with, titled At the Heart of Gold: Inside the USA Gymnastics Scandal. The 2020 Netflix documentary Athlete A is also based on Nassar's scandal and crimes. Later that year, Nassar's request for a sentencing hearing for the Ingham County charges, in addition to the accusations of Aquilina being biased, were rejected by the Michigan Court of Appeals.[74]\n\nOn July 9, 2023, Nassar was stabbed 10 times in prison.[75] The stabbing was allegedly motivated by lewd remarks Nassar made while watching the 2023 Wimbledon Championships.[76] Nassar was stabbed twice in the neck, twice in the back and six times in the chest that culminated in a pneumothorax.[77][78] Four other inmates came to witness the scene as Nassar screamed prompting the correctional officers of the facility to perform life-saving measures on Nassar. [79][80][81] This incident was the second time Nassar has been attacked while in federal custody.\n\nPersonal life [ edit ]\n\nFrom 1996 to 2017, Nassar was married to his wife, Stefanie, and the couple had three children together. Nassar lived in Holt, Michigan, at the time of his December 2016 arrest. The couple separated after he was arrested on suspicion of sex crimes, and his wife was granted a divorce in July 2017, gaining full custody of their children.[82][83]\n\nSee also [ edit ]\n\nNotes [ edit ]\n\n^ 100 to 235 years imprisonment\n\nFederal\n\n60 years imprisonment, sentenced on December 7, 2017\n\nMichigan\n\n40 to 175 years imprisonment, sentenced on January 24 and February 5, 2018", "images": ["https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://upload.wikimedia.org/wikipedia/en/thumb/7/74/Larry_Nassar.jpg/220px-Larry_Nassar.jpg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://upload.wikimedia.org/wikipedia/commons/thumb/5/53/Ambox_current_red_Americas.svg/42px-Ambox_current_red_Americas.svg.png", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Larry_Nassar", "title": "Larry Nassar", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/en/7/74/Larry_Nassar.jpg", "width": 640, "height": 875}, "title": "Larry Nassar - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}