{"url": "https://www.wanttoknow.info/newsstories-0-10000", "text": "News Stories Excerpts of Key News Stories in Major Media\n\nThis comprehensive list of news stories is usually updated once a week. Explore our full index to revealing excerpts of key major media news stories on several dozen engaging topics. And don't miss amazing excerpts from 20 of the most revealing news articles ever published.\n\n2023-11-10, The BMJ (Formerly British Medical Journal)\n\nPosted: 2023-11-26 17:42:39\n\nThe Vaccine Adverse Event Reporting System (VAERS) ... collects reports of symptoms, diagnoses, hospital admissions, and deaths after vaccination. VAERS is supposed to be user friendly, responsive, and transparent. However, investigations by The BMJ have uncovered that it’s not meeting its own standards. Not only have staffing levels failed to keep pace with the unprecedented number of reports since the rollout of covid vaccines but there are signs that the system is overwhelmed. In the face of an unprecedented 1.7 million reports since the rollout of covid vaccines, VAERS’s staffing was likely not commensurate with the demands of reviewing the serious reports submitted, including reports of death. While other countries have acknowledged deaths that were “likely” or “probably” related to mRNA vaccination, the CDC—which says that it has reviewed nearly 20,000 preliminary reports of death using VAERS (far more than other countries)—has not acknowledged a single death linked to mRNA vaccines. In November 2022, React19, an advocacy group of some 30,000 people who have experienced prolonged illness after covid vaccination, reviewed 126 VAERS reports among its ranks. 22% had never been given a permanent VAERS ID number and 12% had disappeared from the system entirely. The BMJ has found that the FDA and CDC essentially maintain two separate VAERS databases: a public facing database, containing only initial reports; and a private, back end system containing all updates and corrections—such as a formal diagnosis, recovery, or death.\n\nNote: Vaccine adverse event numbers on VAERS are made publically available here, and only capture a portion of the actual vaccine injuries. Albert Benavides is a VAERS researcher who recently wrote a comprehensive Substack piece investigating the corruption and dysfunction of the VAERS system, including how the VAERS system even deleted dead Pfizer Trial patients. Another excellent article explores these concerning implications from the perspective of cardiologists, physicians, and science researchers.\n\n2023-11-13, Rolling Stone\n\nPosted: 2023-11-26 17:39:51\n\nThis year marks the 60th anniversary of John F. Kennedy’s assassination. JFK: What the Doctors Saw [is] a documentary featuring previously unreleased footage — and the testimony of seven doctors who were there in the emergency room of Parkland Hospital trying to save the then-president’s life after he was shot as his motorcade passed through Dealey Plaza on Nov. 22, 1963. The film raises serious doubts about whether Lee Harvey Oswald acted alone in killing JFK (Oswald was shot to death two days later by local nightclub owner Jack Ruby as he was escorted through the Dallas Police building). “I became involved with the story because one of my personal physicians told me he was in the emergency room at Parkland Hospital when JFK was brought in,” Jacque Lueth, the film’s executive producer who interviewed the seven Parkland doctors, [said]. “He introduced me to six of the other doctors who were there that day and when I interviewed them, I began to realize their observations from Trauma Room 1 didn’t match the government story.” She adds, “Based upon my interviews with the doctors, Jim Jenkins and Robert Tanenbaum, and my own research, there’s no question in my mind there was a government cover-up.” The doctors in the film contend one of the bullets that hit JFK entered through his throat, meaning it was an entrance wound from the front — and that there were potentially two gunmen, with Oswald firing from the rear.\n\nNote: Explore concise summaries of revealing news articles on the JFK assassination from reliable major media sources. For more along these lines, check out our JFK Assassination Information Center.\n\n2023-11-15, CNN News\n\nPosted: 2023-11-26 17:37:43\n\nPesticides used in our homes, gardens and lawns and sprayed on foods we eat are contributing to a dramatic decline in sperm count among men worldwide, according to a new analysis of studies over the last 50 years. “Over the course of 50 years, sperm concentration has fallen about 50% around the world,” said senior study author Melissa Perry. “While there are likely many more contributing causes, our study demonstrates a strong association between two common insecticides —organophosphates and N-methyl carbamates — and the decline of sperm concentration.” Organophosphates are the main components of nerve gas, herbicides, pesticides and insecticides and are also used to create plastics and solvents. They are widely used in agriculture on the crops we eat. We use them in structural applications within homes and buildings. N-methyl carbamates are structurally and operationally similar to organophosphates, killing insects by damaging their brains and nervous systems. The study, published ... in the journal Environmental Health Perspectives, examined 25 studies around the world on the two chemicals. Those studies looked at 42 different levels of impact among 1,774 men in 21 different study populations. Men who were more highly exposed to the pesticides, such as those who work in agriculture, had significantly less sperm concentration than men who had the least exposure to organophosphates and N-methyl carbamates, the study found.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health and food system corruption from reliable major media sources.\n\n2023-11-02, The Hill\n\nPosted: 2023-11-26 17:35:46\n\nA federal appeals court on Thursday is tossing the Environmental Protection Agency’s (EPA) ban on a pesticide that has been linked to brain damage in children. The decision from the 8th Circuit Court of Appeals to send the rule back to the agency does not preclude the agency from reinstating the ban in the future. But it said the EPA needs to give greater consideration to whether there are cases where the pesticide, called chlorpyrifos, could be used safely. Chlorpyrifos has been used as an insecticide, protecting crops like soybeans, broccoli, cauliflower and fruit trees. The EPA banned chlorpyrifos for use in growing food in 2021. That came after a prior court ruling gave the agency just 60 days to either find a safe use for chlorpyrifos or ban it outright. The appeals court determined that this deadline contributed to a rushed decision from EPA that was ultimately “arbitrary and capricious.” The ruling comes from Judges Lavenski Smith, Raymond Gruender and David Stras, two of whom were appointed by former President George W. Bush and one of whom was appointed by former President Trump. The chlorpyrifos issue has ping-ponged between administrations. The Obama administration had proposed to ban its use on food, but the Trump administration reversed course and had proposed to allow some uses of the chemical.\n\nNote: Did you know that chlorpyrifos was originally developed by Nazis during World War II for use as a nerve gas? Read more about the history and politics of chlorpyrifos, and how U.S. regulators relied on falsified data to allow its use for years. See other concise news articles we've summarized about the harms of chlorpyrifos.\n\n2023-11-17, Nature\n\nPosted: 2023-11-26 17:33:50\n\nThe European Commission says it has decided to renew the license for the weedkiller compound glyphosate, approving its use in European Union countries for ten more years. Following the decision yesterday, the Commission released a statement saying that, on the basis of comprehensive safety assessments carried out by the European Food Safety Authority (EFSA) and the European Chemicals Agency (ECHA), it would renew the licence, “subject to certain new conditions and restrictions”. These include a ban on the use of the chemical to dry crops before harvest, and “the need for certain measures to protect non-target organisms”. Governments can still restrict the use of glyphosate in their own countries if they consider the risks too high. Glyphosate is the active ingredient in Roundup, the world’s most widely used herbicide. Some studies point to a link between glyphosate and certain cancers. Robin Mesnage, a toxicologist at King’s College London, welcomes the Commission’s decision to continue to allow the use of glyphosate. Others have expressed disappointment. “It is unacceptable that the Commission still plans to go ahead with its proposal, considering the amount of scientific evidence of the substance’s health impacts,” says Natacha Cingotti, a campaigner at the Health and Environment Alliance. “While we can’t undo the decades of exposure, the Commission can still seize the opportunity to turn the tide towards more sustainable agricultural practices.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the food system from reliable major media sources.\n\n2023-11-09, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-26 17:32:09\n\nThe US must acknowledge the right to food in order to transform its broken food system in the post-pandemic era and make it more resilient in the face of the climate crisis and biodiversity loss, according to a United Nations hunger expert. “Whether we’re talking about right to food, food justice or food sovereignty, there has been growing momentum over the last 10 years to understand that food is not just something we just leave to be determined by what is available or by corporations or the status quo,” said Michael Fakhri, the UN special rapporteur on the right to food. Last month, Fakhri presented a report on the right to food – which would entail that adequate food be available and accessible to all people – as a means of food system recovery and transformation to the UN general assembly. The right to food, which can also be characterized as a right to culturally appropriate nutrition that a person needs to live a healthy and active life, is recognized in the UN’s 1948 Universal Declaration of Human Rights and is enshrined in the 1966 International Covenant on Economic, Social and Cultural Rights. In 2021, the US and Israel were the only countries to vote against a United Nations committee’s draft that asserted food as a human right. The draft also expressed alarm that the number of people lacking access to adequate food rose by 320 million to 2.4 billion in 2020 – nearly one-third of the world’s population. In 2022, 44.2 million people in the US lived in food-insecure households.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on corruption in government and in the food system from reliable major media sources.\n\n2023-11-16, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-26 17:30:34\n\nHigh-income Americans are almost as likely to defer healthcare because of cost as people with low or average incomes in eight other developed countries, a new survey brief by the Commonwealth Fund finds. The survey findings also show that nearly half of American adults (46%) faced a problem with a medical bill in the last year, and almost half with low or average incomes (46%) skipped or delayed needed care because of price – the highest rate in any of nine countries analyzed. “In some cases, lower-income people in other countries are better off than higher-income Americans,” said Munira Gunja, lead author of the study. Decades of research shows the US health system is both wildly expensive and inefficient. Internationally, it has been seen as a kind of \"bogeyman\" and as a way not to structure a health system, according to the late Princeton University health economist Uwe Reinhardt. A staggering 18% of US GDP goes to healthcare spending, the highest in the world, and the logical result of the highest healthcare prices of any nation. Despite runaway spending, Americans also have among the worst outcomes. Recent work by population researchers at Virginia Commonwealth University, found US life expectancy has slipped for decades and now ranks 46th among 200 nations. The US is also the only nation surveyed without guaranteed universal health coverage for every citizen.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources. Then explore the excellent, reliable resources provided in our Health Information Center.\n\n2023-11-20, Wall Street Journal\n\nPosted: 2023-11-26 17:28:33\n\nThe U.S. was in a fit of Covid panic during Thanksgiving week two years ago. By month’s end, Pfizer’s stock-market value had surpassed $300 billion, up 50% from the start of the pandemic. Moderna’s shares had soared by more than 1,000% over the same period. In 2022 Pfizer became the first pharmaceutical company to book more than $100 billion in annual sales owing to government purchases of its vaccines and antiviral pill. Fast-forward to today. The pandemic is over. Demand for Covid vaccines and treatments has plunged. Pfizer’s total revenue has fallen more than 40% since last year. Earlier this month the company took a $5.5 billion write-off on its Covid products owing to “lower-than-expected demand.” Only 14% of American adults have received the latest updated booster shots. The jabs’ greatest benefit was in providing political leaders with the courage to lift destructive lockdowns and mask mandates. The vaccines were supposed to be a two-shot-and-done regimen, not blockbuster medicines that rung up tens of billions of dollars in sales every year with government support. Statins and diabetes medicines prevent heart attacks, but the government doesn’t run ads urging Americans to use Lipitor or Ozempic. The government’s vaccine boosterism ... has increased public cynicism toward pharmaceutical companies. Drug makers can dine out on any given medicine only for so long before needing to cook up another pharmaceutical bonanza.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma profiteering and coronavirus vaccines from reliable major media sources.\n\n2023-11-20, The Defender\n\nPosted: 2023-11-26 17:26:59\n\nThe Board of Representatives in Stamford, Connecticut, earlier this month voted to reject a model agreement that would have allowed AT&T and Verizon to install 5G equipment on city-owned utility poles. In a bid to get 5G swiftly installed in his state, Gov. Ned Lamont’s office created a template contract between the nation’s top two telecommunication carriers and the state’s five major cities. Stamford, the state’s second-largest city, is the only city so far to have voted against using the contract. [City] representatives were largely persuaded by presentations by six independent experts on the scientific evidence of harm from radiofrequency (RF) radiation, including 5G. The experts, including toxicologist and epidemiologist Devra Davis, Ph.D., MPH, said there were many documented health and environmental impacts of wireless radiation, including brain damage, memory loss, decline in reproductive function, DNA damage and harm to insects. “Confronted with overwhelming, independent scientific information about the real and present dangers of bringing electromagnetic fields closer to humans than ever before, Stamford voted to protect people,” [said Davis]. Some representatives, like City Rep. Don Mays, worried that rejecting the pact would mean AT&T and Verizon would sue the city. A 2018 ruling by the Federal Communications Commission (FCC) blocks states and municipalities from taking actions that would impede or delay the rollout of 5G technology.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on the risks and dangers of wireless technologies from reliable major media sources.\n\n2023-11-15, The Examination\n\nPosted: 2023-11-26 17:25:16\n\nFederal regulators announced warnings against two major food and beverage industry groups and a dozen nutrition influencers on Wednesday, as part of a broad action to enforce stricter standards for how companies and social media creators disclose paid advertising. The Federal Trade Commission sent warning letters on Monday to American Beverage, a lobbying group whose members include Coca-Cola and PepsiCo, as well as the Canadian Sugar Institute and a dozen health influencers who collectively have over 6 million followers on TikTok and Instagram. The agency flagged nearly three dozen social media posts that it said failed to clearly disclose who was paying the influencers to promote artificial sweeteners or sugary foods. The action follows a months-long investigation by The Examination and The Washington Post that revealed how the food and beverage industry had enlisted popular dietitians to promote industry-friendly messages on social media posts that often failed to disclose the names of sponsors. Social media marketing ... has been described as the Wild West of advertising. Over $6 billion is expected to be spent on influencer marketing in the United States in 2023. The enforcement action is the first the FTC has taken against major food and beverage industry groups for social media marketing. The agency urged the trade groups and nutrition influencers to remove posts or add proper disclosures and noted that future failures could trigger fines of more than $50,000 for each violation.\n\nNote: Read how cereal giant Kellogg used fake experts to sell its sugary cereals. For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\n2023-10-05, Smithsonian Magazine\n\nPosted: 2023-11-26 17:23:17\n\nFor millennia, humans have used dried natural sponges to clean up, to paint and as vessels to consume fluids like water or honey. Whether synthetic or natural, sponges are great at ensnaring tiny particles in their many pores. And, as scientists around the world are beginning to show, sponges’ cavity-filled forms mean they could provide a solution to one of our era’s biggest scourges: microplastic pollution. In August, researchers in China published a study describing their development of a synthetic sponge that makes short work of microscopic plastic debris. In tests, the researchers show that when a specially prepared plastic-filled solution is pushed through one of their sponges, the sponge can remove both microplastics and even smaller nanoplastics from the liquid. Optimal conditions allowed the researchers to remove as much as 90 percent of the microplastics. The plastic-gobbling sponges are made mostly from starch and gelatin. Looking a bit like large white marshmallows, the biodegradable sponges are so light that balancing one atop a flower leaves the plant’s petals upright and unyielding, which the researchers suggest ought to make them cheap and easy to transport. The sponges, if ever produced at an industrial scale ... could be used in wastewater treatment plants to filter microplastics out of the water or in food production facilities to decontaminate water. It would also be possible to use microplastic-trapping sponges like this in washing machines.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-11-16, Reasons to be Cheerful\n\nPosted: 2023-11-26 17:21:52\n\nMicroplastics — solid plastic particles up to five millimeters in size that are not biodegradable — are pretty much everywhere. They have been detected in over 1,500 different marine animal species. They also find their way into our bodies via the water cycle and the food chain. In fact, the average person consumes up to five grams of microplastics per week. The European Union has now banned intentionally added microplastics. This applies to plastic glitter or polyethylene particles used as abrasives in scrubs, shower gel and toothpaste (these have been banned in the US since the 2015 Microbead-Free Waters Act). Under the terms of the ban, some products, such as plastic glitter found in creams or eye shadow, have been granted a transitional period to give manufacturers a chance to develop new designs. LUSH and The Body Shop are among the companies that have long been offering natural alternatives, using ground nuts, bamboo, sea salt and sugar. Beiersdorf AG ... has not used microbeads for exfoliation purposes since 2015. Instead, it has used, for example, cellulose particles or shredded apricot kernels. Since the end of 2019, all Beiersdorf wash-off products have been free of microplastics. Before the EU ban, Germany stopped providing public funding for artificial turf pitches with granules containing a high proportion of microplastic. As a result, the country already has hundreds of pitches that are filled with cork and sand instead of microplastics.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-11-17, BBC News\n\nPosted: 2023-11-26 17:20:26\n\nA New York City woman who died of ovarian cancer has raised enough money to pay off millions of dollars in other people's medical debts. In a social media post she arranged to be posted after her death, Casey McIntyre, 38, asked followers to consider donating to her cause. She said she planned to pay off other people's medical debt as a way of celebrating her life. She wrote on social media: \"if you're reading this I have passed away.\" \"I loved each and every one of you with my whole heart and I promise you, I knew how deeply I was loved... to celebrate my life, I've arranged to buy up others' medical debt and then destroy the debt.\" She added that she was lucky to have access to high-quality medical care while battling stage four ovarian cancer and wanted others to have the same. McIntyre and her family ... raised over $170,000 (£136,000) for her campaign with non-profit RIP Medical Debt. The organisation pays off a dollar of medical debt for every penny that is donated, meaning McIntyre's campaign has helped erase up to $17m in unpaid medical bills. The organisation says it buys medical debt \"in bundled portfolios, millions of dollars at a time at a fraction of the original cost\". \"On average, whatever you donate has 100x the impact,\" it says on its website. In the social media post announcing her own death, McIntyre's family included a note that they would have a memorial service ... where they would celebrate her life by anonymously purchasing and forgiving other's medical debt.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-11-08, NBC News\n\nPosted: 2023-11-19 15:04:06\n\nThree people have been arrested and charged in connection with running “high-end brothels” in the Boston area and Northern Virginia. Prosecutors said the Massachusetts brothels were in Cambridge and Watertown, and the Virginia locations were in Fairfax and Tysons, primarily with Asian women in both states. The defendants are Han Lee, 41, of Cambridge, Massachusetts; Junmyung Lee, 30, of Dedham, Massachusetts; and James Lee, 68, of Torrance, California. All three were charged with conspiracy to coerce and entice to travel to engage in illegal sexual activity. \"These customers spanned a wide array of different professional disciplines,\" the case agent said in court documents. “Some of these professional disciplines included, but are not limited to, politicians, pharmaceutical executives, doctors, military officers, government contractors that possess security clearances, professors, lawyers, business executives, technology company executives, scientists, accountants, retail employees, and students.” Investigators also said that James Lee made deposits in his personal and business bank accounts since January 2020 that totaled $4.5 million. More than $550,000 of Covid relief funds, the agent wrote, were among those deposits. Investigators acquired records from the Small Business Administration that ... show James Lee applied for these loans for various businesses, including one listed as E.P.A. Green Services, and potentially under different identities.\n\nNote: This case echoes the case of D.C. Madam Deborah Jeane Palfrey, who ran a prostitution ring catering to elite clients. Jeane reportedly hung herself before all of the details of her operation could come out. Learn about other major sexual abuse scandal cover-ups that took place in the highest levels of government.\n\n2023-11-08, Washington Post\n\nPosted: 2023-11-19 15:02:16\n\nThree people have been arrested in connection with operating high-end brothels in Virginia and the Boston area that served an exclusive clientele of elected officials, military officers, government contractors with security clearances and myriad other professionals, according to federal investigators. Since at least July 2020, prosecutors allege that Han Lee, 41, James Lee, 68, and Junmyung Lee, 30, ran brothels that advertised primarily Asian women under the guise that they were nude models selling their services to professional photographers. The brothels’ clients, which prosecutors allege could number in the hundreds, also included tech and pharmaceutical executives, doctors, professors, lawyers, scientists and accountants. The allegations mirror a sex service that for 13 years catered to Washington’s political elite, including a sitting senator. Known as the D.C. Madam, Deborah Jeane Palfrey was convicted of running that operation in 2008. Records of her ring included the names of 815 clients, and in 2016, Palfrey’s former lawyer said her phone records “could be relevant” to the presidential election. A judge later blocked the release of those records. To make an appointment with a brothel, a prospective client had to go through a verification process that included filling out a form with their name, emails, phone numbers, employers and a reference, court filings alleged. They also had to submit a photo of themselves and credit card information.\n\nNote: The D.C. Madam Deborah Jeane Palfrey mentioned above reportedly hung herself in 2008. More recently, Jeffrey Epstein reportedly hung himself in a jail cell while awaiting trial for running a child sex ring involving powerful people. In both cases, the identities of elite sex buyers were shielded from public scrutiny by authorities. Learn about other major sexual abuse scandal cover-ups that took place in the highest levels of government.\n\n2023-11-12, New York Post\n\nPosted: 2023-11-19 15:00:00\n\nThe Justice Department has just posted a new jobs ad — it’s looking for eight new attorneys to defend the federal government in vaccine injury cases. Presumably, the hiring spree is in anticipation of a surge of COVID vaccine lawsuits, as people who were forced by government mandates to take the jab, and suffered serious side effects as a result, try to extract compensation from a system that is stacked against them. “The office is currently expanding to address workload created by an increase in cases filed under the Vaccine Act,” reads the ad posted by the Torts Branch of the DOJ on the USAJobs website. The recruitment drive comes on the heels of a little-noticed lawsuit filed in Louisiana last month by six vaccine-injured plaintiffs against the federal government. The suit aims to overturn the legal immunity that pharmaceutical giants like Pfizer and Moderna enjoy on their COVID shots. Meanwhile, almost 13,000 Americans who claim the COVID vaccine caused them or their dead loved ones adverse reactions ... remain in limbo after doing what they were told was “the right thing”: heeding government mandates to submit to the jab. The unaccountable, understaffed government tribunal that presides over the so-called Countermeasures Injury Compensation Program (CICP), for vaccines administered under emergency measures, is a “kangaroo court,” says the lawsuit filed by attorney Aaron Siri, partner at New York firm Siri & Glimstad.\n\nNote: Learn about the legal landmark case in the UK alleging significant injuries and damages from the AstraZeneca COVID vaccine. For more along these lines, see concise summaries of revealing news articles on government corruption and coronavirus vaccines from reliable major media sources.\n\n2023-11-05, The Economist\n\nPosted: 2023-11-19 14:58:38\n\nNew Yorkers may have noticed an unwelcome guest hovering round their parties. In the lead-up to Labour Day weekend the New York Police Department (NYPD) said that it would use drones to look into complaints about festivities, including back-yard gatherings. Snooping police drones are an increasingly common sight in America. According to a recent survey by researchers at the Northwestern Pritzker School of Law, about a quarter of police forces now use them. Among the NYPD’s suppliers is Skydio, a Silicon Valley firm that uses artificial intelligence (AI) to make drones easy to fly. The NYPD is also buying from BRINC, another startup, which makes flying machines equipped with night-vision cameras that can smash through windows. Facial-recognition software is now used more widely across America, too, with around a tenth of police forces having access to the technology. A report released in September by America’s Government Accountability Office found that six federal law-enforcement agencies, including the FBI and the Secret Service, were together executing an average of 69 facial-recognition searches every day. Among the top vendors listed was Clearview AI. Surveillance capabilities may soon be further fortified by generative AI, of the type that powers ChatGPT, thanks to its ability to work with “unstructured” data such as images and video footage. The technology will let users “search the Earth for objects”, much as Google lets users search the internet.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on police corruption and the disappearance of privacy from reliable major media sources.\n\n2023-11-12, The Intercept\n\nPosted: 2023-11-19 14:56:59\n\nOver the last century, the U.S. military has shown a consistent disregard for civilian lives. It has repeatedly cast or misidentified ordinary people as enemies; failed to investigate civilian harm allegations; excused casualties as regrettable but unavoidable; and failed to prevent their recurrence or to hold troops accountable. These long-standing practices stand in stark contrast to the U.S. government’s public campaigns to sell its wars as benign, its air campaigns as precise, its concern for civilians as overriding, and the deaths of innocent people as “tragic” anomalies. Such campaigns have mainly served to obscure the true toll of the American way of war, from the “banana wars” of the 1920s to the “forever wars” a century later. During the first 20 years of the war on terror, the U.S. conducted more than 91,000 airstrikes across seven major conflict zones — Afghanistan, Iraq, Libya, Pakistan, Somalia, Syria, and Yemen — and killed up to 48,308 civilians, according to a 2021 analysis by Airwars, a U.K.-based airstrike monitoring group. A 2020 study of post-9/11 civilian casualty incidents found most have gone uninvestigated. When they do come under official scrutiny, American military witnesses are interviewed while civilians — victims, survivors, family members — are almost totally ignored, “severely compromising the effectiveness of investigations,” according to the Center for Civilians in Conflict and Columbia Law School’s Human Rights Institute.\n\nNote: The profit motive behind these wars was clearly described in 1935 by General Smedley Butler in War is a Racket. For more along these lines, see concise summaries of deeply revealing news articles on war from reliable major media sources.\n\n2023-11-08, New York Times\n\nPosted: 2023-11-19 14:55:26\n\nChief Master Sgt. Ron Lerch of the U.S. Space Force sat down in his office in Los Angeles one morning in September to deliver a briefing known as a threat assessment. The current “threats” in space are less sci-fi than you might expect, but there are a surprising number of them: At least 44,500 space objects now circle Earth, including 9,000 active satellites and 19,000 significant pieces of debris. What’s most concerning isn’t the swarm of satellites but the types. “We know that there are kinetic kill vehicles,” Lerch said — for example, a Russian “nesting doll” satellite, in which a big satellite releases a tiny one and the tiny one releases a mechanism that can strike and damage another satellite. China, whose presence in space now far outpaces Russia’s, is launching unmanned “space planes” into orbit, testing potentially unbreakable quantum communication links and adding A.I. capabilities to satellites. An intelligence report, Lerch said, predicted the advent, within the next decade, of satellites with radio-frequency jammers, chemical sprayers and lasers that blind and disable the competition. All this would be in addition to the cyberwarfare tools, electromagnetic instruments and “ASAT” antisatellite missiles that already exist. Space Force leaders readily describe their guardians as working toward a state of combat readiness, even as they hope an era of actual conflict never arrives. As space becomes commercialized, it increasingly becomes a geopolitical arena for competition too.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-11-10, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-19 14:54:02\n\nNine of the 12 members of a high-level congressional commission charged with advising on the US’s nuclear weapons strategy have direct financial ties to contractors that would benefit from the report’s recommendations or are employed at thinktanks that receive considerable funding from weapons manufacturers. While the Congressional Commission on the Strategic Posture of the United States (CCSPUS) purports to recommend steps to avoid nuclear conflict, it does nothing to disclose its own potential conflicts of interest with the weapons industry in its final report or at rollout events. “What we’ve consistently seen is the nuclear weapons industry buying influence and that means we cannot make serious decisions about our security when the industry is buying influence through thinktanks and commissioners that are skewing the debate,” said Susi Snyder, program coordinator at the International Campaign to Abolish Nuclear Weapons. “Instead of having a debate about the tools and materials we need to make ourselves safe,” she added, “we’re having a debate about which company should get the contracts.” The most recognizable member of the CCSPUS is its vice-chair, Jon Kyl, who served as a senator. In 2017 Kyl, personally, was registered to lobby for Northrop Grumman, which manufactures the B-21 nuclear bomber that the commission recommends the US should purchase in greater numbers, at a cost to taxpayers of nearly $700m each.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-11-07, CNN News\n\nPosted: 2023-11-19 14:52:27\n\nMeta’s top executives, including CEO Mark Zuckerberg, ignored warnings for years about harms to teens on its platforms such as Instagram, a company whistleblower told a Senate subcommittee. Meta instead fosters a culture of “see no evil, hear no evil” that overlooks evidence of harm internally while publicly presenting carefully crafted metrics to downplay the issue, said Arturo Bejar, an ex-Facebook engineering director and consultant. Bejar is the latest former insider to level public allegations that the tech giant knowingly turns a blind eye to problems that its policies and technology cannot cheaply or easily address. [Bejar] first became motivated to study the issue because of unwanted sexual advances his own 14-year-old daughter received from strangers on Instagram. “It is unacceptable that a 13-year-old girl gets propositioned on social media,” Bejar testified, citing a statistic from his research finding that more than 25% of 13-to-15-year-olds have reported receiving unwanted sexual advances on Instagram. Lawmakers on Tuesday ripped into the social media giant. “They hid from this committee and all of Congress evidence of the harms that they knew was credible,” said ... Sen. Richard Blumenthal. Missouri Republican Josh Hawley blasted Big Tech companies for spending “gobs” of money ... to thwart bills that would restrict the industry’s power. He also accused Meta of “cooking the books” on data related to mental health harms.\n\nNote: Read how Instagram connects a vast pedophile network. For more along these lines, see concise summaries of deeply revealing news articles on corporate corruption from reliable major media sources.\n\n2023-11-09, TomDispatch\n\nPosted: 2023-11-19 14:50:58\n\nIf you count all the contracts for private industry from U.S. Customs and Border Protection (CBP) and U.S. Immigration and Customs Enforcement (ICE) since Joe Biden took office — for, that is, 2021, 2022, and 2023 — the number comes to $23.5 billion. And though you’d never guess it, given what we normally hear, that already beats Donald Trump’s total for his full four years in office, $20.9 billion. Or, to put the matter in a more historical perspective, private contracts for the Biden years already top the cumulative $22.5 billion spent in border and immigration enforcement budgets from 1975 to 1997. Budgets and private-sector contracts tell an all-too-familiar story in which the border-enforcement apparatus only continues to grow ever larger, regardless of who’s president. As 2023 nears its end, there have simply never been as many opportunities to make a killing (figuratively as well as literally) by surveilling, arresting, caging, and expelling people from this country. In 2023, there were 8,033 such opportunities — and I’m speaking here about contracts in play — or about 22 contracts a day. 1,421 remains of dead people were recovered along the border during Biden’s first two years in office, higher in other words than the 1,133 during Trump’s full four years. Imagine the national news stories, if the remains of nearly 1,500 hikers had been found in the Southwest during a two-year period. But for migrants in those ever more profitable, ever deadlier borderlands, mum’s the word.\n\nNote: Carlos Arellano is a whistleblower and former immigration contractor, who alleges that the US government is the largest trafficker of children in the world. Watch an interview of Arellano share his shocking experiences at some of the immigration facilities. For further exploration of this troubling topic, read about MVM Inc, the ex-CIA defense contractor making millions of dollars hauling children away from the Mexico border on commercial airline flights. Where is the transparency about what is happening to these children?\n\n2023-10-27, The Defender\n\nPosted: 2023-11-19 14:49:21\n\nPfizer-BioNTech delayed reporting vaccine-associated deaths among BNT162b2 clinical trial participants until after the U.S. Food and Drug Administration (FDA) issued an Emergency Use Authorization (EUA) for the product. The vaccine makers also failed to account for a large number of subjects who dropped out of the trial. Together, these strategies kept regulators and the public ignorant of a 3.7-fold increase in cardiac deaths among subjects who received the vaccine, according to analysis in the International Journal of Vaccine Theory, Practice, and Research. Investigators looked at each of the 38 deaths occurring between July 27, 2020, the start of phase 2/3 of the Pfizer-BioNTech vaccine trial, and March 13, 2021, the end date culminating in Pfizer-BioNTech’s 6-month interim report. This trial phase involved 44,060 subjects. Half received a dose of BNT162b2, half got a placebo. The trial was unusual because at week 20 after the FDA issued the EUA for the vaccine, trial subjects in the placebo group were allowed to switch to the vaccinated group and receive their first BNT162b2 shot. Of 20,794 unblinded placebo subjects in the Pfizer trial, 19,685 received at least one dose of BNT162b2. After 33 weeks the data revealed no significant difference between deaths in the vaccinated and placebo groups for the initial 20-week placebo-controlled portion of the trial. 79% of relevant deaths were not recorded in time to be included in Pfizer’s regulatory paperwork.\n\nNote: Read our recent essay on Big Pharma corruption to further explore the significant harms associated with the COVID vaccine. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption and coronavirus vaccines from reliable major media sources.\n\n2023-11-04, NPR\n\nPosted: 2023-11-19 14:46:38\n\nTim Phillips, a veteran conflict-resolution expert, helped negotiate some of the most fraught conflicts in modern history — ceasefires of religious clashes in Northern Ireland and the establishment of what became South Africa's Truth and Reconciliation Commission after apartheid. Defusing an escalating situation ... first requires releasing a brain hijacked by defensive emotion. Phillips says it means saying to your opponent, for example: \"I understand how important this is to you; I understand this is core to your identity and your community, and I respect your sacred values.\" It means reflecting your opponent's humanity back to them. A similar approach, he says, can help reduce toxic polarization. It's effective because in the heat of argument, people tend to demonize one another; counteracting that can neutralize assumptions of negative intent. Phillips says he's seen people emotionally disarm the opposition in a disagreement simply by recognizing their humanity. It can bring together fierce adversaries, and change history. Shirley Chisholm, the first Black congresswoman in the U.S., was battling for the Democratic presidential nomination with political rival ... George Wallace, a fierce segregationist. After he was shot in an attempted assassination, Chisholm visited him in the hospital and prayed at his bedside. \"Wallace's daughter later said that that gesture of compassion completely changed her father,\" Phillips says. Wallace reportedly wept openly, and shifted his stance on racial segregation.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2022-08-04, Yes! Magazine\n\nPosted: 2023-11-19 14:44:25\n\nAt the heart of the Korean spirit is a concept called “Han.” I define Han as “irreparable sorrow.” A more accurate definition might be achieved by describing how Han expresses itself—through storytelling, song, poetry, prayer. It is the language of humanity. Suh Nam-Dong, one of the founders of Korean minjung liberation theology, described Han as “a feeling of unresolved resentment against injustices suffered, a sense of helplessness because of the overwhelming odds against one, a feeling of acute pain in one’s guts and bowels, making the whole body writhe and squirm, and an obstinate urge to take revenge and to right the wrong—all these combined.” What is omitted from such definitions, though, is the very quality that makes Han transcendent; that is, the poeticization of these profound feelings of grief and loss. It gives us a common song. That is why the African American tradition of blues serves as a great model for resilience—joy, even—in the face of unimaginable adversity. It is all the sorrows of the world experienced in communion with others. Communion and fellowship are what will get us through, no matter what the bastards do. I also think of my Quaker grandmother, Elinor Ashkenazy, who helped organize the peace boat, the Golden Rule, in the 1950s. The tiny ketch first set sail across the Pacific in 1958 with the intention of stopping the U.S. from dropping atomic bombs on the Marshall Islands. Its story was another kind of prayer, another kind of poetry—and the inspiration for the founding of Greenpeace and many other peace projects.\n\nNote: This article was written by respected journalist and environmental activist Koohan Paik-Mander. Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-11-01, Scientific American\n\nPosted: 2023-11-19 14:41:52\n\nThe influential idea that in the past men were hunters and women were not isn’t supported by the available evidence. Women are physiologically better suited than men to endurance efforts such as running marathons. This advantage bears on questions about hunting because a prominent hypothesis contends that early humans are thought to have pursued prey on foot over long distances until the animals were exhausted. Furthermore, the fossil and archaeological records, as well as ethnographic studies of modern-day hunter-gatherers, indicate that women have a long history of hunting game. Females are ... dominating ultraendurance events such as the more than 260-mile Montane Spine foot race through England and Scotland, the 21-mile swim across the English Channel and the 4,300-mile Trans Am cycling race. In 2018 English runner Sophie Power ran the 105-mile Ultra-Trail du Mont-Blanc race in the Alps while still breastfeeding her three-month-old at rest stations. Observations of recent and contemporary foraging societies provide direct evidence of women participating in hunting. The most cited examples come from the Agta people of the Philippines. Agta women hunt while menstruating, pregnant and breastfeeding, and they have the same hunting success as Agta men. They are hardly alone. A recent study of ethnographic data spanning the past 100 years ... found that women from a wide range of cultures hunt animals for food.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-17, New York Times\n\nPosted: 2023-11-12 19:46:23\n\nThe conflict between Israel and Hamas is just the latest impetus behind a boom in international arms sales that is bolstering profits and weapons-making capacity among American suppliers. The surge in sales is providing the Biden administration with new opportunities to tie the militaries of other countries more closely to the United States, the world’s biggest arms exporter, while also raising concerns that a more heavily armed world will be prone to careen into further wars. Even before Israel responded to the deadly Hamas attack, the combination of Russia’s invasion of Ukraine and the perception of a rising threat from China was spurring a global rush to purchase fighter planes, missiles, tanks, artillery, munitions and other lethal equipment. Worldwide military spending last year — on weapons, personnel and other costs — hit $2.2 trillion, the highest level in inflation-adjusted dollars since at least the end of the Cold War, according to the Stockholm International Peace Research Institute, which prepares an annual tally. Excluding sales within the United States, China and Russia, worldwide spending on military procurement is expected to hit $241 billion next year, a 23 percent increase since last year. That is by far the largest two-year increase in the database maintained by Janes, a company that has been tracking military spending for nearly two decades. As of last year, the United States controlled an estimated 45 percent of the world’s weapons exports, nearly five times more than any other nation.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-11-08, The Telegraph (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-12 19:44:36\n\nThe Oxford-AstraZeneca Covid-19 vaccine has been branded “defective” in a multi-million pound landmark legal action that will suggest claims over its efficacy were “vastly overstated”. The pharmaceutical giant is being sued in the High Court in a test case by Jamie Scott, a father-of-two who suffered a significant permanent brain injury that has left him unable to work as a result of a blood clot after receiving the jab in April 2021. A second claim is being brought by the widower and two young children of 35-year-old Alpa Tailor, who died after having the jab made by AstraZeneca. The test cases could pave the way for as many as 80 damages claims worth an estimated £80 million over a new condition known as Vaccine-induced Immune Thrombocytopenia and Thrombosis (VITT) that was identified by specialists in the wake of the AstraZeneca Covid-19 vaccine rollout. In the months following the rollout, the potential serious side effect of the AstraZeneca jab was identified by scientists. Following this, it was recommended it no longer be given to the under-40s in the UK because the risk of receiving the jab outweighed the harm posed by Covid. Official figures ... show at least 81 deaths in the UK are suspected to have been linked to the adverse reaction that caused clotting in people who also had low blood platelets. Victims and their lawyers question the Government’s monitoring of the rollout and point out that ... Germany suspended the vaccine’s use for the under 60s at the end of March 2021.\n\nNote: In the US, when current and former FDA advisers and academics asked the FDA to improve COVID vaccine labeling given the risk of severe vaccine injuries, the agency denied almost every single request. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\n2023-11-02, Rasmussen Reports\n\nPosted: 2023-11-12 19:41:41\n\nNearly a quarter of Americans believe someone they know died from COVID-19 vaccine side effects, and even more say they might be willing to become plaintiffs in a class-action lawsuit against vaccine makers. The latest Rasmussen Reports national telephone and online survey finds that 24% of American Adults say they know someone personally who died from side effects of the COVID-19 vaccine. Sixty-nine percent (69%) don’t know anyone who died from being vaccinated against the virus. (To see survey question wording, click here.) Forty-two percent (42%) say that, if there was a major class-action lawsuit against pharmaceutical companies for vaccine side effects, they would be likely to join the lawsuit, including 24% who say it’s Very Likely they’d join such a lawsuit. Forty-seven percent (47%) aren’t likely to join a class-action lawsuit against vaccine makers, including 25% who say it’s Not At All Likely. Another 11% are not sure. The survey of 1,110 American Adults was conducted on October 26 and 29-30, 2023 by Rasmussen Reports. The margin of sampling error is +/- 3 percentage points with a 95% level of confidence. Nearly half (47%) say they know someone personally who died from the COVID-19 virus, while 49% don’t know anyone who died from the virus, which became a pandemic in the United States in 2020. Among those who say someone they know died from the COVID-19 virus, 41% also say they know someone who died from side effects of the COVID-19 vaccine.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\n2023-11-01, Newsweek\n\nPosted: 2023-11-12 19:39:45\n\nAnti-vaccine advocates have recently made allegations against the Pfizer COVID-19 vaccine in hopes that the charges may hurt the drug manufacturer. In a series of posts on X (formerly Twitter), Steve Kirsch expressed concern over reports that Pfizer's vaccine was contaminated, saying that the Food and Drug Administration (FDA) \"is now at a crossroads.\" \"Either they admit that they knew about the plasma contamination, and failed to disclose that to the public and to the outside committees, or they can claim that they didn't know about it in which case Pfizer is liable. But we have the Pfizer documents that were given to the FDA so we know what the FDA got,\" Kirsch wrote. \"I seriously doubt there's any disclosure of SV40 contamination. That means we have an adulterated vaccine and the FDA has to remove it from the market until the adulteration is fixed. If the FDA doesn't do that, they should face criminal prosecution for endangering the public, and not following the law.\" (SV40 refers to simian virus 40.) In his posts, Kirsch also references an incident in Michigan where a judge ruled that the manufacturer of the COVID-19 medication Remdesivir was no longer protected by the federal Public Readiness and Emergency Preparedness (PREP) Act after a man filed a lawsuit against the manufacturer. The man filed the suit after suffering strokes and an amputation following treatment with the drug, Remdesivir, which was contaminated with glass particles.\n\nNote: While the data is still being uncovered, read an in-depth, scientific investigation into vaccine contamination, including concerns that Pfizer hid this contamination from regulators. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\n2023-11-07, The Intercept\n\nPosted: 2023-11-12 19:37:24\n\nOne month since Hamas’s surprise attack, little is known about the weapons the U.S. has provided to Israel. Whereas the Biden administration released a three-page itemized list of weapons provided to Ukraine, down to the exact number of rounds, the information released about weapons sent to Israel could fit in a single sentence. A retired Marine general who worked in the region, who asked for anonymity because he was not authorized by his former employer to speak publicly, attributed the secrecy to the political sensitivity of the conflict. In particular, the retired officer said, weapons used in door-to-door urban warfare, which are likely to result in civilian casualties, are not going to be something the administration wants to publicize. The goal of removing Hamas completely from power is widely expected to take a significant commitment to a long-term ground presence and heavy urban fighting. According to the New Yorker, Israeli officials told their American counterparts that the war could last 10 years. Hamas’s attack on Israel ... resulted in a cascade of arms assistance from the U.S. Though the Biden administration at first declined to identify any specific weapons systems, as details trickled out in the press, it has gradually acknowledged some. These include “precision guided munitions, small diameter bombs, artillery, ammunition, Iron Dome interceptors and other critical equipment,” [said] Pentagon spokesperson Brig. Gen. Pat Ryder. What “other critical equipment” entails remains a mystery.\n\nNote: From 2018-2022, the US was responsible for 40 percent of global weapons exports. For more along these lines, see concise summaries of deeply revealing news articles on military corruption from reliable major media sources.\n\n2023-11-06, The Intercept\n\nPosted: 2023-11-12 19:35:55\n\nDuring a Senate briefing last week, a federal counterterrorism official cited the October 7 Hamas attack while urging Congress to reauthorize a sprawling and controversial surveillance program repeatedly used to spy on U.S. citizens on U.S. soil. “As evidenced by the events of the past month, the terrorist threat landscape is highly dynamic and our country must preserve [counterterrorism] fundamentals to ensure constant vigilance,” said Director of the National Counterterrorism Center Christine Abizaid. She pointed to Section 702 of the Foreign Intelligence Surveillance Act, which enables the U.S. government to gather vast amounts of intelligence — including about U.S. citizens ... without first seeking a warrant. Section 702 “provides key indications and warning on terrorist plans and ... gives us strategic insight into foreign terrorists and their networks overseas,” Abizaid said. “I respectfully urge Congress to reauthorize this vital authority.” The controversial program is set to expire at the end of the year, and lawmakers sympathetic to the intelligence community are scrambling to protect it. Sean Vitka ... at the civil liberties group Demand Progress [said] that now is the time to enact lasting and dramatic oversight of the 702 authority. “The government has completely failed to demonstrate that any of the privacy protections reformers have called for would impair national security ... so now we’re seeing people grasping at straws trying to turn everything into an excuse for reauthorization,” Vitka said.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on government corruption and the disappearance of privacy from reliable major media sources.\n\n2023-11-05, NPR\n\nPosted: 2023-11-12 19:34:07\n\nThe morning of the Hamas attack, [Maoz] Inon's parents were at home in their community of Netiv HaAsara, a mere quarter-mile from Gaza. A Hamas fighter launched a rocket-propelled grenade that directly hit his parents' wooden house. Amid this sea of grief that he's cratered into, Inon says he feels no urge for revenge. \"I was crying, and I'm still crying, for all the innocent victims from both sides that will die,\" he says. \"And I'm crying for this 100 years of bloodshed, of cycle of death.\" Inon says that this cycle can seem endless, but he has hope. \"It seems like there is no solution,\" he says, \"but there is.\" Inon says he had something of a vision after this war began. \"I saw an image of everyone crying,\" he recalls. He says we shouldn't have more weapons, build higher walls and create better security systems. \"That's the old world, OK? You want to start a new world? We need to cry ... And then,\" he says, \"we'll see the path for peace.\" In one of [political psychologist Oded Adomi] Leshem's research studies, he shows that Jewish Israelis and Palestinians consistently underestimate the other group's hope for peace. \"This underestimation actually reduces one's own hope.\" Unlike conflict, which Leshem says is bloody but familiar to Israelis and Palestinians, hope is different. It's unfamiliar and unpredictable. \"If we kind of accept this unpredictability,\" he says, \"take the chance [on] this uncertain thing — which is called peace between the [Jordan] River and the [Mediterranean] Sea — then this is closely related to hope.\"\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war from reliable major media sources.\n\n2023-10-28, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-12 19:32:40\n\nAt a time when the US has narrowly skirted a recession, and people around the country are still struggling with the cost of living, a curious number of states have found billions of dollars for one thing: building prisons and jails. In September, Alabama announced that a new prison, currently under construction, would have a final cost of $1.082bn. The same month Indiana broke ground on a $1.2bn prison. Nebraska is spending $350m on a new prison, while some in Georgia are lobbying for $1.69bn for construction of a jail in Fulton county. The willingness to spend vast amounts of money on locking people up, particularly in states like Alabama, which has one of the highest poverty rates in the country, is staggering. It’s also wrong-headed, experts say. “Any money spent on caging human beings is not money well spent, period,” said Carmen Gutierrez ... at the University of North Carolina at Chapel Hill. “We have decades of research showing that incarceration does not improve public safety, and that it in fact harms individuals who themselves are incarcerated. It also harms their families and it harms the communities that they come from. So the damage outweighs any potential benefit.” The US has an incarceration rate of 664 people in every 100,000 ... far higher than other founding Nato countries. In Alabama, Georgia and other southern states about one in every 100 people is incarcerated in prisons, jails, immigration detention and juvenile justice facilities.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on prison system corruption from reliable major media sources.\n\n2023-11-06, The Defender\n\nPosted: 2023-11-12 19:30:52\n\nExecutives at the largest insurance companies in the United States are alarmed that teenagers, young and white-collar Americans in the prime of life are inexplicably dying at a record pace, causing a “monumental outflow” of death claims. According to an Oct. 26 report in InsuranceNewsNet, U.S. insurance companies expected higher-than-normal payouts from excess deaths during the COVID-19 pandemic. Insurers saw death benefits rise 15.4% in 2020, the biggest one-year increase since the 1918 Spanish flu epidemic, followed by a record $100.28 billion — nearly double the historic norm — in total death benefits paid out by the industry in 2021. CDC numbers ... show the death rate for Americans ages 15-45 rose 20-24% above normal in 2020, and soared in 2021, to a nearly 30% death increase for 15-year-olds and a more than 45% increase for 45-year-olds. CDC data reported in August showed that Americans in the period January-May 2023 were still dying at abnormally high rates with the pandemic long over. Dr. Pierre Kory ... who treats long COVID and vaccine-injured patients in his practice, called on insurance companies to work with media and governments and investigate the powerful evidence that countless deaths and disabilities are temporally linked to the COVID-19 mRNA vaccines. Kory cited the more than 1 million COVID-19 vaccine-linked injuries, disabilities and more than 30,000 deaths reported ... to the Vaccine Adverse Event Reporting System (VAERS).\n\nNote: Mentioned in this article is critical care physician Dr. Pierre Kory, who recently published an in-depth explanation on the link between COVID-19 mRNA vaccines and excess death among American youth. For more along these lines, see concise summaries of deeply revealing news articles on coronavirus vaccines from reliable major media sources.\n\n2023-10-10, ScheerPost\n\nPosted: 2023-11-12 19:29:04\n\nSince 1973, at least 194 people have been freed from death row after evidence of innocence revealed that they had been wrongfully convicted. That’s almost one person exonerated for every ten who’ve been executed. Wrongful convictions rob innocent people of decades of their lives, waste tax dollars, and re-traumatize the victim’s family, while the people responsible remain unaccountable. Contrary to popular belief, the appeals process is not designed to catch cases of innocence. It is simply to determine whether the original trial was conducted properly. Most exonerations came only because of the extraordinary efforts of people working outside the system – pro bono lawyers, family members, even students. Wrongfully convicted people have spent up to 33 years on death row ... before the truth came to light. Any effort to streamline the death penalty process or cut appeals will only increase the risk that an innocent person is executed. Frank Lee Smith was sentenced to death in Florida on the testimony of a single witness. Four years later, the same witness saw a photo of a different man and realized she had made a mistake. DNA tests later confirmed that Smith was innocent, but it was too late. He had died in prison. Cameron Todd Willingham was executed in Texas in 2004 for setting fire to his home, killing his three children. Experts now say that the arson theories used in the investigation are scientifically invalid. Willingham may very well have been executed for an accidental fire.\n\nNote: Read more about the innocent people sentenced to death in the US. For more along these lines, see concise summaries of deeply revealing news articles on judicial system corruption from reliable major media sources.\n\n2021-08-05, The Philadelphia Citizen\n\nPosted: 2023-11-12 19:25:17\n\nIn October of 2020 I sat in on a Zoom call with a group of formerly incarcerated men brainstorming the causes of escalating gun violence in Philadelphia. The meeting was part of an intergenerational healing circle for formerly incarcerated men from ages 17 to 50. All of the men are trying to figure out their place in the world post-incarceration. The hope was to support them in achieving their self-determined vision of wellness, through connections to community resources and opportunities. The program was created as part of a $100,000 grant that the Philadelphia Youth Sentencing & Reentry Project (YSRP) received from Impact100. The men talk about emotions in ways they probably can’t in other parts of their lives, but they also talk about practical things—finding work, maintaining healthy relationships, looking for a place to live. But most importantly they are able to talk to someone else who has experienced the things they experienced. The Intergenerational Healing Circle ... had four core goals: understanding and healing from trauma; creating connectedness rooted in shared experience of incarceration and reentry; developing agency and liberation-oriented leadership; and community building. “It’s this relatedness and willingness to be vulnerable in the IGHC that makes this experience rewarding and transformative,” says John Pace, [a] Reentry Coordinator at the Youth Sentencing & Reentry Project. “While in prison, we often had to suppress our vulnerabilities ... so this space for us is truly healing.”\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-26, Reasons to be Cheerful\n\nPosted: 2023-11-12 19:23:29\n\nManifestWorks [is] a unique program that guides people from homelessness, incarceration and foster care directly into entry-level jobs in film and TV. “When I started the ManifestWorks program, it was more than just learning the steps. It was really therapeutic for me,” says Leslie. “It was uplifting during a time when I was really not in a good place.” By the third week of classes, Leslie had secured her first gig as a production assistant. The same person who hired her brought her back for the next two years and seeded additional relationships that led to more work. Today, Leslie works in a sound department as a union member, has consistent work at a living wage and has been able to upgrade both her housing and her car. The nonprofit ManifestWorks has more than 270 alumni currently working in the film industry, and purposely recruits its students from populations that face barriers to success. According to ManifestWorks, 25 percent of foster care youth end up incarcerated within two years of turning 18, and unemployment impacts the formerly incarcerated at a rate 12 times higher than the national average. Some 71 percent of ManifestWorks’ trainees are on welfare when they start the program — after a year, that number drops to seven percent on average. And 92 percent of ManifestWorks alumni are employed full time with an average annual income of $62,000, up from the average of $12,500 when trainees first start.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-08, CBS News\n\nPosted: 2023-11-12 19:21:55\n\nThis past summer more than 300 high school graduates signed up for a unique student exchange program. Unlike the well-known foreign exchange model ... this program gives students the opportunity to soak in a brand-new culture without ever leaving the country. It's called the American Exchange Project, or AEP for short, co-founded by 29-year-old David McCullough III. \"We fund kids to spend a week in the summer after senior year in an American town that is politically and socio-economically and culturally very different from the one that they're growing up in,\" McCullough said. One student, Alex, said, \"My groups of friends are not really close to each other, so I feel like I've actually bonded with you guys more than I have with my own friends.\" One girl from South Dakota said, \"I've never been a part of a community where ... I'm not the minority, I'm not the odd one out. So, this is very much an experience that I really appreciate so much.\" McCullough hopes to offer the program to a million students a year by decade's end, and all free of charge, thanks to big name donors, including the likes of Steven Spielberg. \"I think this all ought to be as typical to the American high school experience as the prom,\" McCullough said. There's that old adage about walking a mile in someone else's shoes; the problem is, you can't see the person face-to-face if you're walking away. What David McCullough is hoping is the next generation will turn around, look those they differ with in the eye, and just talk.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-04, New York Times\n\nPosted: 2023-11-07 16:25:37\n\nSome of the experts responsible for helping to craft the U.S. dietary guidelines also take money from big food and drug companies. A report ... by the nonprofit U.S. Right to Know makes those concerns plain. Nine of the 20 experts on the 2025 Dietary Guidelines Advisory Committee have had conflicts of interest in the food, beverage, pharmaceutical or weight loss industries in the last five years, the report found. Gary Ruskin, the executive director of the nonprofit, said the finding “erodes confidence in the dietary guidelines,” which provide recommendations on how people can eat a healthier diet. The guidelines are widely used by policymakers to set priorities in federal food programs, health care and education. Questions about industry influence could damage the public’s trust that the recommendations are based in science. When committee members receive funding from certain industry groups or organizations, it raises the concern that they may be biased, Dr. [Marion] Nestle said. “Part of the problem is the influence is unconscious,” she said. “People don’t recognize it,” she added, and will often deny it. Even if such relationships do not influence the experts, Mr. Ruskin said, they can create the appearance that they do — which can seed doubt about how independent the committee’s recommendations actually are. Industry influence can [also] creep in later in the process ... when the U.S.D.A. and the H.H.S. produce the final guidelines based on the committee’s advice.\n\nNote: U.S. Right to Know is an excellent resource for investigating how the food industry shapes science, policy and public opinion. For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\n2022-06-23, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-07 16:18:05\n\nThere’s a hidden ingredient used as a whitener in an array of foods. It’s called titanium dioxide, and while commonly used in the US, it’s being banned in the EU as a possible carcinogen. The additive, also known as E171, joins a host of other chemicals that are banned in foods in the European Union but allowed in the US. These include Azodicarbonamide, a whitening agent found in food such as breads, bagels, pizza, and pastries in the US, which has been banned in the EU for more than a decade. The additive has been linked to asthma and respiratory issues in exposed workers and, when baked, to cancer in mice studies. The Food and Drug Administration classifies these food chemicals, and many others prohibited by the EU, as “generally recognized as safe”. Chemical safety processes in the EU and US work in starkly different ways. Where European policy tends to take a precautionary approach – trying to prevent harm before it happens – the US is usually more reactive. And while the EU has consistently updated its methods and processes for evaluating new chemicals, some experts say the US system, set up more than half a century ago, needs updating. In the case of additives like titanium dioxide, manufacturers petition the FDA for its approval by submitting evidence that the substance is safe for its intended use. The FDA evaluates the application, and will authorize the additive if it concludes the data provided demonstrates that the substance is safe to use.\n\nNote: Unlike other countries, the U.S. is known to raise objections to the regulation of toxic chemicals in our food, with its regulatory agencies having deep financial ties to powerful food and agrichemical industries. For more along these lines, see concise summaries of deeply revealing news articles on food system corruption from reliable major media sources.\n\n2023-10-30, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-07 16:16:28\n\nThe United Nations has warned that there was “clear evidence” that war crimes may have been committed in “the explosion of violence in Israel and Gaza”. Meanwhile, Wall Street is hoping for an explosion in profits. During third-quarter earnings calls this month, analysts from Morgan Stanley and TD Bank took note of this potential profit-making escalation in conflict and asked unusually blunt questions about the financial benefit of the war between Israel and Hamas. TD Cowen’s Cai von Rumohr, managing director and senior research analyst specializing in the aerospace industry, [asked] about the upside for General Dynamics, an aerospace and weapons company in which TD Asset Management holds over $16m in stock. The aerospace and weapons sector ... enjoyed a 7-percentage point jump in value in the immediate aftermath of Hamas’s 7 October attack on Israel and the beginning of Israel’s bombardment of Gaza. “Hamas has created additional demand, we have this $106bn request from the president,” said Von Rumohr, during General Dynamics’ earnings call on 25 October. “Can you give us some general color in terms of areas where you think you could see incremental acceleration in demand?” Aside from the callousness of casually discussing the financial benefits of far-off armed conflict, the comments raise questions about whether these major institutional shareholders of weapons stocks are abiding by their own human rights policies.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war and corporate corruption from reliable major media sources.\n\n2023-10-31, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-07 16:14:42\n\nEver since Israel responded to Hamas’s atrocities with a vicious onslaught that has killed more than 8,000 Palestinians there has been an attempt to silence, intimidate and harass Palestinian sympathisers. Inevitably, it is Palestinians who suffer the brunt of a campaign to stigmatise even the most basic opposition to the mass slaughter of their people. Viet Thanh Nguyen, the son of refugees and a sympathiser with other displaced people, had a talk at the 92nd Street Y centre in New York postponed after he signed an open letter demanding an “end to the violence and destruction in Palestine”. What of the US Campaign for Palestinian Rights, whose longstanding conference in Houston was cancelled following the Orthodox Jewish Chamber of Commerce describing the event as “a conference for Hamas supporters”? The Hilton cited security concerns as the reason for the cancellation. The keynote speaker, Rashida Tlaib, the first ever elected Palestinian-American congresswoman, has been targeted by a Republican smear campaign, with an attempt to censure her for “antisemitic activity” and “sympathising with terrorist organisations” – all baseless attacks. Meanwhile, MSNBC reportedly stopped three of its Muslim broadcasters from presenting their shows, with no explanation. The broadcaster claimed any change in programming as “coincidental”. This intimidation has deadly consequences: it undermines public pressure on Israel’s western allies to stop the slaughter and end the occupation.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war and media manipulation from reliable sources.\n\n2023-10-02, Fortune\n\nPosted: 2023-11-07 16:13:05\n\nIn 2009, Laura Esserman, a breast cancer surgeon and oncology specialist in San Francisco, co-published an article in the Journal of the American Medical Association (JAMA) suggesting that it was time to rethink routine screening for breast and prostate cancer. The current approach, she wrote, wasn’t reducing aggressive or late-stage disease as much as had been hoped. Instead, it was leading to overdiagnosis. Ductal carcinoma in situ, a condition sometimes called non-invasive or stage-zero breast cancer, is a very early finding of disease in the cells that line the milk ducts of the breast. For decades, the diagnosis of DCIS has routinely led to surgery–a mastectomy or a lumpectomy (a partial breast resection) that’s often combined with radiation treatment. The issue? In a study of 100,000 women who were followed for two decades, patients who’d been diagnosed with and treated for DCIS ultimately had about the same chance of dying from breast cancer as those in the general population. In August, a meta-analysis of 18 randomized clinical trials involving 2.1 million people, published in JAMA Internal Medicine, concluded that “current evidence does not substantiate the claim” that common cancer screens (mammography, colonoscopy, prostate-specific antigen (PSA) testing, etc) save lives. “In our exuberance to find these cancers, we have basically turned a lot of healthy people who are not destined to die from the cancers into patients,” says Ade Adamson, a cancer screening expert.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources. Then explore the excellent, reliable resources provided in our Health Information Center.\n\n2023-09-21, NPR\n\nPosted: 2023-11-07 16:11:43\n\nNearly three months into taking Ozempic for diabetes, Jenny Kent had already lost 12 pounds, and her blood sugar numbers were looking better than they had in a while. Ozempic, the injectable drug approved for Type 2 diabetes, has taken the world by storm. Despite not being approved by the Food and Drug Administration for weight loss, Ozempic has prompted people on TikTok and Instagram to speculate about which stars have used it to shed pounds seemingly overnight. But for Kent something else changed after she started taking Ozempic. \"I was just constantly in a state of being overwhelmed,\" says Kent. \"So my response to that was just I was just crying all the time. Sobbing, crying ... I still didn't put it together, so I kept ... taking my injections.\" She's one of many people taking Ozempic and related drugs who describe mental health problems. But that side effect isn't mentioned in Ozempic's instructions for use, or drug label. In July, the European Medicines Agency said that it was looking into the risk of thoughts of self-harm and suicidal thoughts with the use of Ozempic and similar drugs. The FDA hasn't taken that step. NPR analyzed the FDA's adverse event reporting system, or FAERS, and learned that the agency has received 489 reports of patients experiencing anxiety, depression or suicidal thoughts while taking semaglutide drugs, including Ozempic, Wegovy and Rybelsus. In 96 of those reports, the patient had suicidal thoughts. Five of them died.\n\nNote: A deeper investigation explores the concerning scope of health issues related to weight-loss drug side effects. For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\n2023-10-22, MSN News\n\nPosted: 2023-11-07 16:10:04\n\nCompanies that make popular weight loss shots like Ozempic and Mounjaro are starting to test a version for kids as young as six years old who suffer from obesity. Pharmaceutical company Eli Lilly signaled its plans to start clinical trials with Mounjaro for kids ages 6-11, over the weekend. Novo Nordisk, the company that makes Ozempic, reported it is in phase three of testing Saxenda, a version of its drug for children ages 6-12. The rates of obesity for children in the U.S. have tripled since the 1980s, affecting close to 15 million children nationwide, according to the CDC. This is nearly one in five kids. “It’s unlikely it’s going to do much if you just give them the medication. You need to instill all these behavior changes, lifestyle changes, talk about the diet, nutrition consults, the exercise,” said pediatrician Dr. Alison Mitzner. The concern for possible long-term impacts and side effects is one nutritionist Carrie Lupoli echoes. Both drug companies were sued earlier this year after a plaintiff said she suffered stomach paralysis. “It’s scary to me that we are going down that path instead of actually working on the root cause because we know weight gain is a symptom of health and hormones,” Lupoli said. CDC data shows kids may have gained weight twice as fast during the pandemic. Earlier this year, the American Academy of Pediatrics came out with new guidance that includes medication and surgery as suggestions for patients 12 and up suffering from obesity.\n\nNote: The pharmaceutical companies behind these weight loss drugs are raking it in despite significant efficacy and safety concerns. Sales of Ozempic generated revenue of $3.2 billion in the second quarter (up from $2.1 billion during the same period in 2022) and Mounjaro generated $980 million in sales for the company during the second quarter (a 72% increase compared to the first quarter). For more along these lines, see concise summaries of deeply revealing news articles on Big Pharma corruption from reliable major media sources.\n\n2023-09-09, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-11-07 16:08:28\n\nAfter spending 13 years and $2.7bn, the Human Genome Project announced in 2003 that it had successfully mapped our DNA, paving the way for a new era of medicine that would deliver “the right treatment, for the right patient, at the right time”. Twenty years later, some say the “era of precision medicine” has arrived. But others disagree. They argue that the gains have been small, and pursuing them may have diverted attention from the preventable causes of common diseases. Some doctors and academics say that too much emphasis is placed on our genes, and not enough on environment and lifestyle. “There’s this paradox where the more we learn about the human genome, the less we should expect it to actually have significant impacts for most patients,” [Prof. James] Tabery says. “There’s plenty of information to suggest that if we really wanted to combat common diseases, we should be focusing on environmental causes.” In countries with insurance-based healthcare systems such as the US, expensive drugs can take an enormous toll on individuals, leading some clinicians to identify a new side-effect: “financial toxicity”. “A new drug offers some health benefits to those patients that receive it,” explains Mark Sculpher ... at the University of York. “But depending on the cost of that drug, you may end up with other patients losing more health, because that’s resources taken from them. So you can have this negative overall population health effect if you pay too much for a drug.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources.\n\n2023-10-24, The DisInformation Chronicle on Substack\n\nPosted: 2023-11-07 16:06:44\n\nWhile I was out of town on business, I got a call from my dad who told me my husband Woody had been found hanging—dead at age 37. Woody wasn’t depressed and he hadn’t had a history of depression nor any other mental illness. His doctor had prescribed the antidepressant Zoloft to take the edge off. In the following weeks, I started to investigate, to try and understand why my perfectly normal husband had decided to end his life. The only thing that made sense ... Zoloft. Figuring out Zoloft’s dangers completely altered my life’s trajectory, absorbing years of my time. Today, I sit on one of the Food and Drug Administration (FDA) advisory committees that reviews new drugs coming to market. I initially thought that what I was learning about Zoloft was just an isolated issue with antidepressants. But I soon realized it was part of a much bigger, systemic problem with our nation’s drug safety system. The pharmaceutical industry is driven by commercial interests, not public health, and this problem is compounded by a lack of transparency, conflicts of interests, manipulation of clinical trials, and undue corporate influence across the government. Marketing companies ghostwrite pharmaceutical studies for academics who sometimes barely read the papers that get submitted to medical journals, and drug makers then cite these ghostwritten studies as peer-reviewed proof of their products’ safety and efficacy. The revolving door between Big Pharma and the FDA spins faster than the one between the Pentagon and the defense industry.\n\nNote: This guest essay is written by Kim Witczak, a globally renowned advocate for pharmaceutical drug safety and FDA reform. Antidepressants have been found to increase the risk of suicide in some patients. For more along these lines, see concise summaries of deeply revealing news articles on health and Big Pharma corruption from reliable major media sources.\n\n2023-10-23,\n\nPosted: 2023-11-07 16:05:13\n\nA new study published in JAMA Psychiatry finds that almost everyone will be treated for mental illness at some point in their lives and that their lives are worse in many ways after receiving diagnosis and treatment. About 80% of the population will be hospitalized or receive psychiatric drugs. After treatment, they are more likely to end up poor, unemployed, and receiving disability benefits, and they have worsening social connections. According to the researchers, the likelihood of getting prescribed psychiatric drugs during your lifetime was 82.6% (87.5% for women and 76.7% for men). The likelihood of being hospitalized for mental illness was 29.0% (31.8% for women and 26.1% for men). On average, the 80% who were treated for mental illness were already struggling before treatment. But after treatment, things only got worse. After treatment, “individuals with any mental health disorder were more likely to experience new socioeconomic difficulties, compared with control individuals from the general population,” the researchers write. “During follow-up, they were more likely to become unemployed or receive a disability benefit, to earn lower income, to be living alone, and to be unmarried.” There is copious evidence that antidepressant use leads to worse outcomes in the long term, even after controlling for the severity of depression and other factors. The adverse effects of the drugs lead to worse health outcomes for those taking them, and withdrawal symptoms prevent people from being able to discontinue.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on health from reliable major media sources. Then explore the excellent, reliable resources provided in our Health Information Center.\n\n2023-10-25, Optimist Daily\n\nPosted: 2023-11-07 16:03:32\n\nWhile the sad reality of violence and division dominates the media, countless grassroots organizations are working tirelessly to bring peace and reconciliation to the Israel-Palestine conflict. As the region continues to be ravaged by violence, Standing Together, Israel’s largest Arab-Jewish grassroots organization, brings together Jewish and Palestinian volunteers. They labor relentlessly to assist victims of continuous violence while also campaigning for peace, equality, social justice, and climate justice. Their message is clear: the future they envision is one of peace, Israeli and Palestinian independence, full equality, and environmental justice. The Parents Circle – Families Forum, which includes over 600 families who have lost loved ones in the conflict, is a symbol of reconciliation. This joint Israeli-Palestinian organization encourages conversation and reconciliation through education, public gatherings, and media participation, presenting a ray of hope for a future of coexistence. Integrated schools in Israel, where Jewish and Palestinian children attend classes together, serve as an example of a more inclusive future. Hand in Hand promotes understanding by bringing parents together for debate and shared study of Hebrew and Arabic. They are sowing seeds of oneness. Jerusalem Peacebuilders brings together Israelis, Palestinians, and Americans with the goal of developing tomorrow’s leaders. Their work highlights the futility of violent war and the critical need for nonviolence.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-20, Truthout\n\nPosted: 2023-11-07 16:01:47\n\nA growing women-led restorative justice system ... operates within the territory of the Autonomous Administration of North and East Syria (AANES), also known as Rojava, a revolutionary social experiment involving more than 4.5 million people. The system features a network, autonomous from the AANES, of more than 60 Mala Jin, or “women’s houses,” which allow people to solve disputes at the community level, instead of through courts or police, by offering reconciliation and mediation processes for domestic and family situations. Activist and independent researcher Clara Moore ... recently returned from spending two years in the region, working at both the Rojava Information Center and at Mala Jin. \"Essentially, they’re trying to build a system around the political philosophy of Democratic Confederalism, which was initially inspired by the ideas of [the American intellectual] Murray Bookchin and theorized by [Kurdish leader] Abdullah Öcalan from prison in Turkey,\" [said Moore]. \"It’s based on ideas of pluralism, direct democracy, decentralization, gender equality and self-defense. In practice, this means that all communities have the ability and right to defend themselves and provide for their own needs. The idea of the justice system in Rojava, in North and East Syria in general, is that it’s possible to solve a dispute without going to court. There are laws in Rojava and courts. Ideally, those only become relevant when people can’t come to a resolution together outside of court.\"\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-10, NPR\n\nPosted: 2023-11-07 16:00:20\n\nCalifornia has become the first U.S. state to outlaw the use of four potentially harmful food and drink additives that have been linked to an array of diseases, including cancer, and are already banned in dozens of countries. The California Food Safety Act prohibits the manufacturing, distribution and sale of food and beverages that contain brominated vegetable oil, potassium bromate, propylparaben and red dye 3 — which can be found in candy, fruit juices, cookies and more. The Food and Drug Administration banned the use of red dye 3 in cosmetics in 1990 after evidence showed it caused cancer in lab animals. But the government hasn't prohibited its use in food, and it's an ingredient in candies. Brominated vegetable oil and potassium bromate have also been associated with harmful effects on the respiratory and nervous systems, while propylparaben may negatively impact reproductive health. The proposal has been the target of a false claim that California is attempting to ban Skittles. In fact, Assemblymember Jesse Gabriel, a Democrat who sponsored the bill, has said that Skittles are sold with alternative ingredients in the European Union, where the four additives are already banned. \"It's unacceptable that the U.S. is so far behind the rest of the world when it comes to food safety,\" Gabriel said in a statement. In addition to the EU, countries that have banned the four additives in food include the United Kingdom, Canada, Australia, New Zealand, China and Japan.\n\nNote: Explore more positive stories like this in our comprehensive inspiring news articles archive focused on solutions and bridging divides.\n\n2023-10-23, The Guardian (One of the UK's Leading Newspapers)\n\nPosted: 2023-10-29 17:32:36\n\nThe screams of children are difficult to hear over the noise and fury of the Gaza maelstrom. In a joint statement on Sunday, the US, Britain, France, Germany, Italy and Canada called for “adherence to international humanitarian law, including the protection of civilians”. But they know full well that, in Gaza, the exact opposite is happening. And it’s not only them. The likes of China and Russia are doing nothing to stop it, either. Last week, the Save the Children charity reported that one child in Gaza was being killed every 15 minutes. On Saturday, the Euro-Med Human Rights Monitor was estimating a daily death toll of 200 children and infants. Of the more than 4,600 Palestinians killed since Israeli forces began their bombardment, about 40% are children, the Hamas-run Palestinian health ministry says. Behind these stark figures lies a world of pain. At least 3,250 children have been injured, with 1,240 needing specialised medical care, as of last week. Many have extensive burns and shrapnel wounds or have lost limbs. Yet hospitals and clinics that have been damaged or destroyed or are short of medical supplies – due to Israel’s siege – are unable to treat them adequately. “Israel’s bombardment and unlawful total blockade of Gaza mean that countless wounded and sick children, among many other civilians, will die for want of medical care,” said Human Rights Watch. Killing and targeting civilians, especially children, is illegal under international humanitarian law.\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war from reliable major media sources.\n\n2023-10-21, The Intercept\n\nPosted: 2023-10-29 17:30:59\n\nOn Wednesday, the United States was the only country to vote “no” on a proposed U.N. Security Council resolution authored by Brazil that called for “humanitarian pauses” in Israel’s bombing of Gaza. Twelve countries voted for the resolution, including several surprising ones, such as France and the United Arab Emirates. Two more, Russia and the U.K., abstained. But according to the Security Council’s rules, America’s sole “no” vote meant that the resolution failed. The Security Council has 15 countries. Ten are rotating members, elected by the U.N. General Assembly and serving on the council for a period of two years. Five are permanent members: the U.S., Russia, China, France, and the U.K. If any of the permanent members vetoes a resolution, it will not pass, no matter how many votes are in favor. The first U.S. veto to protect Israel occurred in 1972. Since then, the U.S. has vetoed about four dozen more resolutions criticizing Israel. Since the collapse of the Soviet Union, Russia has similarly vetoed numerous resolutions to protect its own client state, Syria, as well as itself concerning Ukraine. Since the U.N.’s founding, it has largely always been a debating society because the world’s most powerful countries, led by the U.S., want it that way. There has recently been renewed energy at the U.N. to change things. However, given the fact that the five permanent members can block any changes, the best idea that anyone could come up with was to ask them nicely to change.\n\nNote: Israel has been the largest recipient of U.S. military assistance, receiving $158 billion since the country’s establishment in 1948. For more along these lines, see concise summaries of deeply revealing news articles on war and government corruption from reliable major media sources.\n\n2023-10-18, Huffington Post\n\nPosted: 2023-10-29 17:29:22\n\nPresident Joe Biden departed for Israel on Tuesday evening on a high-stakes diplomatic visit amid ongoing Israeli-Palestinian bloodshed. As Biden grapples with the crisis, several U.S. officials told HuffPost it has become difficult to have a full debate within his administration about what’s happening in Israel-Palestine and in particular that people who want to talk about Israeli restraint or humanitarian protections for Palestinians feel stifled. Several staffers across multiple agencies, most of whom work on national security issues, told HuffPost they and their colleagues worry about retaliation at work for questioning Israel’s conduct amid the U.S.-backed Israeli campaign to avenge an Oct. 7 attack by Hamas, the Palestinian militant group, that killed more than 1,400 Israelis. The fear is especially intense among staffers with Muslim backgrounds. On Sunday, presidential personnel office chief Gautam Raghavan organized a call with close to a dozen current and former high-level Muslim appointees to discuss their concerns. Some staffers said they felt unsafe voicing their opinions around colleagues because it could endanger their careers, according to a person on the call. The period since the Hamas attack represents “the first time in the administration that there was a real culture of silence,” one official said. “It feels like post-9/11 where you feel like your thoughts are being policed, and you’re really afraid of being seen as anti-American or an anti-Semite.”\n\nNote: For more along these lines, see concise summaries of deeply revealing news articles on war and government corruption from reliable major media sources.\n\n2023-10-20, NPR\n\nPosted: 2023-10-29 17:27:34\n\nPolicing expenses mount quickly: $18,000 for technology to unlock cellphones in Southington, Conn.; $2,900 for surveillance cameras and to train officers and canines in New Lexington, Ohio. And in other communities around the country, hundreds of thousands for vehicles, body scanners, and other equipment. State and local governments are turning to a new means to pay those bills: opioid settlement cash. This money — totaling more than $50 billion across 18 years — comes from national settlements with more than a dozen companies that made, sold, or distributed opioid painkillers, including Johnson & Johnson, AmerisourceBergen, and Walmart, which were accused of fueling the epidemic that addicted and killed millions. In August, more than 200 researchers and clinicians delivered a call to action to government officials in charge of opioid settlement funds. \"More policing is not the answer to the overdose crisis,\" they wrote. Years of research suggests law enforcement and criminal justice initiatives have exacerbated the problem. \"Police activity is actually causing the very harms that police activity is supposed to be stemming,\" says Jennifer Carroll, an author of that study and an addiction policy researcher. In Louisiana ... 80% of settlement dollars are flowing to parish governments and 20% to sheriffs' departments. Over the lifetime of the settlements, sheriffs' offices in the state will receive more than $65 million — the largest direct allocation to law enforcement nationwide. And they do not have to account for how they spend it.\n\nNote: Explore past news articles we've summarized on opioids, a crisis fueled by US drug companies and captured government agencies. For more along these lines, see concise summaries of deeply revealing news articles on police corruption fro", "images": ["https://www.wanttoknow.info/m/images/rss.jpg", "https://www.wanttoknow.info/m/images/social-fb.png", "https://forms.aweber.com/form/displays.htm?id=rAzMTEzs7Bws", "https://www.wanttoknow.info/m/images/social-youtube.png", "https://www.wanttoknow.info/m/images/wtk-og.jpg", "https://www.wanttoknow.info/m/images/fire.png", "https://www.wanttoknow.info/m/images/menu.png", "https://www.wanttoknow.info/m/images/social-insta.png", "https://www.wanttoknow.info/m/images/social-twitter.png", "https://www.wanttoknow.info/m/images/menu-close.png", "https://www.wanttoknow.info/m/images/wtk-logo.png"], "top_img": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.wanttoknow.info/newsstories-0-10000", "title": "News Stories", "meta_data": {"description": "News stories: Excerpts from highly revealing major media news stories suggest major cover-ups of health, energy, media, 9/11, war, elections, and more. Links to original stories provided for easy verification.", "keywords": "news,articles,9/11,911,elections,energy,inventions,financial,global,warming,government,health,mass,media,,information,polls,able,danger,avian,flu,corporate,corruption,dolphins,whales,hurricane,katrina,income,inequality,inspirational,microchips,mind,control,nature,reality,non-lethal,nonlethal,privacy,secrecy,secret,societies,terrorism,ufos,vaccines,war", "og": {"title": "WantToKnow.info", "description": "Want to know the truth? Key media articles and reliable, information-packed summaries on major cover-ups for those who want to know the truth on health, banking, energy, media, elections, war, 9/11.", "image": "https://www.wanttoknow.info/m/images/wtk-og.jpg", "type": "article", "url": "https://www.wanttoknow.info/newsstories-0-10000"}, "viewport": "width=device-width, initial-scale=1", "ROBOTS": "INDEX,FOLLOW", "Revisit-after": "21 days", "rating": "general", "google-site-verification": "93poa4ULbuO4k4m5pcOzlCUyZF-QR_CMpiv-eFUo8sw"}, "movies": [], "publish_date": null, "source": "https://www.wanttoknow.info", "summary": ""}