{"url": "https://www.scmp.com/culture/film-tv/article/2122402/crystal-liu-yifei-seven-things-you-dont-know-about-chinese-actress", "text": "Liu wrote a short post on her Weibo platform on Thursday night saying how she loves Mulan’s courageous character and boldness. She also thanked the crew at Disney for placing their trust in her.\n\nTo be released in 2020, the film is being directed by New Zealander Niki Caro, who has stressed the importance of instilling cultural authenticity into the retelling of the legendary Chinese tale about a women who disguises herself as a man to fight for her country.\n\nChinese actress Crystal Liu Yifei has been cast as the leading actress in Disney’s live-action remake of Mulan , the studio has announced.\n\nThe casting announcement has been received positively in both China and in the West. Liu’s Weibo fan page was flooded with congratulatory messages. ‘Mulan’ and ‘LiuYifei’ have also become trending hashtags on Twitter.\n\nHere are seven things you need to know about the actress:\n\nLiu as Wang Yu-yan in Demi-Gods and Semi-Devils.\n\nFairy sister\n\nLiu has been acting for more than a decade. Her breakout role came in 2003 when she played Wang Yuyan in the Chinese television series adapted from Louis Cha’s novel Demi-Gods and Semi-Devils. Three years later, she starred in another adaptation of a Cha novel, The Return of the Condor Heroes, as the female protagonist Xiaolongnu. Since then, she has been nicknamed “Fairy Sister” for her elegant style and angelic appearance, on and off screen.\n\nOne in a thousand\n\nLiu beat almost 1,000 other candidates to win her new role, including Taiwanese actress Hu Ting-ting, who was considered a lookalike of Mulan. Earlier this year there were rumours that other actresses would be chosen, including Jelly Lin Yun, who played the lead role in Stephen Chow Sing-chi’s smash hit The Mermaid (2016), and Natasha Liu Bordizzo, who starred in the American-Chinese martial arts film Crouching Tiger, Hidden Dragon: Sword of Destiny (2016).\n\nJet Li and Liu in a still from The Forbidden Kingdom (2008).\n\nMore than qualified\n\nThe casting directors went on a year-long search to find the leading actress, looking for someone who could meet three criteria: English-language ability, martial arts skills and, perhaps the most ambiguous of all – star quality. Liu fits the bill. She speaks fluent English, having moved to United States with her mother at the age of 10. She lived in Queens in New York district for several years before returning to China to enrol at the Beijing Film Academy.\n\nLiu may not be formally trained in dance (her mother, Liu Xiaoli was a professional dancer with a performance troupe in the Chinese city of Wuhan), but she has shown her flexibility and agility in martial arts films, such as The Forbidden Kingdom (2008), where she acted alongside Jet Li and Jackie Chan.\n\nLiu as Xiaolongnu in Return of the Condor Heroes (2006).\n\nInternational ties\n\nLiu’s parents divorced while she was young and Liu took her mother’s maiden name. Her father, An Shaokang, was a professor at Wuhan University, where he taught French language and culture. He later joined the diplomatic corps, working at the Chinese embassy in Paris. He is now the dean of the The Confucius Institute of Paris Diderot University.\n\nThe Chinese Widow was a flop at the box office.\n\nBox-office poison\n\nAlthough the decision to cast Liu in the role of Mulan has been well received, it is not entirely without concern. Films Liu has starred in over the past few years have faired so poorly that she has been labelled “box-office poison”. The Chinese Widow , released last month, was a total flop, taking only 26 million yuan (US$3.9 million) versus production costs of more than 150 million yuan. Romance film The Third Way of Love (2015) only earned 73 million yuan at the box office.\n\nChinese internet users also point out that Liu may not be the right fit for Mulan, who disguises herself as a man to join the army in place of her father; some says Liu “will still look very much like a woman, even with a beard”.\n\nLiu (left) is known for taking untouched or blurry selfies.\n\nSelfie fails\n\nAlthough Liu looks stunning on magazine covers and in film shoots, she is known for taking unflattering selfies, which she posts on social media without editing or adding filters – something almost unheard of in Chinese social media, especially among celebrities. They are often either blurry, show her from an awkward angle, or are taken in bad lighting, causing her dismayed fans to ask, “why?”.\n\nLiu is a cat lover.\n\nCat lover\n\nShe loves cats, and often takes in strays. Liu and her mother work with a non-profit organisation to find them new homes. At one point, she had more than 30 cats living with her in her Beijing flat.\n\nWant more articles like this? Follow SCMP Film on Facebook", "images": ["https://cdn1.i-scmp.com/sites/default/files/images/methode/2017/12/01/cbc65740-d643-11e7-93d7-6d6fc14be448_1320x770_153802.jpg", "https://cdn.i-scmp.com/sites/default/files/styles/768x768/public/images/methode/2017/12/01/b3e62a46-d5b8-11e7-93d7-6d6fc14be448_1280x720_153802.jpg?itok=-jc5il3s", "https://img.i-scmp.com/cdn-cgi/image/fit=contain,width=60,format=auto/sites/default/files/styles/118x118/public/images/author/pic/2018/05/10/scmp_27apr17_fe_headshot1312_elmt9818_a_59506314.jpg?itok=0oMECV2t", "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2017/12/01/b3e62a46-d5b8-11e7-93d7-6d6fc14be448_image_hires_153802.jpg?itok=X6pVVqWd&v=1512113888", "https://cdn1.i-scmp.com/sites/default/files/images/methode/2017/12/01/b84ca8f8-d5b8-11e7-93d7-6d6fc14be448_972x_153802.jpg", "https://assets-v2.i-scmp.com/production/_next/static/media/wheel-on-gray.af4a55f9.gif", "https://cdn2.i-scmp.com/sites/default/files/images/methode/2017/12/01/59a1bc84-d645-11e7-93d7-6d6fc14be448_1320x770_153802.JPG", "https://cdn3.i-scmp.com/sites/default/files/images/methode/2017/12/01/df551020-d5b8-11e7-93d7-6d6fc14be448_1320x770_153802.jpg", "https://cdn1.i-scmp.com/sites/default/files/images/methode/2017/12/01/bca92598-d5b8-11e7-93d7-6d6fc14be448_972x_153802.jpg", "https://cdn3.i-scmp.com/sites/default/files/images/methode/2017/12/01/d5d5730a-d5b8-11e7-93d7-6d6fc14be448_1320x770_153802.jpg", "https://cdn3.i-scmp.com/sites/default/files/images/methode/2017/12/01/4d08bf18-d645-11e7-93d7-6d6fc14be448_1320x770_153802.JPG"], "top_img": "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2017/12/01/b3e62a46-d5b8-11e7-93d7-6d6fc14be448_image_hires_153802.jpg?itok=X6pVVqWd&v=1512113888", "keywords": [], "authors": ["Rachel Cheung"], "canonical_link": "https://www.scmp.com/culture/film-tv/article/2122402/crystal-liu-yifei-seven-things-you-dont-know-about-chinese-actress", "title": "Crystal Liu Yifei: seven things you don’t know about the Chinese actress playing Mulan", "meta_data": {"robots": "max-image-preview:large", "description": "With more than 53 million fans on Weibo, the 30-year-old actress is clearly a popular choice to lead the live-action remake set for release in 2019, but who exactly is she and what else has she starred in?", "twitter": {"card": "summary_large_image", "site": "@SCMPNews"}, "fb": {"app_id": 282931841805811}, "og": {"title": "Seven things you didn’t know about Disney’s Mulan star Liu Yifei", "description": "With more than 53 million fans on Weibo, the 30-year-old actress is clearly a popular choice to lead the live-action remake set for release in 2019, but who exactly is she and what else has she starred in?", "url": "https://www.scmp.com/culture/film-tv/article/2122402/crystal-liu-yifei-seven-things-you-dont-know-about-chinese-actress", "type": "article", "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2017/12/01/b3e62a46-d5b8-11e7-93d7-6d6fc14be448_image_hires_153802.jpg?itok=X6pVVqWd&v=1512113888", "site_name": "South China Morning Post"}, "al": {"ios": {"app_store_id": 623201967, "app_name": "SCMP", "url": "scmp://culture/film-tv/article/2122402/crystal-liu-yifei-seven-things-you-dont-know-about-chinese-actress?entity=node&type=article&id=2122402"}, "android": {"package": "com.scmp.newspulse", "app_name": "SCMP", "url": "scmp://culture/film-tv/article/2122402/crystal-liu-yifei-seven-things-you-dont-know-about-chinese-actress?entity=node&type=article&id=2122402"}}, "apple-itunes-app": "app-id=623201967", "keywords": "disney, mulan, disney studios, liu yifei", "news_keywords": "disney, mulan, disney studios, liu yifei", "article": {"section": "Film & TV", "tag": "Fame and celebrity", "published_time": "2017-12-01T12:45:40+08:00", "modified_time": "2019-07-08T18:49:21+08:00"}, "pocket-site-verification": "25fd909c3fd10ded451415fc076ba8", "theme-color": "#ffffff", "mobile-web-app-capable": "yes", "viewport": "width=device-width, maximum-scale=1, user-scalable=no, initial-scale=1", "cXenseParse": {"articleid": 2122402, "author": "Rachel Cheung", "image": "https://cdn.i-scmp.com/sites/default/files/styles/768x768/public/images/methode/2017/12/01/b3e62a46-d5b8-11e7-93d7-6d6fc14be448_image_hires_153802.jpg?itok=8cxIoI4-&v=1512113888"}, "next-head-count": 45}, "movies": [], "publish_date": 1512103540.0, "source": "https://www.scmp.com", "summary": ""}