{"url": "https://web.archive.org/web/20161028162434/http://people.com:80/archive/basic-instinct-vol-49-no-5", "text": "DEMI MOORE SAYS SHE SAVED her from some major business mistakes. Rosanna Arquette says she helped save her daughter’s life. Brad Pitt likes to drop by and play with her 5-year-old son Samson; wellness guru Deepak Chopra calls for advice. And Laura Day, the object of all this celebrity attention? “I’m not what you expect,” she insists. “I’m just your basic, straitlaced Jewish woman.”\n\nWho believes—as do her fans—that she has a highly accurate sense of intuition. “Intuition allows us to predict events,” claims Day, 38. She maintains that everyone has such abilities,, waiting to be developed; her 1996 how-to book, Practical Intuition, sold 133,000 hardcover copies, and her 1997 follow-up, Practical Intuition for Success, is the first part of a two-book, $3 million deal. Before becoming an author, Day earned as much as $5,000 a session advising filmmakers (on script and casting problems) and business executives (about market trends). “I don’t see hallucinations, it’s just a flash of something in my head,” says Day, who’s wary of being thought of as some spacey psychic or guru. “I’m not magical or New Age or a spiritual leader. There’s nothing that sets me apart from anyone else.”\n\nSo how to explain all those A-list amigos? “She’s very open and loving,” says Arquette, who met Day through a mutual friend, rocker Peter Gabriel. In 1996, Arquette phoned Day to tell her that her daughter Zoe, then 2, had a fever and diarrhea, which a doctor had said was the flu. “I had a very clear feeling that Zoe was going to die,” recalls Day, who saw to it that the girl was taken to a hospital, where she was diagnosed with a rare form of blood poisoning. “Laura’s information saved Zoe’s life,” says Arquette. “It was intense.”\n\nDay’s friendships with Hollywood heavyweights have helped her, too. When HarperCollins didn’t throw a bash for her second book last October, her friends, including close pal Brad Pitt, threw her a party instead. Demi Moore—or “Aunt Demi,” as she’s known to Samson—worked with Day on the set of 199l’s The Butcher’s Wife, in which Moore played a psychic. “Laura has given me a trust in my own intuition,” says the actress, who won’t reveal much about the business situation gone wrong but admits it would have been worse without Day’s intervention. “I took a greater position of responsibility,” says Moore. “Laura put me back in the driver’s seat.”\n\nDay says she discovered her special way of seeing things at an early age. The oldest of four children born in New York City to David Globus, now 67 and an internist, and Vivian, a full-time mother, Day was 11 when her mother, who suffered from depression, slipped into a coma after a suicide attempt. “I wanted her to live,” says Day, “and I needed to know what to do.” She recalls having an instinct to channel her own warmth and energy into Vivian’s body. Her mother pulled through but, three years later, succeeded in taking her own life.\n\nDay went on to study philosophy and religion at Syracuse University and, in 1979, at age 20, married Lee Day, now 39 and a Web site designer. Twelve years later they separated, and eight months after that, Day gave birth to their son Samson. Facing a mound of bills from a divorce that is still being litigated, Day, who had been teaching intuition workshops and taking a few consulting jobs, wondered how she could make ends meet and still be a full-time mother. “At the point when you’re most lost,” says Day, “that’s when intuition kicks in.”\n\nIntuition said: Write a book. Her ensuing success—she writes two hours a day and is now working on Intuition and Love, a guide to finding a mate—allows her to “do bake sales and book sales and be a very involved parent.” A perfect evening is cooking for a gaggle of friends in her New York City loft, which she and Samson share with a cat, three lizards, a mouse and nine fish. “People are drawn to Laura,” says Adam Robinson, 42, an educator and Day’s boyfriend of three years. “She makes them feel at ease and accepted. She radiates empathy.”\n\nAnd yet, Day only rarely gets intuitive about her own life, despite the success that trusting her gut has brought her. “I don’t want my environment perfect,” she says. “I work very hard to live in the moment. I’m interested in how I’m feeling right now.”\n\nALEX TRESNIOWSKI\n\n\n\nDEBBIE SEAMAN in New York City", "images": ["https://web.archive.org/web/20161028162434im_/http://0.gravatar.com/blavatar/a39c9d87d3ee529a684f7a5b3b557adc?s=200&ts=1477671874", "https://web.archive.org/web/20161028162434im_/http://i0.wp.com/peopledotcom.files.wordpress.com/2016/10/lynda-carter-gal-gadot.jpg?crop=182px%2C14px%2C1560px%2C1045px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/rihanna_rose_logo_1.jpg?crop=3px%2C0px%2C1913px%2C1280px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/tim_matheson_1280.jpg?crop=102px%2C0px%2C1076px%2C720px&resize=420%2C281&ssl=1", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://web.archive.org/web/20161028162434im_/http://i1.wp.com/peopledotcom.files.wordpress.com/2016/10/ciara_megyn_logo1.jpg?crop=3px%2C0px%2C1913px%2C1280px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://s2.wp.com/wp-content/mu-plugins/post-flair/sharing/images/loading.gif?m=1315610318h", "https://web.archive.org/web/20161028162434im_/https://s0.wp.com/wp-content/themes/vip/plugins/vip-do-not-include-on-wpcom/vip-powered-wpcom/images/vip-powered-light-small.png", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/anne-hathaway1.jpg?crop=0px%2C18px%2C1424px%2C953px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/08/dwayne-johnson-01-435-5.jpg?crop=0px%2C0px%2C435px%2C291px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/roger-trindade.jpg?crop=0px%2C124px%2C934px%2C626px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/tori_chris_logo_1.jpg?crop=3px%2C0px%2C1913px%2C1280px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://i2.wp.com/peopledotcom.files.wordpress.com/2016/10/nick-viall.jpg?crop=590px%2C8px%2C1145px%2C765px&resize=420%2C281&ssl=1", "https://web.archive.org/web/20161028162434im_/http://pixel.wp.com/b.gif?v=noscript"], "top_img": "https://web.archive.org/web/20161028162434im_/http://0.gravatar.com/blavatar/a39c9d87d3ee529a684f7a5b3b557adc?s=200&ts=1477671874", "keywords": [], "authors": ["Alex Tresniowski"], "canonical_link": "https://web.archive.org/web/20161028162434/http://people.com/archive/basic-instinct-vol-49-no-5/", "title": "Basic Instinct", "meta_data": {"viewport": "width=device-width, initial-scale=1", "apple-itunes-app": "app-id=1143086910", "description": "DEMI MOORE SAYS SHE SAVED her from some major business mistakes. Rosanna Arquette says she helped save her daughter's life. Brad Pitt likes to drop by and play with her 5-year-old son Samson; wellness guru Deepak Chopra calls for advice. And Laura Day, the object of all this celebrity attention? \"I'm not what you expect,\"", "generator": "WordPress.com", "og": {"type": "article", "title": "Basic Instinct – Vol. 49 No. 5", "url": "https://web.archive.org/web/20161028162434/http://people.com/archive/basic-instinct-vol-49-no-5/", "description": "DEMI MOORE SAYS SHE SAVED her from some major business mistakes. Rosanna Arquette says she helped save her daughter’s life. Brad Pitt likes to drop by and play with her 5-year-old son Samson;…", "site_name": "PEOPLE.com", "image": {"identifier": "https://web.archive.org/web/20161028162434im_/http://0.gravatar.com/blavatar/a39c9d87d3ee529a684f7a5b3b557adc?s=200&ts=1477671874", "width": 200, "height": 200}, "locale": "en_US"}, "article": {"published_time": "1998-02-09T12:00:00+00:00", "modified_time": "1998-02-09T12:00:00+00:00", "publisher": "https://www.facebook.com/WordPresscom"}, "twitter": {"card": "summary_large_image", "site": "@people", "creator": "@people"}, "application-name": "PEOPLE.com", "msapplication-window": "width=device-width;height=device-height", "msapplication-task": "name=Subscribe;action-uri=http://people.com/feed/;icon-uri=http://0.gravatar.com/blavatar/a39c9d87d3ee529a684f7a5b3b557adc?s=16"}, "movies": [], "publish_date": 887025600.0, "source": "https://web.archive.org", "summary": ""}