{"url": "https://www.inquisitr.com/4971003/kourtney-kim-khloe-kardashian-celebrate-the-fourth-of-july-in-style/", "text": "The Kardashian sisters were living their best lives during their Fourth Of July celebrations on Wednesday. Kourtney, Kim, and Khloe Kardashian all celebrated America’s birthday in style and in their own way.\n\nAccording to a July 4 report by E! Online, Kourtney, Kim, and Khloe all celebrated the holiday in true Kardashian fashion. Kim showed off her big Fourth celebration via Instagram. The mother of three headed to the lake where she and her group of friends tried wakeboarding for the first time. “This was way harder than it looks!!!” Kim wrote via her Instagram story.\n\nKim Kardashian wore a blue and white bikini for her holiday outing, and paired the swimsuit with a pair of sunglasses. She also wore her hair in two braids. Later, she checked out the nearby water slides and trampolines.\n\nMeanwhile, Kourtney Kardashian celebrated the Fourth of July in Italy. Kourtney has been vacationing overseas for the past two weeks with her boyfriend, Younes Bendjima. The reality star has been showing off her hot bikini body during the vacation, as well as some major PDA with her man.\n\nOn Wednesday, Kourtney Kardashian revealed that she had run into a world-famous fashion designer. “Dolce, Dolce, Dolce,” Kourt captioned the photo of herself while wearing Dolce & Gabbana.\n\nHowever, it was Khloe Kardashian that seemed to party the hardest during her Fourth of July celebration. Khloe, who only recently moved back to L.A. after months of living in Cleveland, threw a big backyard bash with her baby daddy, Tristan Thompson.\n\nKhloe Kardashian showed off some highlights from her big party via her Instagram story. The Keeping Up With the Kardashians star revealed that her closest friends were in attendance at the bash, including her sister Kendall Jenner and her boyfriend, NBA star Ben Simmons, who were spotted cuddling up in one of the videos posted by Khloe.\n\nThe party also included Funboy floats, inflatable slides, and food made by Chef K. Khloe also provided sweet treats by Ice Cream Occasions. However, Kardashian didn’t don a bikini for her party. Instead, she rocked a bright neon orange spandex outfit from the Yeezy Season 7 collection, a look that Kim Kardashian is often seen wearing while out and about in Hollywood.\n\nThe three Kardashian sisters seemingly had a great time during their separate outings for the Fourth of July. Fans are now hoping that they’ll get to see more of their holiday celebrations when Keeping Up With the Kardashians begins airing a brand new season in August.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4971003/kourtney-kim-khloe-kardashian-celebrate-the-fourth-of-july-in-style", "title": "Kourtney, Kim, & Khloe Kardashian Celebrate The Fourth Of July In Style", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "The Kardashian sisters were living their best lives during their Fourth Of July celebrations on Wednesday. Kourtney, Kim, and Khloe Kardashian all celebrated America&#8217;s birthday in style and in their own way. According to a July 4 report by E! Online, Kourtney, Kim, and Khloe all celebrated the holiday in true Kardashian fashion. Kim showed [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Kourtney, Kim, & Khloe Kardashian Celebrate The Fourth Of July In Style", "url": "https://www.inquisitr.com/4971003/kourtney-kim-khloe-kardashian-celebrate-the-fourth-of-july-in-style", "type": "article", "description": "The Kardashian sisters were living their best lives during their Fourth Of July celebrations on Wednesday. Kourtney, Kim, and Khloe Kardashian all celebrated America&#8217;s birthday in style and in their own way. According to a July 4 report by E! Online, Kourtney, Kim, and Khloe all celebrated the holiday in true Kardashian fashion. Kim showed [&hellip;]"}, "article": {"published_time": "2018-07-05T00:03:13", "modified_time": "2018-07-05T00:03:13", "author": "Amanda Lynne"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Kourtney, Kim, & Khloe Kardashian Celebrate The Fourth Of July In Style", "description": "The Kardashian sisters were living their best lives during their Fourth Of July celebrations on Wednesday. Kourtney, Kim, and Khloe Kardashian all celebrated America&#8217;s birthday in style and in their own way. According to a July 4 report by E! Online, Kourtney, Kim, and Khloe all celebrated the holiday in true Kardashian fashion. Kim showed [&hellip;]"}}, "movies": [], "publish_date": 1530738193.0, "source": "https://www.inquisitr.com", "summary": ""}