{"url": "https://www.apnews.com/5f64e44b43e142efbe52ddbd2163acc8", "text": "LOS ANGELES (AP) — The Latest on the nominations for the 70th annual Emmy Awards, which are being announced Thursday by in Los Angeles (all times local):\n\n11:30 a.m.\n\nSamira Wiley says she had no idea she would find out she was nominated for an Emmy Award while presenting the nominations Thursday morning.\n\nWiley says her category, best guest actress in a drama series, wasn’t on the list of categories she and actor Ryan Eggold were to read. Television Academy Chairman and CEO Hayma Washington surprised Wiley with the news during the presentation.\n\nWiley says she didn’t think she was going to have to process whether she was nominated at all in public. The actress’ nomination is one of 20 that “The Handmaid’s Tale” earned Thursday.\n\nAfter the presentation, Wiley moved straight to interviews, so she hadn’t yet had a chance to join a group text chain with her co-stars. She says the show’s bounty of nominations, up from 13 last year, feels like a “real graduation.”\n\nAfter a whirlwind morning, Wiley says she wants to take some time for herself to process the nomination, her second.\n\nWiley says, “I’m going to take a moment today ... to have a moment by myself and just reflect and think and be thankful.”\n\n___\n\n11 a.m.\n\nGlobe-trotting food chronicler Anthony Bourdain has received several posthumous Emmy nominations on Thursday.\n\nBourdain’s CNN series, “Anthony Bourdain: Parts Unknown,” got six nods, including two personally for Bourdain as executive producer, host and writer. A seventh nod went to his “Explore Parts Unknown” on cnn.com.\n\nBourdain took his life in early June in eastern France, where he was working on an episode of his show. He was 61.\n\nAlso a celebrated author, Bourdain was known for using culinary traditions as a storytelling tool to explore cultures around the globe.\n\nHe won Emmy Awards from 2013 through 2016 for outstanding informational series or special for “Parts Unknown.”\n\n___\n\n10:20 a.m.\n\nBill Hader says he was excited but exhausted when he heard the news Thursday morning that he was nominated for best lead actor in a comedy series for HBO’s “Barry.”\n\nIt wasn’t the only Emmys love for Hader, who on Thursday also received nominations for his writing and directing on the series, and for returning as guest host on his old show “Saturday Night Live.”\n\nHader is in Toronto shooting “It 2\" and says there’s no time to pop open champagne or party with his colleagues. He spoke to The Associated Press while eating breakfast before getting picked up for an all-night shoot on the horror sequel.\n\nHe says the nominations for “Barry” feel especially good, since it’s the show’s first season and that he’s pleased for co-star Henry Winkler, who received a supporting actor nomination.\n\n___\n\n9:45 a.m.\n\nSandra Oh has made Emmys history by becoming the first nominee of Asian descent in the leading actress in a drama series.\n\nOh was nominated Thursday for her role in the BBC America series “Killing Eve” as a spy hunting a female assassin.\n\nThe 46-year-old Canadian-born actress has five previous drama supporting actress nominations for “Grey’s Anatomy.”\n\nA study of the 2015-16 season released last year concluded that characters of Asian or Pacific Islander descent remain underrepresented on television, even on shows set in major cities.\n\n___\n\n9:20 a.m.\n\nMusic stars in competition for Emmys this year include John Legend, Bruno Mars and Sara Bareilles.\n\nLegend and Bareilles each earned acting nods for their roles in NBC’s “Jesus Christ Superstar Live In Concert.” Mars earned a nomination for outstanding music direction for his first TV special, CBS’ “Bruno Mars: 24K Magic Live at the Apollo.”\n\nLegend, who has won several Grammys as well as an Oscar and a Tony, could become an EGOT if he takes home outstanding lead actor in a limited series or movie.\n\nThe term EGOT refers to someone who has won one of all the major awards: an Emmy, Grammy, Oscar and Tony.\n\nBenj Pasek and Justin Paul are also on their way to EGOT status: The composing duo earned a nomination for outstanding original music and lyrics for “In the Market for a Miracle” from Fox’s “A Christmas Story Live!”\n\n___\n\n9:10 a.m.\n\nThe Emmy nominations for outstanding reality competition show have been announced. The nominees are: “The Amazing Race\"; “American Ninja Warrior\"; “Project Runway\"; “RuPaul’s Drag Race\"; “Top Chef\"; “The Voice”.\n\nThe field is identical to last year, when “The Voice” took home the Emmy statuette. “The Voice” and “RuPaul’s Drag Race” tied for most nominations for a reality program with 10 apiece.\n\nThe Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of “Saturday Night Live” as hosts.\n\n___\n\n9 a.m.\n\nHBO’s “Game of Thrones” has received the most nominations for this year’s Emmy Awards, but the haul could not stop Netflix from becoming the most-nominated network atthis year.\n\nNetflix is the network received 112 nominations this year, up from 91 last year. Its nominations were spread around numerous shows, including “Stranger Things,” ’'The Crown,” ’'GLOW” and “Godless.”\n\n“Game of Thrones” received several supporting acting nominations, including for Lena Headey, Nikolaj Coster-Waldau and Peter Dinklage.\n\n___\n\n8:45 a.m.\n\n“Game of Thrones” roared back onto the Emmy battlefield, topping Thursday’s nominations with 22 bids.\n\nHBO’s fantasy saga is a two-time best drama winner that sat out the last year’s awards.\n\nIt’s returning to face formidable competition: “The Handmaid’s Tale,” the dystopian sci-fi series that claimed top drama honors last year, drew 20 bids, with “Westworld” close by with 21.\n\nDonald Glover’s “Atlanta” is the top comedy with 16 bids. It will face newcomers including “The Marvelous Mrs. Maisel” and “Barry,” starring Bill Hader.\n\nThe revival of “Roseanne,” canceled because of star Roseanne Barr’s racist tweet, drew only one major nomination, a supporting actress nod for Laurie Metcalf.\n\n“Saturday Night Live,” riding high with its relentless pillorying of the Trump administration, was rewarded with 21 nods.\n\nThe previous high for “Game of Thrones” was 24 nominations in 2015. It got 23 nods in 2016 but wasn’t eligible last year.\n\nThe Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of “Saturday Night Live” as hosts.\n\n___\n\n8:40 a.m.\n\nThe Emmy nominations for the top television drama and comedy series have been announced.\n\nThe nominees for best drama series include: “The Americans,” ’'The Crown,” Game of Thrones,” ’'The Handmaid’s Tale,” ’'Stranger Things,” This Is Us” and “Westworld.”\n\nThe nominees for best comedy series include: “Atlanta,” ’'Barry,” ’'black-ish,” ’'Curb Your Enthusiasm,” ’'GLOW,” ’'The Marvelous Mrs. Maisel,” ’'Silicon Valley” and “Unbreakable Kimmy Schmidt.”\n\n___\n\n8:35 a.m.\n\nThe 2018 Emmy nominations for lead actors in a drama series have been announced.\n\nThe nominees for best actor in a drama series include: Jason Bateman, “Ozark\"; Sterling K. Brown, “This Is Us\"; Ed Harris, “Westworld\"; Matthew Rhys, “The Americans\"; Milo Ventimiglia, “This Is Us” and Jeffrey Wright, “Westworld.\n\nThe nominees for best actress in a drama series include: Claire Foy, “The Crown\"; Tatiana Maslany, “Orphan Black\"; Elisabeth Moss, “The Handmaid’s Tale\"; Sandra Oh, “Killing Eve\"; Keri Russell, “The Americans\"; Evan Rachel Wood, “Westworld.”\n\n___\n\n8:30 a.m.\n\nThe nominees for lead actor in a limited series or movie include: Antonio Banderas, “Genius: Picasso\"; Darren Criss, “The Assassination of Gianni Versace: American Crime Story\"; Benedict Cumberbatch, “Patrick Melrose,” Jeff Daniels, “The Looming Tower\"; John Legend, “Jesus Christ Superstar: Live in Concert\"; Jesse Plemons, “USS Callister (Black Mirror.)”\n\n___\n\nThis story corrects Plemons’ last name.\n\n___\n\n8 a.m.\n\nThe final preparations are being made for the 2018 Emmy nominations.\n\nActors Samira Wiley of “The Handmaid’s Tale” and Ryan Eggold, who starred in “The Blacklist,” will read this year’s nominees beginning at 8:25 a.m. PDT. About an hour before the nominations, Wiley, wearing a burgundy dress and gold heels, stepped out into the lobby of the television academy and snapped photos in front of a giant screen promoting the 70th annual Emmys.\n\nDozens of journalists have cameras set up to record the announcement, which will be made on a giant stage decked out with four giant Emmy statuettes.\n\nWiley is a possible nominee for “Handmaid’s Tale,” which won best drama series last year.\n\nThe Emmy Awards will be presented Sept. 17 on NBC with Colin Jost and Michael Che of “Saturday Night Live” as hosts.\n\n___\n\n3 a.m.\n\nBlockbuster movies typically are snubbed by the Oscars, leaving fans grumbling, but TV’s top prize takes a different approach.\n\nWhen the 70th Emmy Awards nominees are announced Thursday morning, popular series including HBO’s “Game of Thrones,” NBC’s “This Is Us” and CBS’ “Mom” are likely to be in the running.\n\n“Game of Thrones” is a two-time best drama series winner. It’s back in the running for honors for its next-to-last season after a production delay kept it out of the 2017 competition.\n\nIts biggest adversary is “The Handmaid’s Tale,” the dystopian drama that captured last year’s top series prize and acting awards for Elisabeth Moss, Ann Dowd and Alexis Bledel among its eight wins.\n\nThe Emmy Awards ceremony airs Sept. 17 on NBC.", "images": ["https://sb.scorecardresearch.com/p?c1=2&;c2=3005041&cv=3.6.0&cj=1", "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png", "https://dims.apnews.com/dims4/default/94c503b/2147483647/strip/true/crop/640x236+0+0/resize/320x118!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F4c%2F65482a7b452db66043542c093eaf%2Fpromo-2x.png", "https://dims.apnews.com/dims4/default/8650001/2147483647/strip/true/crop/992x617+0+0/resize/225x140!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F24%2F7ff11448446fb8500bc984551325%2Faplogo-with-tagline.png", "https://assets.apnews.com/fa/ba/9258a7114f5ba5c7202aaa1bdd66/aplogo.svg"], "top_img": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png", "keywords": [], "authors": [], "canonical_link": "", "title": "The Latest: No time for Samira Wiley to process Emmys nom", "meta_data": {"og": {"title": "The Latest: No time for Samira Wiley to process Emmys nom", "image": {"identifier": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png", "url": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png", "width": 1440, "height": 810, "type": "image/png"}, "description": "LOS ANGELES (AP) — The Latest on the nominations for the 70th annual Emmy Awards, which are being announced Thursday by in Los Angeles (all times local): 11:30 a.m. Samira Wiley says she had no idea she would find out she was nominated for an Emmy Award while presenting the nominations Thursday morning. Wiley says her category, best guest actress in a drama series, wasn't on the list of categories she and actor Ryan Eggold were to read. Television Academy Chairman and CEO Hayma Washington surprised Wiley with the news during the presentation. Wiley says she didn't think she was going to have to process whether she was nominated at all in public. The actress' nomination is one of 20 that \"The Handmaid's Tale\" earned Thursday. After the presentation, Wiley moved straight to interviews, so she hadn't yet had a chance to join a group text chain with her co-stars. She says the show's bounty of nominations, up from 13 last year, feels like a \"real graduation.\" After a whirlwind morning, Wiley says she wants to take some time for herself to process the nomination, her second. Wiley says, \"I'm going to take a moment today ... to have a moment by myself and just reflect and think and be thankful.\" ___ 11 a.m. Globe-trotting food chronicler Anthony Bourdain has received several posthumous Emmy nominations on Thursday. Bourdain's CNN series, \"Anthony Bourdain: Parts Unknown,\" got six nods, including two personally for Bourdain as executive producer, host and writer. A seventh nod went to his \"Explore Parts Unknown\" on cnn.com. Bourdain took his life in early June in eastern France, where he was working on an episode of his show. He was 61. Also a celebrated author, Bourdain was known for using culinary traditions as a storytelling tool to explore cultures around the globe. He won Emmy Awards from 2013 through 2016 for outstanding informational series or special for \"Parts Unknown.\" ___ 10:20 a.m. Bill Hader says he was excited but exhausted when he heard the news Thursday morning that he was nominated for best lead actor in a comedy series for HBO's \"Barry.\" It wasn't the only Emmys love for Hader, who on Thursday also received nominations for his writing and directing on the series, and for returning as guest host on his old show \"Saturday Night Live.\" Hader is in Toronto shooting \"It 2\" and says there's no time to pop open champagne or party with his colleagues. He spoke to The Associated Press while eating breakfast before getting picked up for an all-night shoot on the horror sequel. He says the nominations for \"Barry\" feel especially good, since it's the show's first season and that he's pleased for co-star Henry Winkler, who received a supporting actor nomination. ___ 9:45 a.m. Sandra Oh has made Emmys history by becoming the first nominee of Asian descent in the leading actress in a drama series. Oh was nominated Thursday for her role in the BBC America series \"Killing Eve\" as a spy hunting a female assassin. The 46-year-old Canadian-born actress has five previous drama supporting actress nominations for \"Grey's Anatomy.\" A study of the 2015-16 season released last year concluded that characters of Asian or Pacific Islander descent remain underrepresented on television, even on shows set in major cities. ___ 9:20 a.m. Music stars in competition for Emmys this year include John Legend, Bruno Mars and Sara Bareilles. Legend and Bareilles each earned acting nods for their roles in NBC's \"Jesus Christ Superstar Live In Concert.\" Mars earned a nomination for outstanding music direction for his first TV special, CBS' \"Bruno Mars: 24K Magic Live at the Apollo.\" Legend, who has won several Grammys as well as an Oscar and a Tony, could become an EGOT if he takes home outstanding lead actor in a limited series or movie. The term EGOT refers to someone who has won one of all the major awards: an Emmy, Grammy, Oscar and Tony. Benj Pasek and Justin Paul are also on their way to EGOT status: The composing duo earned a nomination for outstanding original music and lyrics for \"In the Market for a Miracle\" from Fox's \"A Christmas Story Live!\" ___ 9:10 a.m. The Emmy nominations for outstanding reality competition show have been announced. The nominees are: \"The Amazing Race\"; \"American Ninja Warrior\"; \"Project Runway\"; \"RuPaul's Drag Race\"; \"Top Chef\"; \"The Voice\". The field is identical to last year, when \"The Voice\" took home the Emmy statuette. \"The Voice\" and \"RuPaul's Drag Race\" tied for most nominations for a reality program with 10 apiece. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 9 a.m. HBO's \"Game of Thrones\" has received the most nominations for this year's Emmy Awards, but the haul could not stop Netflix from becoming the most-nominated network atthis year. Netflix is the network received 112 nominations this year, up from 91 last year. Its nominations were spread around numerous shows, including \"Stranger Things,\" ''The Crown,\" ''GLOW\" and \"Godless.\" \"Game of Thrones\" received several supporting acting nominations, including for Lena Headey, Nikolaj Coster-Waldau and Peter Dinklage. ___ 8:45 a.m. \"Game of Thrones\" roared back onto the Emmy battlefield, topping Thursday's nominations with 22 bids. HBO's fantasy saga is a two-time best drama winner that sat out the last year's awards. It's returning to face formidable competition: \"The Handmaid's Tale,\" the dystopian sci-fi series that claimed top drama honors last year, drew 20 bids, with \"Westworld\" close by with 21. Donald Glover's \"Atlanta\" is the top comedy with 16 bids. It will face newcomers including \"The Marvelous Mrs. Maisel\" and \"Barry,\" starring Bill Hader. The revival of \"Roseanne,\" canceled because of star Roseanne Barr's racist tweet, drew only one major nomination, a supporting actress nod for Laurie Metcalf. \"Saturday Night Live,\" riding high with its relentless pillorying of the Trump administration, was rewarded with 21 nods. The previous high for \"Game of Thrones\" was 24 nominations in 2015. It got 23 nods in 2016 but wasn't eligible last year. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 8:40 a.m. The Emmy nominations for the top television drama and comedy series have been announced. The nominees for best drama series include: \"The Americans,\" ''The Crown,\" Game of Thrones,\" ''The Handmaid's Tale,\" ''Stranger Things,\" This Is Us\" and \"Westworld.\" The nominees for best comedy series include: \"Atlanta,\" ''Barry,\" ''black-ish,\" ''Curb Your Enthusiasm,\" ''GLOW,\" ''The Marvelous Mrs. Maisel,\" ''Silicon Valley\" and \"Unbreakable Kimmy Schmidt.\" ___ 8:35 a.m. The 2018 Emmy nominations for lead actors in a drama series have been announced. The nominees for best actor in a drama series include: Jason Bateman, \"Ozark\"; Sterling K. Brown, \"This Is Us\"; Ed Harris, \"Westworld\"; Matthew Rhys, \"The Americans\"; Milo Ventimiglia, \"This Is Us\" and Jeffrey Wright, \"Westworld. The nominees for best actress in a drama series include: Claire Foy, \"The Crown\"; Tatiana Maslany, \"Orphan Black\"; Elisabeth Moss, \"The Handmaid's Tale\"; Sandra Oh, \"Killing Eve\"; Keri Russell, \"The Americans\"; Evan Rachel Wood, \"Westworld.\" ___ 8:30 a.m. The nominees for lead actor in a limited series or movie include: Antonio Banderas, \"Genius: Picasso\"; Darren Criss, \"The Assassination of Gianni Versace: American Crime Story\"; Benedict Cumberbatch, \"Patrick Melrose,\" Jeff Daniels, \"The Looming Tower\"; John Legend, \"Jesus Christ Superstar: Live in Concert\"; Jesse Plemons, \"USS Callister (Black Mirror.)\" ___ This story corrects Plemons' last name. ___ 8 a.m. The final preparations are being made for the 2018 Emmy nominations. Actors Samira Wiley of \"The Handmaid's Tale\" and Ryan Eggold, who starred in \"The Blacklist,\" will read this year's nominees beginning at 8:25 a.m. PDT. About an hour before the nominations, Wiley, wearing a burgundy dress and gold heels, stepped out into the lobby of the television academy and snapped photos in front of a giant screen promoting the 70th annual Emmys. Dozens of journalists have cameras set up to record the announcement, which will be made on a giant stage decked out with four giant Emmy statuettes. Wiley is a possible nominee for \"Handmaid's Tale,\" which won best drama series last year. The Emmy Awards will be presented Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 3 a.m. Blockbuster movies typically are snubbed by the Oscars, leaving fans grumbling, but TV's top prize takes a different approach. When the 70th Emmy Awards nominees are announced Thursday morning, popular series including HBO's \"Game of Thrones,\" NBC's \"This Is Us\" and CBS' \"Mom\" are likely to be in the running. \"Game of Thrones\" is a two-time best drama series winner. It's back in the running for honors for its next-to-last season after a production delay kept it out of the 2017 competition. Its biggest adversary is \"The Handmaid's Tale,\" the dystopian drama that captured last year's top series prize and acting awards for Elisabeth Moss, Ann Dowd and Alexis Bledel among its eight wins. The Emmy Awards ceremony airs Sept. 17 on NBC.", "site_name": "AP News", "type": "article"}, "thumbnail": "https://dims.apnews.com/dims4/default/dcac1a4/2147483647/strip/true/crop/700x394+0+28/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F90%2F29%2F4e3c1cc7446089a9101a7bdff4c8%2Fdefaultshareimage-copy.png", "article": {"published_time": "2018-07-12T19:16:39", "modified_time": "2018-07-12T19:16:39"}, "twitter": {"card": "summary_large_image", "description": "LOS ANGELES (AP) — The Latest on the nominations for the 70th annual Emmy Awards, which are being announced Thursday by in Los Angeles (all times local): 11:30 a.m. Samira Wiley says she had no idea she would find out she was nominated for an Emmy Award while presenting the nominations Thursday morning. Wiley says her category, best guest actress in a drama series, wasn't on the list of categories she and actor Ryan Eggold were to read. Television Academy Chairman and CEO Hayma Washington surprised Wiley with the news during the presentation. Wiley says she didn't think she was going to have to process whether she was nominated at all in public. The actress' nomination is one of 20 that \"The Handmaid's Tale\" earned Thursday. After the presentation, Wiley moved straight to interviews, so she hadn't yet had a chance to join a group text chain with her co-stars. She says the show's bounty of nominations, up from 13 last year, feels like a \"real graduation.\" After a whirlwind morning, Wiley says she wants to take some time for herself to process the nomination, her second. Wiley says, \"I'm going to take a moment today ... to have a moment by myself and just reflect and think and be thankful.\" ___ 11 a.m. Globe-trotting food chronicler Anthony Bourdain has received several posthumous Emmy nominations on Thursday. Bourdain's CNN series, \"Anthony Bourdain: Parts Unknown,\" got six nods, including two personally for Bourdain as executive producer, host and writer. A seventh nod went to his \"Explore Parts Unknown\" on cnn.com. Bourdain took his life in early June in eastern France, where he was working on an episode of his show. He was 61. Also a celebrated author, Bourdain was known for using culinary traditions as a storytelling tool to explore cultures around the globe. He won Emmy Awards from 2013 through 2016 for outstanding informational series or special for \"Parts Unknown.\" ___ 10:20 a.m. Bill Hader says he was excited but exhausted when he heard the news Thursday morning that he was nominated for best lead actor in a comedy series for HBO's \"Barry.\" It wasn't the only Emmys love for Hader, who on Thursday also received nominations for his writing and directing on the series, and for returning as guest host on his old show \"Saturday Night Live.\" Hader is in Toronto shooting \"It 2\" and says there's no time to pop open champagne or party with his colleagues. He spoke to The Associated Press while eating breakfast before getting picked up for an all-night shoot on the horror sequel. He says the nominations for \"Barry\" feel especially good, since it's the show's first season and that he's pleased for co-star Henry Winkler, who received a supporting actor nomination. ___ 9:45 a.m. Sandra Oh has made Emmys history by becoming the first nominee of Asian descent in the leading actress in a drama series. Oh was nominated Thursday for her role in the BBC America series \"Killing Eve\" as a spy hunting a female assassin. The 46-year-old Canadian-born actress has five previous drama supporting actress nominations for \"Grey's Anatomy.\" A study of the 2015-16 season released last year concluded that characters of Asian or Pacific Islander descent remain underrepresented on television, even on shows set in major cities. ___ 9:20 a.m. Music stars in competition for Emmys this year include John Legend, Bruno Mars and Sara Bareilles. Legend and Bareilles each earned acting nods for their roles in NBC's \"Jesus Christ Superstar Live In Concert.\" Mars earned a nomination for outstanding music direction for his first TV special, CBS' \"Bruno Mars: 24K Magic Live at the Apollo.\" Legend, who has won several Grammys as well as an Oscar and a Tony, could become an EGOT if he takes home outstanding lead actor in a limited series or movie. The term EGOT refers to someone who has won one of all the major awards: an Emmy, Grammy, Oscar and Tony. Benj Pasek and Justin Paul are also on their way to EGOT status: The composing duo earned a nomination for outstanding original music and lyrics for \"In the Market for a Miracle\" from Fox's \"A Christmas Story Live!\" ___ 9:10 a.m. The Emmy nominations for outstanding reality competition show have been announced. The nominees are: \"The Amazing Race\"; \"American Ninja Warrior\"; \"Project Runway\"; \"RuPaul's Drag Race\"; \"Top Chef\"; \"The Voice\". The field is identical to last year, when \"The Voice\" took home the Emmy statuette. \"The Voice\" and \"RuPaul's Drag Race\" tied for most nominations for a reality program with 10 apiece. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 9 a.m. HBO's \"Game of Thrones\" has received the most nominations for this year's Emmy Awards, but the haul could not stop Netflix from becoming the most-nominated network atthis year. Netflix is the network received 112 nominations this year, up from 91 last year. Its nominations were spread around numerous shows, including \"Stranger Things,\" ''The Crown,\" ''GLOW\" and \"Godless.\" \"Game of Thrones\" received several supporting acting nominations, including for Lena Headey, Nikolaj Coster-Waldau and Peter Dinklage. ___ 8:45 a.m. \"Game of Thrones\" roared back onto the Emmy battlefield, topping Thursday's nominations with 22 bids. HBO's fantasy saga is a two-time best drama winner that sat out the last year's awards. It's returning to face formidable competition: \"The Handmaid's Tale,\" the dystopian sci-fi series that claimed top drama honors last year, drew 20 bids, with \"Westworld\" close by with 21. Donald Glover's \"Atlanta\" is the top comedy with 16 bids. It will face newcomers including \"The Marvelous Mrs. Maisel\" and \"Barry,\" starring Bill Hader. The revival of \"Roseanne,\" canceled because of star Roseanne Barr's racist tweet, drew only one major nomination, a supporting actress nod for Laurie Metcalf. \"Saturday Night Live,\" riding high with its relentless pillorying of the Trump administration, was rewarded with 21 nods. The previous high for \"Game of Thrones\" was 24 nominations in 2015. It got 23 nods in 2016 but wasn't eligible last year. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 8:40 a.m. The Emmy nominations for the top television drama and comedy series have been announced. The nominees for best drama series include: \"The Americans,\" ''The Crown,\" Game of Thrones,\" ''The Handmaid's Tale,\" ''Stranger Things,\" This Is Us\" and \"Westworld.\" The nominees for best comedy series include: \"Atlanta,\" ''Barry,\" ''black-ish,\" ''Curb Your Enthusiasm,\" ''GLOW,\" ''The Marvelous Mrs. Maisel,\" ''Silicon Valley\" and \"Unbreakable Kimmy Schmidt.\" ___ 8:35 a.m. The 2018 Emmy nominations for lead actors in a drama series have been announced. The nominees for best actor in a drama series include: Jason Bateman, \"Ozark\"; Sterling K. Brown, \"This Is Us\"; Ed Harris, \"Westworld\"; Matthew Rhys, \"The Americans\"; Milo Ventimiglia, \"This Is Us\" and Jeffrey Wright, \"Westworld. The nominees for best actress in a drama series include: Claire Foy, \"The Crown\"; Tatiana Maslany, \"Orphan Black\"; Elisabeth Moss, \"The Handmaid's Tale\"; Sandra Oh, \"Killing Eve\"; Keri Russell, \"The Americans\"; Evan Rachel Wood, \"Westworld.\" ___ 8:30 a.m. The nominees for lead actor in a limited series or movie include: Antonio Banderas, \"Genius: Picasso\"; Darren Criss, \"The Assassination of Gianni Versace: American Crime Story\"; Benedict Cumberbatch, \"Patrick Melrose,\" Jeff Daniels, \"The Looming Tower\"; John Legend, \"Jesus Christ Superstar: Live in Concert\"; Jesse Plemons, \"USS Callister (Black Mirror.)\" ___ This story corrects Plemons' last name. ___ 8 a.m. The final preparations are being made for the 2018 Emmy nominations. Actors Samira Wiley of \"The Handmaid's Tale\" and Ryan Eggold, who starred in \"The Blacklist,\" will read this year's nominees beginning at 8:25 a.m. PDT. About an hour before the nominations, Wiley, wearing a burgundy dress and gold heels, stepped out into the lobby of the television academy and snapped photos in front of a giant screen promoting the 70th annual Emmys. Dozens of journalists have cameras set up to record the announcement, which will be made on a giant stage decked out with four giant Emmy statuettes. Wiley is a possible nominee for \"Handmaid's Tale,\" which won best drama series last year. The Emmy Awards will be presented Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 3 a.m. Blockbuster movies typically are snubbed by the Oscars, leaving fans grumbling, but TV's top prize takes a different approach. When the 70th Emmy Awards nominees are announced Thursday morning, popular series including HBO's \"Game of Thrones,\" NBC's \"This Is Us\" and CBS' \"Mom\" are likely to be in the running. \"Game of Thrones\" is a two-time best drama series winner. It's back in the running for honors for its next-to-last season after a production delay kept it out of the 2017 competition. Its biggest adversary is \"The Handmaid's Tale,\" the dystopian drama that captured last year's top series prize and acting awards for Elisabeth Moss, Ann Dowd and Alexis Bledel among its eight wins. The Emmy Awards ceremony airs Sept. 17 on NBC.", "site": "@AP", "title": "The Latest: No time for Samira Wiley to process Emmys nom"}, "fb": {"app_id": 2220391788200892}, "robots": "max-image-preview:large", "viewport": "width=device-width, initial-scale=1, minimum-scale=1", "description": "LOS ANGELES (AP) — The Latest on the nominations for the 70th annual Emmy Awards, which are being announced Thursday by in Los Angeles (all times local): 11:30 a.m. Samira Wiley says she had no idea she would find out she was nominated for an Emmy Award while presenting the nominations Thursday morning. Wiley says her category, best guest actress in a drama series, wasn't on the list of categories she and actor Ryan Eggold were to read. Television Academy Chairman and CEO Hayma Washington surprised Wiley with the news during the presentation. Wiley says she didn't think she was going to have to process whether she was nominated at all in public. The actress' nomination is one of 20 that \"The Handmaid's Tale\" earned Thursday. After the presentation, Wiley moved straight to interviews, so she hadn't yet had a chance to join a group text chain with her co-stars. She says the show's bounty of nominations, up from 13 last year, feels like a \"real graduation.\" After a whirlwind morning, Wiley says she wants to take some time for herself to process the nomination, her second. Wiley says, \"I'm going to take a moment today ... to have a moment by myself and just reflect and think and be thankful.\" ___ 11 a.m. Globe-trotting food chronicler Anthony Bourdain has received several posthumous Emmy nominations on Thursday. Bourdain's CNN series, \"Anthony Bourdain: Parts Unknown,\" got six nods, including two personally for Bourdain as executive producer, host and writer. A seventh nod went to his \"Explore Parts Unknown\" on cnn.com. Bourdain took his life in early June in eastern France, where he was working on an episode of his show. He was 61. Also a celebrated author, Bourdain was known for using culinary traditions as a storytelling tool to explore cultures around the globe. He won Emmy Awards from 2013 through 2016 for outstanding informational series or special for \"Parts Unknown.\" ___ 10:20 a.m. Bill Hader says he was excited but exhausted when he heard the news Thursday morning that he was nominated for best lead actor in a comedy series for HBO's \"Barry.\" It wasn't the only Emmys love for Hader, who on Thursday also received nominations for his writing and directing on the series, and for returning as guest host on his old show \"Saturday Night Live.\" Hader is in Toronto shooting \"It 2\" and says there's no time to pop open champagne or party with his colleagues. He spoke to The Associated Press while eating breakfast before getting picked up for an all-night shoot on the horror sequel. He says the nominations for \"Barry\" feel especially good, since it's the show's first season and that he's pleased for co-star Henry Winkler, who received a supporting actor nomination. ___ 9:45 a.m. Sandra Oh has made Emmys history by becoming the first nominee of Asian descent in the leading actress in a drama series. Oh was nominated Thursday for her role in the BBC America series \"Killing Eve\" as a spy hunting a female assassin. The 46-year-old Canadian-born actress has five previous drama supporting actress nominations for \"Grey's Anatomy.\" A study of the 2015-16 season released last year concluded that characters of Asian or Pacific Islander descent remain underrepresented on television, even on shows set in major cities. ___ 9:20 a.m. Music stars in competition for Emmys this year include John Legend, Bruno Mars and Sara Bareilles. Legend and Bareilles each earned acting nods for their roles in NBC's \"Jesus Christ Superstar Live In Concert.\" Mars earned a nomination for outstanding music direction for his first TV special, CBS' \"Bruno Mars: 24K Magic Live at the Apollo.\" Legend, who has won several Grammys as well as an Oscar and a Tony, could become an EGOT if he takes home outstanding lead actor in a limited series or movie. The term EGOT refers to someone who has won one of all the major awards: an Emmy, Grammy, Oscar and Tony. Benj Pasek and Justin Paul are also on their way to EGOT status: The composing duo earned a nomination for outstanding original music and lyrics for \"In the Market for a Miracle\" from Fox's \"A Christmas Story Live!\" ___ 9:10 a.m. The Emmy nominations for outstanding reality competition show have been announced. The nominees are: \"The Amazing Race\"; \"American Ninja Warrior\"; \"Project Runway\"; \"RuPaul's Drag Race\"; \"Top Chef\"; \"The Voice\". The field is identical to last year, when \"The Voice\" took home the Emmy statuette. \"The Voice\" and \"RuPaul's Drag Race\" tied for most nominations for a reality program with 10 apiece. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 9 a.m. HBO's \"Game of Thrones\" has received the most nominations for this year's Emmy Awards, but the haul could not stop Netflix from becoming the most-nominated network atthis year. Netflix is the network received 112 nominations this year, up from 91 last year. Its nominations were spread around numerous shows, including \"Stranger Things,\" ''The Crown,\" ''GLOW\" and \"Godless.\" \"Game of Thrones\" received several supporting acting nominations, including for Lena Headey, Nikolaj Coster-Waldau and Peter Dinklage. ___ 8:45 a.m. \"Game of Thrones\" roared back onto the Emmy battlefield, topping Thursday's nominations with 22 bids. HBO's fantasy saga is a two-time best drama winner that sat out the last year's awards. It's returning to face formidable competition: \"The Handmaid's Tale,\" the dystopian sci-fi series that claimed top drama honors last year, drew 20 bids, with \"Westworld\" close by with 21. Donald Glover's \"Atlanta\" is the top comedy with 16 bids. It will face newcomers including \"The Marvelous Mrs. Maisel\" and \"Barry,\" starring Bill Hader. The revival of \"Roseanne,\" canceled because of star Roseanne Barr's racist tweet, drew only one major nomination, a supporting actress nod for Laurie Metcalf. \"Saturday Night Live,\" riding high with its relentless pillorying of the Trump administration, was rewarded with 21 nods. The previous high for \"Game of Thrones\" was 24 nominations in 2015. It got 23 nods in 2016 but wasn't eligible last year. The Emmys ceremony airs Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 8:40 a.m. The Emmy nominations for the top television drama and comedy series have been announced. The nominees for best drama series include: \"The Americans,\" ''The Crown,\" Game of Thrones,\" ''The Handmaid's Tale,\" ''Stranger Things,\" This Is Us\" and \"Westworld.\" The nominees for best comedy series include: \"Atlanta,\" ''Barry,\" ''black-ish,\" ''Curb Your Enthusiasm,\" ''GLOW,\" ''The Marvelous Mrs. Maisel,\" ''Silicon Valley\" and \"Unbreakable Kimmy Schmidt.\" ___ 8:35 a.m. The 2018 Emmy nominations for lead actors in a drama series have been announced. The nominees for best actor in a drama series include: Jason Bateman, \"Ozark\"; Sterling K. Brown, \"This Is Us\"; Ed Harris, \"Westworld\"; Matthew Rhys, \"The Americans\"; Milo Ventimiglia, \"This Is Us\" and Jeffrey Wright, \"Westworld. The nominees for best actress in a drama series include: Claire Foy, \"The Crown\"; Tatiana Maslany, \"Orphan Black\"; Elisabeth Moss, \"The Handmaid's Tale\"; Sandra Oh, \"Killing Eve\"; Keri Russell, \"The Americans\"; Evan Rachel Wood, \"Westworld.\" ___ 8:30 a.m. The nominees for lead actor in a limited series or movie include: Antonio Banderas, \"Genius: Picasso\"; Darren Criss, \"The Assassination of Gianni Versace: American Crime Story\"; Benedict Cumberbatch, \"Patrick Melrose,\" Jeff Daniels, \"The Looming Tower\"; John Legend, \"Jesus Christ Superstar: Live in Concert\"; Jesse Plemons, \"USS Callister (Black Mirror.)\" ___ This story corrects Plemons' last name. ___ 8 a.m. The final preparations are being made for the 2018 Emmy nominations. Actors Samira Wiley of \"The Handmaid's Tale\" and Ryan Eggold, who starred in \"The Blacklist,\" will read this year's nominees beginning at 8:25 a.m. PDT. About an hour before the nominations, Wiley, wearing a burgundy dress and gold heels, stepped out into the lobby of the television academy and snapped photos in front of a giant screen promoting the 70th annual Emmys. Dozens of journalists have cameras set up to record the announcement, which will be made on a giant stage decked out with four giant Emmy statuettes. Wiley is a possible nominee for \"Handmaid's Tale,\" which won best drama series last year. The Emmy Awards will be presented Sept. 17 on NBC with Colin Jost and Michael Che of \"Saturday Night Live\" as hosts. ___ 3 a.m. Blockbuster movies typically are snubbed by the Oscars, leaving fans grumbling, but TV's top prize takes a different approach. When the 70th Emmy Awards nominees are announced Thursday morning, popular series including HBO's \"Game of Thrones,\" NBC's \"This Is Us\" and CBS' \"Mom\" are likely to be in the running. \"Game of Thrones\" is a two-time best drama series winner. It's back in the running for honors for its next-to-last season after a production delay kept it out of the 2017 competition. Its biggest adversary is \"The Handmaid's Tale,\" the dystopian drama that captured last year's top series prize and acting awards for Elisabeth Moss, Ann Dowd and Alexis Bledel among its eight wins. The Emmy Awards ceremony airs Sept. 17 on NBC.", "brightspot.contentId": "0000018c-1a9d-d2b1-af9d-7adfb4420000", "ga-dataLayer": "{\n  \"dimension15\" : \"\",\n  \"dimension9\" : \"2018-07-12 15:16:39\"\n}", "gtm-dataLayer": "{\n  \"event\" : \"Article Visited\",\n  \"TagArray\" : \"\",\n  \"tag_array\" : \"\",\n  \"headline\" : \"The Latest: No time for Samira Wiley to process Emmys nom\",\n  \"publication_date\" : \"2018-07-12 15:16:39\",\n  \"linked_video\" : \"NO\",\n  \"pr_content\" : \"NO\",\n  \"featured\" : \"NO\"\n}"}, "movies": [], "publish_date": 1531412199.0, "source": "https://www.apnews.com", "summary": ""}