{"url": "www.inquisitr.com/4578952/fergie-reportedly-crushing-hard-on-kendall-jenner-singer-wants-to-explore-fantasies-after-split-rumors/", "text": "Looks like Kendall Jenner has a new admirer. If rumors are to be believed, the Keeping Up With The Kardashians star is allegedly the new girl crush of The Black Eyed Peas vocalist, Fergie.\n\nIn an exclusive report by Radar Online, it has been alleged that the 42-year-old singer has her eyes set on the La Perla model. The webloid claimed that Fergie finds Kendall really attractive and is keen on getting close to her.\n\n“Fergie thinks Kendall’s so hot and she wants to get close.”\n\nApparently, Kendall and Fergie first met behind the scenes of a fashion show. The mother-of-one allegedly thinks that she had an instant connection with the Victoria’s Secret model.\n\nThe gossip site also noted that the “Big Girls Don’t Cry” singer has already worked with the supermodel. Just recently, Kendall appeared in Fergie’s new music video for “Enchanté (Carine).”\n\nAside from that, Fergie is reportedly close to Kendall’s step-sister, Kim Kardashian West, who also starred in her “MILF, Money” music video in 2016.\n\nThe webloid added that the singer is looking forward to work with Kendall again, this time, as a model for her shoe designs.\n\nIt can be recalled that Fergie secretly split with Josh Duhamel after years of being together. And now that the singer is single, the gossip site alleged that she wants to “explore her fantasies.”\n\n“Fergie’s free to explore all of her fantasies and Kendall is at the top of her list.”\n\nDespite reports that Fergie is crushing hard on Kendall Jenner, Gossip Cop claimed that the rumors were not true. According to the debunking site, a source close to the singer confirmed that the rumor about her crushing on the supermodel is “100 percent false.”\n\nThis is not the first time that Fergie’s sexuality has been the subject of controversy. In 2009, the “Fergalicious” singer admitted in an interview that she is a bisexual, adding that she has always been honest about it with her husband.\n\n“I think women are beautiful. I’ve had a lot of fun with women, and I’m not ashamed of it. The problem is that I also love a well-endowed man.”\n\nHowever, she reiterated that she forbid herself to have affairs with women while in a relationship with her husband. Apparently, the singer has set a rule that “it is still cheating even if it’s with girls.”\n\nIn September, Fergie and Josh Duhamel confirmed that they are separating after eight years of marriage. In an interview with The Wendy Willams Show, the singer emotionally admitted that she “wanted to stay married forever.”\n\n“I love Josh. He’s the father of my child. We forever have that project together, and we’re doing the best we can.”\n\n[Featured Images by Frazer Harrison, Frederick M. Brown/Getty Images]", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Van Bermudez"], "canonical_link": "https://www.inquisitr.com/4578952/fergie-reportedly-crushing-hard-on-kendall-jenner-singer-wants-to-explore-fantasies-after-split-rumors", "title": "Fergie Reportedly Crushing Hard On Kendall Jenner, Singer Wants To ‘Explore Fantasies’ After Split [Rumors]", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Looks like Kendall Jenner has a new admirer. If rumors are to be believed, the Keeping Up With The Kardashians star is allegedly the new girl crush of The Black Eyed Peas vocalist, Fergie. In an exclusive report by Radar Online, it has been alleged that the 42-year-old singer has her eyes set on the [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Fergie Reportedly Crushing Hard On Kendall Jenner, Singer Wants To ‘Explore Fantasies’ After Split [Rumors]", "url": "https://www.inquisitr.com/4578952/fergie-reportedly-crushing-hard-on-kendall-jenner-singer-wants-to-explore-fantasies-after-split-rumors", "type": "article", "description": "Looks like Kendall Jenner has a new admirer. If rumors are to be believed, the Keeping Up With The Kardashians star is allegedly the new girl crush of The Black Eyed Peas vocalist, Fergie. In an exclusive report by Radar Online, it has been alleged that the 42-year-old singer has her eyes set on the [&hellip;]"}, "article": {"published_time": "2017-10-26T01:56:23", "modified_time": "2017-10-26T01:56:23", "author": "Van Bermudez"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Fergie Reportedly Crushing Hard On Kendall Jenner, Singer Wants To ‘Explore Fantasies’ After Split [Rumors]", "description": "Looks like Kendall Jenner has a new admirer. If rumors are to be believed, the Keeping Up With The Kardashians star is allegedly the new girl crush of The Black Eyed Peas vocalist, Fergie. In an exclusive report by Radar Online, it has been alleged that the 42-year-old singer has her eyes set on the [&hellip;]"}}, "movies": [], "publish_date": 1508972183.0, "source": "http://www.inquisitr.com", "summary": ""}