{"url": "http://www.nfib-sbet.org/", "text": "SMALL BUSINESS ECONOMIC TRENDS\n\nSmall Business Optimism Index decreased 0.8 points in March to 90.1, marking the 15th consecutive month below the 49-year average of 98. Twenty-four percent of owners reported inflation as their single most important business problem, down four points from last month. Small business owners expecting better business conditions over the next six months remain at a net negative 47%.\n\n“Small business owners are cynical about future economic conditions,” said NFIB Chief Economist Bill Dunkelberg. “Hiring plans fell to their lowest level since May 2020, but strong consumer spending has kept Main Street alive and supported strong labor demand.”\n\nKey findings include:\n\n– Forty-three percent of owners reported job openings that were hard to fill, down four points from February and remaining historically very high.\n\n– The net percent of owners raising average selling prices decreased one point to a net 37% seasonally adjusted.\n\n– The net percent of owners who expect real sales to be higher deteriorated six points from February to a net negative 15%.\n\nAs reported in NFIB’s monthly jobs report, a seasonally adjusted net 15% of owners are planning to create new jobs in the next three months. Twenty-six percent of owners reported few qualified applicants for their open positions and 27% reported none. Eleven percent of owners cited labor costs as their top business problem and 23% said that labor quality was their top business problem. Labor quality remains in second place behind inflation by one point as the top business problem.\n\nFifty-seven percent of owners reported capital outlays in the next six months, down three points from February. Of those making expenditures, 40% reported spending on new equipment, 23% acquired vehicles, and 11% spent money for new fixtures and furniture. Fifteen percent improved or expanded facilities and 6% acquired new buildings or land for expansion. Twenty percent of owners are planning capital outlays in the next few months, down one point from February. Overall, the small business sector shows little strength from capital spending.\n\nA net negative 6% of all owners (seasonally adjusted) reported higher nominal sales in the past three months. Sales are trending down. The net percent of owners expecting higher real sales volumes deteriorated six points to a net negative 15%.\n\nThe net percent of owners reporting inventory increases was unchanged at a net negative 1%. Not seasonally adjusted, thirteen percent reported increases in stocks and 17% reported reductions. Nineteen percent of owners reported that supply chain disruptions still have a significant impact on their business. Another 31% reported a moderate impact and 35% reported a mild impact.\n\nA net 1% of owners viewed current inventory stocks as “too low” in March, up five points from February. By industry, shortages are reported most frequently in transportation (18%), retail (17%), manufacturing (16%), and wholesale (16%). Complaints of shortages in construction (3%) have been reduced because home sales have slowed due to higher interest rates. A net negative 4% of owners plan inventory investment in the coming months, up three points from February.\n\nThe net percent of owners raising average selling prices decreased one point from February to a net 37% seasonally adjusted, the lowest since April 2021. Unadjusted, 11% reported lower average selling prices and 50% reported higher average prices. Price hikes were the most frequent in wholesale (71% higher, 16% lower), retail (61% higher, 8% lower), construction (57% higher, 8% lower), and finance (56% higher, 8% lower). Seasonally adjusted, a net 26% plan price hikes, up one point.\n\nSeasonally adjusted, a net 42% reported raising compensation, down six points from February. A net 22% plan to raise compensation in the next three months.\n\nThe frequency of positive profit trends was a net negative 18%, five points better than in February. Among owners reporting lower profits, 31% blamed weaker sales, 23% blamed the rise in the cost of materials, 13% cited the usual seasonal change, 9% cited lower prices, 8% cited labor costs, and 3% cited higher taxes or regulatory costs. For owners reporting higher profits, 48% credited sales volumes, 21% cited higher prices, 18% cited usual seasonal change, and 5% cited lower labor costs.\n\nTwo percent of owners reported that all their borrowing needs were not satisfied. Twenty-nine percent reported all credit needs were met and 59% said they were not interested in a loan. A net 9% reported their last loan was harder to get than in previous attempts, up four points.\n\nThree percent reported that financing was their top business problem. A net 26% of owners reported paying a higher rate on their most recent loan, up two points. Rates are rising, but credit is still available.", "images": ["http://www.nfib-sbet.org/wp-content/themes/nfib/img/homespinner.gif", "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif"], "top_img": "http://www.nfib-sbet.org/wp-content/themes/nfib/img/spinner-page.gif", "keywords": [], "authors": [], "canonical_link": "", "title": "NFIB", "meta_data": {"viewport": "width=1024"}, "movies": [], "publish_date": null, "source": "http://www.nfib-sbet.org", "summary": ""}