{"url": "https://web.archive.org/web/20181221024815/https://www.japantimes.co.jp/culture/2018/12/21/entertainment-news/no-moral-stephen-colbert-says-trump-spoof-book-whose-boat-boat-wrote/", "text": "For Stephen Colbert and his “Late Night” staff, the best-selling spoof “Whose Boat Is This Boat?” essentially wrote itself.\n\nBecause all of the words are by President Donald Trump, who is billed as the author “by accident.” The picture book’s title and contents were inspired by Trump’s disjointed response last September to Hurricane Florence, which struck North Carolina and South Carolina, where Colbert grew up.\n\n“If you love Trump, you’ll love this book because every word in it is exactly what he said,” Colbert, for whom the president has been prime comic material, said during a recent interview with The Associated Press. “And if you’re anti-Trump you’ll love this book because every word in it is exactly what he said.”\n\n“Whose Boat Is This Boat? Comments That Don’t Help in the Aftermath of a Hurricane” has sold hundreds of thousands of copies and raised more than $1.25 million for such charities as Foundation for the Carolinas and World Central Kitchen. The contributions come from author proceeds and from the publisher, Simon & Schuster.\n\nBooks can take years from conception to publication, but “Whose Boat Is This Boat?” was essentially written in 24 hours and within six weeks was already on shelves, physical and virtual. It began after Trump visited New Bern, North Carolina, and was preoccupied with a yacht that had landed in a resident’s backyard.\n\n“To see what we’re seeing — this boat. I don’t know what happened, but this boat just came here,” he said. Other comments included “At least you got a nice boat out of the deal” and “Have a good time!”\n\n“Late Show” staff writer Emmy Blotnick heard Trump’s remarks and said, “That sounds like a children’s book.”\n\nWith illustrations by Audro Buneta and John Henry, “Whose Boat Is This Boat?” looks like a bedtime story, albeit one that ends with the message “There is no moral.” Defining it has proved challenging: On The New York Times best-seller charts, it appears under “Advice, How-to & Miscellaneous.”\n\n“We should be on the nonfiction list,” Colbert said. “I smell a rat.”\n\nAccording to a Times spokesperson, “The book was placed on the advice, how-to and miscellaneous list where many books that defy easy categorization have ranked. It’s a great achievement being on this highly competitive list for six weeks, including a week at No. 1, and we wish Stephen were happier about it.”\n\nColbert said the book is for “children of all ages,” one that appeals to kids because it’s “pretty to look at, no nudity, no violence” and one that shows adults how “our president responds” to natural disasters. The book is billed as “an excellent teaching tool” that lets readers learn “about empathy by process of elimination.”\n\n“Whose Boat Is This Boat?” isn’t the first picture story to mock the Trump administration. “Last Week Tonight with John Oliver Presents a Day in the Life of Marlon Bundo” is a best-selling parody of “Marlon Bundo’s Day in the Life of a Vice President,” a tribute to the family’s pet bunny written by Mike Pence’s daughter, Charlotte Pence, and illustrated by his wife, Karen Pence. The vice president is known for his conservative social views; in Oliver’s book, Marlon Bundo has fallen for a fellow male bunny.\n\nCharlotte Pence herself bought a copy of the Oliver edition, noting that proceeds went to charity. Colbert senses he may have similar luck with Trump and his family.\n\n“What I’m hearing, from the voices inside my head, is that he enjoys it,” Colbert said, mimicking the president’s own fact-checking style. “Everybody is saying he likes it.”", "images": ["https://web.archive.org/web/20181221024815im_/https://www.japantimes.co.jp/wp-content/themes/jt_theme/library/img/japantimes-logo2.png", "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-870x700.jpg", "https://web.archive.org/web/20181221024815im_/https://www.japantimes.co.jp/wp-content/themes/jt_theme/library/img/search.png", "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-marshall-a-20181220-128x128.jpg", "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-weinstein-a-20181222-128x128.jpg", "https://web.archive.org/web/20181221024815im_/https://www.japantimes.co.jp/wp-content/themes/jt_theme/library/img/japantimes-logo.png", "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-200x200.jpg", "https://web.archive.org/web/20181221024815im_/https://www.japantimes.co.jp/wp-content/themes/jt_theme/library/img/weather_icons/all-icons_33.png", "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-cyntoia-a-20181219-128x128.jpg"], "top_img": "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-870x700.jpg", "keywords": [], "authors": [], "canonical_link": "https://web.archive.org/web/20181221024815/https://www.japantimes.co.jp/culture/2018/12/21/entertainment-news/no-moral-stephen-colbert-says-trump-spoof-book-whose-boat-boat-wrote/", "title": "‘There is no moral’: Stephen Colbert says Trump spoof book ‘Whose Boat is This Boat?’ wrote itself", "meta_data": {"verify-v1": "+h35BdFddo/f1upXot92yGKSB4d5EuWWGbARz9SJE6A=", "twitter": {"account_id": 7424642, "card": "summary_large_image", "image": "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-870x489.jpg", "site": "@japantimes", "creator": "@japantimes"}, "viewport": "width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1", "HandheldFriendly": "true", "apple-mobile-web-app-title": "Japan Times", "robots": "noodp", "thumbnail": "https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-200x200.jpg", "description": "For Stephen Colbert and his \"Late Night\" staff, the best-selling spoof \"Whose Boat Is This Boat?\" essentially wrote itself. Because all of the words are by", "keywords": "Donald Trump, stephen colbert, hurricane florence, whose boat is this boat?", "og": {"locale": "en_US", "type": "article", "title": "'There is no moral': Stephen Colbert says Trump spoof book 'Whose Boat is This Boat?' wrote itself | The Japan Times", "description": "For Stephen Colbert and his \"Late Night\" staff, the best-selling spoof \"Whose Boat Is This Boat?\" essentially wrote itself. Because all of the words are by", "url": "https://web.archive.org/web/20181221024815/https://www.japantimes.co.jp/culture/2018/12/21/entertainment-news/no-moral-stephen-colbert-says-trump-spoof-book-whose-boat-boat-wrote/", "site_name": "The Japan Times", "image": {"identifier": "https://web.archive.org/web/20181221024815im_/https://cdn.japantimes.2xx.jp/wp-content/uploads/2018/12/f-colbert-a-20181222-870x700.jpg", "width": 870, "height": 700}}, "article": {"publisher": "https://www.facebook.com/thejapantimes", "tag": "whose boat is this boat?"}, "fb": {"app_id": 119406745111}, "DC.date.issued": "2018-12-21T04:25:29+09:00"}, "movies": [], "publish_date": 1545343200.0, "source": "https://web.archive.org", "summary": ""}