{"url": "www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "text": "Info Category: Richest Celebrities › Actors Net Worth: $60 Million Date of Birth: Nov 22, 1958 (65 years old) Place of Birth: Santa Monica Gender: Female Height: 5 ft 6 in (1.7 m) Profession: Actor, Writer, Author, Voice Actor Nationality: United States of America 💰 Compare Jamie Lee Curtis' Net Worth\n\nWhat is Jamie Lee Curtis' Net Worth?\n\nJamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Guest. Jamie gained prominence during the late 70s with a performance in the horror movie \"Halloween.\" She then became famous for appearing in a wide range of horror films over the next few years. In March 2023, Jamie won an Academy Award for Best Supporting Actress for her work in the film \"Everything Everywhere All at Once.\"\n\nOutside of her roles within the horror genre, she is known for her performances in a range of comedic films. In addition to her film work, Jamie has appeared in many notable television series. She is also an accomplished author and a blogger for the Huffington Post. In 1998, Jamie Lee Curtis was given a star on the Hollywood Walk of Fame.\n\nIn 2021, Curtis received the Lifetime Achievement Award at the 78th Venice International Film Festival.\n\nEarly Life\n\nJamie Lee Curtis was born on November 22nd of 1958 in Santa Monica, California. Her father was the late actor Tony Curtis, and her mother was the late actress Janet Leigh. Raised alongside an older sister, Jamie's parents divorced when she was four. After graduating from high school, Jamie Lee Curtis studied at the University of the Pacific. Although she studied law initially, she later dropped out to pursue a career as an actress.\n\nCareer\n\nCurtis' first film role was in the 1978 horror film \"Halloween.\" This role became quite iconic, and \"Halloween\" became the highest-grossing independent film when it was released. This was the beginning of her career as a so-called \"scream queen,\" which is a name for actresses who are famous for roles in horror films. She followed up with leading roles in horrors such as \"The Fog,\" \"Prom Night,\" \"Terror Train,\" and many sequels and spin-offs to \"Halloween.\" Many of these films performed well at the box office.\n\nIn 1983, Curtis successfully escaped the scream queen typecast with a performance in the comedy \"Trading Places.\" She earned a BAFTA Awards for Best Actress in a Supporting Role for her performance. After proving her comedic talents, she followed up with a role in another 80s comedy called \"A Fish Called Wanda,\" which later became a cult classic. Curtis continued to branch out into different genres during the 90s, taking a role in the action-thriller \"Blue Steel.\"\n\nIn 1994, Curtis received a Golden Globe award as a result of her role in the film \"True Lies.\" During the 90s, she also appeared in a number of other notable films, such as \"My Girl,\" \"My Girl 2,\" and \"Freaky Friday,\" the latter of which co-starred Lindsay Lohan. In 2004, Curtis appeared in the film \"Christmas with the Kranks,\" which also became a cult classic. This proved to be a turning point for Jamie Lee, as she announced in 2006 that she was taking an indefinite break from acting in order to focus on her family.\n\nHowever, this break only lasted for one year. In 2007, Curtis appeared in the live-action-animated film \"Beverly Hills Chihuahua\" alongside Piper Perabo. Three years later, she followed up with a role in the comedy \"You Again\" alongside Kristen Bell and Sigourney Weaver. Further voice acting roles followed with films like \"The Little Engine That Could\" and \"From Up on Poppy Hill\" before Curtis joined the cast of films like \"Veronica Mars\" and \"Spare Parts.\"\n\nA notable moment in Curtis' career came in 2018 when she reprised her role as Laurie Strode in the reboot of \"Halloween.\" The film proved to be a massive box office success, raking in over $76 million on its debut, becoming the second-best opening weekend in October. When all was said and done, the film earned over $255 million at the box office. The film's debut at the box office was also the highest-earning for any film with a lead actress over 55 years of age. In addition, 2018's \"Halloween\" proved to be the most commercially successful film of the entire franchise.\n\n2018 was a busy year for Jamie Lee, as she also starred in films such as \"An Acceptable Loss\" and \"Knives Out,\" the latter of which received widespread critical acclaim and raked in over $300 million at the box office.\n\nOutside of her film roles, Curtis has appeared in series such as \"Quincy, M.E.,\" \"Columbo,\" \"Charlie's Angels,\" \"Anything But Love,\" \"The Drew Carey Show,\" \"NCIS,\" \"New Girl,\" and the Fox comedy horror series \"Scream Queens.\" The latter performance earned Curtis a nomination for a Golden Globe.\n\nIn 2020, it was announced that Curtis will reprise her iconic role once again in two more Halloween sequels: \"Halloween Kills\" and \"Halloween Ends.\" During this period, Curtis also joined the cast of the sci-fi film \"Everything Everywhere At Once.\" She received widespread acclaim for her role in this movie in which she received numerous nominations, including her very first Oscar nomination. Jamie Lee Curtis is set to portray Dr. Patricia Tannis in the video game adaptation \"Borderlands\" and Madame Leota in Disney's \"Haunted Mansion.\"\n\nRelationships\n\nIn 1984, Jamie Lee Curtis married Christopher Guest, a well-known screenwriter, composer, musician, actor, director, and comedian. Curtis connected with Guest after watching \"This Is Spinal Tap,\" in which he starred. Over the next few years, Curtis and Guest adopted two children.\n\nSubstance Abuse\n\nJame Lee Curtis has struggled with alcoholism over her life, and was addicted to painkillers at one point. In 1999, she became inspired to pursue a sober lifestyle and successfully recovered from her substance abuse issues.\n\nReal Estate\n\nIn 2016, it was reported that Jamie Lee Curtis and Christopher Guest purchased a home in Santa Monica for $2.2 million. The property is adjacent to their current home, and the assumption is that they will expand into this new lot to create a bigger home. The land itself already features a home with 1,900 square feet of living space and a swimming pool. The Santa Monica property that they already own has been in their possession for more than two decades.", "images": ["data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/09/Christopher-Guest.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2009/11/Sigourney-Weaver.jpg", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2011/11/John-Carpenter.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg?x81397", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2017/09/Janet-Leigh.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "https://vz.cnwimg.com/thumb-400x400/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "title": "Jamie Lee Curtis Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Jamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Guest.", "slick": {"wpversion": "1.4.0", "wppostid": 2764, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg?x81397", "group": "post", "category": "actors:Actors;richest-celebrities:Richest Celebrities"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Jamie Lee Curtis Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/jamie-lee-curtis-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Jamie Lee Curtis's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-07-14T15:20:47+00:00", "published_time": "2020-09-16T23:21:33+00:00", "section": "Actors", "tag": "richest actresses"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2010/01/Jamie-Lee-Curtis.jpg?x81397", "title": "Jamie Lee Curtis Net Worth", "description": "Jamie Lee Curtis is an American actress, producer, and author who has a net worth of $60 million. That is a combined net worth with her husband of several decades, actor/writer/producer Christopher Gu"}}, "movies": [], "publish_date": 1600298493.0, "source": "http://www.celebritynetworth.com", "summary": ""}