{"url": "www.celebritynetworth.com/richest-celebrities/actors/margot-robbie-net-worth/", "text": "Info Category: Richest Celebrities › Actors Net Worth: $60 Million Date of Birth: Jul 2, 1990 (33 years old) Place of Birth: Dalby Gender: Female Height: 5 ft 6 in (1.68 m) Profession: Actor Nationality: Australia 💰 Compare Margot Robbie's Net Worth\n\nWhat is Margot Robbie's Net Worth and Salary?\n\nMargot Robbie is an Australian actress who has a net worth of $60 million. Margot Robbie began her career in Australia but she gained widespread recognition after moving to the United States. Over the years, she has exhibited incredible range, playing drastically different characters – many of which have been historical figures in biopics.\n\nSome of her notable film roles include, \"The Wolf of Wall Street,\" \"Suicide Squad,\" \"Once Upon a Time… in Hollywood,\" \"Barbie,\" and \"I, Tonya.\" For \"I, Tonya,\" Margot earned an Academy Award nomination for Best Actress. In the film she portrayed Olympic figure skater Tonya Harding. Outside of acting, Robbie is a successful producer who has collaborated with her husband, Tom Ackerly, to create the production company LuckyChap Entertainment. LuckyChap produced \"I, Tonya,\" \"Promising Young Woman,\" among other projects.\n\nHighest Paid Actresses\n\nBetween September 2018 and September 2019, Margot earned $24 million from her various endeavors. This was enough to make her one of the highest-paid actresses in the world during that period.\n\n$50 Million Barbie Payday\n\nMargo both starred in and produced the 2023 film \"Barbie.\" Barbie was an enormous success, earning well over $1 billion at the global box office. As a result, Margot Robbie's total payday is expected to top $50 million.\n\nEndorsements\n\nMargot Robbie has supplemented her acting income with a range of brand endorsements and deals. In 2016, she became the face of Calvin Klein's Deep Euphoria fragrance. One year later, she began to appear in Nissan commercials for its line of electric vehicles (EVs). Robbie followed up in 2018 by becoming the brand ambassador for Chanel, a well-known luxury fashion brand. Robbie has worked with Chanel extensively, and she eventually became the face of their fragrance \"Chanel Gabrielle Essence.\" Many publications have complimented Robbie's sense of fashion, and she is considered one of the best-dressed celebrities of the modern era.\n\nEarly Life\n\nMargot Elise Robbie was born on July 2nd of 1990 in Dalby, Queensland. Raised by a single mother on the Gold Coast alongside three siblings, Margot spent much of her childhood living on the family farm. By the age of 16, Robbie was working three jobs at the same time in order to provide for her family. This included working at Subway. She also managed to juggle her growing passion for acting and studied drama at Somerset College. At the age of 17, Margot moved to Melbourne in order to pursue a career as an actress.\n\nCareer\n\nRobbie began her career with roles in Australian films such as \"ICU\" and \"Vigilante.\" She later started appearing in Australian commercials and landed guest roles in shows like \"The Elephant Princess\" and \"City Homicide.\" A major step forward came in 2008 when she booked a recurring role on the well-known Australian soap opera \"Neighbours.\"\n\nAfter appearing in a number of other Australian projects, Robbie flew to Los Angeles for pilot season. She auditioned for a number of roles but initially failed to make an impact. Switching gears, Robbie booked a role in a British romantic comedy called \"About Time,\" which released in 2013 and helped put Margot on the map. However, her real breakthrough came later that year when she appeared in Martin Scorsese's \"The Wolf of Wall Street\" alongside Leonardo DiCaprio. The film was a commercial and critical success, earning over $392 million at the box office. Robbie was also singled out for praise, impressing many critics with her accurate Brooklyn accent.\n\nAfter founding her own production company, she appeared in \"Focus\" alongside Will Smith. The film received mixed reviews, although Robbie's performance received praise. She also earned critical acclaim for her role in the New Zealand film \"Z for Zachariah.\" Throughout the next few years, Robbie appeared in films like \"Suite Francaise,\" \"The Big Short,\" \"Whiskey Tango Foxtrot,\" and \"The Legend of Tarzan.\"\n\nAnother important role came in 2016 when Margot appeared as Harley Quinn in \"Suicide Squad.\" Negative reviews followed, but Robbie's performance was a silver lining in the eyes of most critics. She followed up with a role in \"Goodbye Christopher Robin\" before portraying Tonya Harding in \"I, Tonya.\" This became one of her most celebrated roles thus far. In 2018, she established herself as a voice actor after booking the role of Flopsy Rabbit in the animated/live-action film \"Peter Rabbit.\"\n\nHer next film projects included \"Terminal\" and \"Slaughterhouse Rulez\" before she appeared as Queen Elizabeth I in \"Mary Queen of Scots.\" In 2019, she appeared in \"Dreamland\" and \"Once Upon a Time in Hollywood,\" following through with her goal of working with director Quentin Tarantino. She wrapped up 2019 with a role in \"Bombshell\" before starting 2020 with the film \"Promising Young Woman.\" In 2020, she reprised her role as Harley Quinn in \"Birds of Prey.\"\n\nRelationships\n\nIn 2014, Margot Robbie started dating Tom Ackerly, an assistant director she had met on the set of a film called \"Suite Francaise.\" In 2016, they were married. After living together in London with a number of other housemates, they relocated to Los Angeles.\n\nReal Estate\n\nMargot has been quite active in the real estate market since becoming a prominent Hollywood figure. In 2017, she quietly purchased a property in the Hancock Park neighborhood of Los Angeles. The low-key purchase was only discovered months after Robbie had moved in, and she reportedly paid $2.73 million for the impressive property. The 3,300-square-foot residence features a wine cellar, a pool, a private balcony, and a room dedicated to Margot's newly-adopted puppy.\n\nIn 2018 Margot paid $950,000 for a modest LA home. She listed this property for sale in December 2020 for $1.2 million.\n\nRobbie followed up with a string of purchases in 2019. During this year, she purchased not one but two houses for her family members. The first home went to her sister, while the second was given to Margot's mother. Both homes are part of the same building, and Robbie paid about $1.8 million for the gated duplex which sits along Australia's beautiful Gold Coast. In 2014, she paid off her mother's mortgage as a 60th birthday present.\n\nAlso during 2019, Robbie splurged on a second home for herself. This time the successful actress shopped in the Venice neighborhood of Los Angeles, paying $5 million for a compound in another quiet deal. The compound actually contains three separate structures, and has been described as \"fortress-like.\" There's also a grassy lawn and a pool with plenty of privacy. In addition, Robbie owns a 1,000-square-foot investment home in Hollywood Hills that she leases out for considerable passive income.", "images": ["https://vz.cnwimg.com/thumb-600x300/wp-content/uploads/2013/12/Margot-Robbie-1.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2010/12/Simon-Baker1.jpg", "http://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2010/08/Chris-ODonnell-1.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/09/Toni-Collette-e1603652814674.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/02/viola.jpg", "https://vz.cnwimg.com/wp-content/uploads/2013/12/Margot-Robbie-1.jpg?x81397"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Margot-Robbie-1.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/margot-robbie-net-worth/", "title": "Margot Robbie Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Margot Robbie net worth and salary: Margot Robbie is an Australian actress who has a net worth of $40 million. Margot Robbie began her career in Australia but she gained widespread recognition after moving to the United States.", "slick": {"wpversion": "1.4.0", "wppostid": 59639, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Margot-Robbie-1.jpg?x81397", "group": "post", "category": "actors:Actors;richest-celebrities:Richest Celebrities"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Margot Robbie Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/margot-robbie-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Margot-Robbie-1.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Margot Robbie's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-08-16T15:56:07+00:00", "published_time": "2020-08-29T01:26:05+00:00", "section": "Actors", "tag": "will smith net worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2013/12/Margot-Robbie-1.jpg?x81397", "title": "Margot Robbie Net Worth", "description": "Margot Robbie net worth and salary: Margot Robbie is an Australian actress who has a net worth of $60 million. Margot Robbie began her career in Australia but she gained widespread recognition after m"}}, "movies": [], "publish_date": 1598664365.0, "source": "http://www.celebritynetworth.com", "summary": ""}