{"url": "https://en.wikipedia.org/wiki/Keri_Russell", "text": "American actress (born 1976)\n\nKeri Lynn Russell (born March 23, 1976)[1] is an American actress. She has played the title role in the drama series Felicity (1998–2002), which won her a Golden Globe Award, and later portrayed Elizabeth Jennings in the spy thriller series The Americans (2013–2018), which earned her nominations for several Primetime Emmy and Golden Globe Awards.\n\nRussell has appeared in the films Honey, I Blew Up the Kid (1992), We Were Soldiers (2002), Mission: Impossible III (2006), Waitress (2007), August Rush (2007), Dawn of the Planet of the Apes (2014), Star Wars: The Rise of Skywalker (2019), Antlers (2021), and Cocaine Bear (2023). In 2023, she began starring in the political drama series The Diplomat.\n\nEarly life [ edit ]\n\nRussell was born on March 23, 1976, in Fountain Valley, California, to Stephanie Stephens, a housewife, and David Russell, a Nissan Motors executive.[2] She has an older brother, Todd, and a younger sister, Julie. The family lived in Coppell, Texas, Mesa, Arizona, and Highlands Ranch, Colorado, moving frequently due to her father's work. Russell's dancing earned her a spot on The Mickey Mouse Club.[3]\n\nCareer [ edit ]\n\n1990s [ edit ]\n\nRussell first appeared on television at age 15 as a cast member of the All-New Mickey Mouse Club variety show on the Disney Channel.[4] She was on the show from 1991 to 1994, encompassing seasons four to six.\n\nIn 1992, she appeared in Honey, I Blew Up the Kid and in 1993, had a role on the sitcom Boy Meets World as Mr. Feeny's niece. She appeared on Married... with Children in a 1995 episode (\"Radio Free Trumaine\", production 9.24). She subsequently starred in several film and television roles, including the 1996 made-for-television film The Babysitter's Seduction.[3] That year she also had a role on the short-lived soap opera series Malibu Shores.[3]\n\nIn 1994, Russell appeared as the \"other woman\" in Bon Jovi's music video \"Always\".[5] In 1997, she appeared in two episodes of Roar.[3]\n\nFrom 1998 to 2002, Russell starred as the title character on the successful WB Network series Felicity, and in 1999 won a Golden Globe for the role.\n\nDuring the show's run, Russell appeared in the films Eight Days a Week, The Curve and Mad About Mambo, all of which received only limited releases in North America. Her next role was in the film We Were Soldiers (2002),[3] playing the wife of a United States serviceman during the Vietnam War. The film was released two months before the end of Felicity's run.\n\n2000s [ edit ]\n\nRussell at the British premiere of Mission: Impossible III, 2006\n\nWhen Felicity ended, Russell moved to New York City and made her off-Broadway stage debut in 2004 in Neil LaBute's Fat Pig.[6] In 2005, she returned to television and film, beginning with an appearance in the Hallmark Hall of Fame television movie The Magic of Ordinary Days, the theatrical film The Upside of Anger, and the television miniseries Into the West. In 2005, director J. J. Abrams asked Russell to join the cast of Mission: Impossible III, and she accepted. She was screen tested for the role of Lois Lane in Superman Returns but lost the part to Kate Bosworth.[7]\n\nIn mid-2006, Russell was chosen to be a celebrity spokeswoman for CoverGirl cosmetics.[8] In the summer of 2007, Russell appeared in The Keri Kronicles, a reality show sitcom sponsored by CoverGirl and airing on MySpace; the show was filmed at Russell's home in Manhattan and spotlighted her life.[9] Also in 2007, she played Melody on the NBC show Scrubs.\n\nRussell next starred in the film Waitress, which marked the fourth time she played a pregnant woman.[10] Her performance was positively received by critics,[9] with Michael Sragow of The Baltimore Sun writing that Russell's performance had \"aesthetic character\" and \"wields tenderness and fierceness with quiet heat\".[11] In 2007, Russell also completed roles in Grimm Love (titled Rohtenburg for its German release), in which she played Katie Armstrong, a graduate student who writes her thesis on an infamous cannibal murder case and the thriller The Girl in the Park.\n\nRussell next appeared in August Rush, released in November 2007. She also appeared on the cover of the New York Post's Page Six magazine on November 11, 2007.[12] Russell later appeared in Bedtime Stories.[13] In an appearance on The View on December 15, 2008, Russell said she got the part because Adam Sandler's wife Jackie had seen her in Waitress and suggested her for the movie. Russell voiced Wonder Woman in a direct-to-video animated feature released on March 3, 2009.[14]\n\n2010s [ edit ]\n\nRussell starred in the Tom Vaughan-helmed Extraordinary Measures[15][16] for CBS Films. The drama, which started filming on April 6, 2009, and was released on January 22, 2010, was the first film to go into production for the new company.[3][17] Russell played Aileen Crowley, a mother who tries to build a normal home life for her sick children while her husband and an unconventional scientist race against time to find a cure.[18]\n\nRussell starred in the Fox series Running Wilde from 2010 to 2011.[19]\n\nFrom 2013 to 2018, she starred in the FX drama series The Americans, playing Elizabeth Jennings, a deep-undercover Russian KGB spy living as an American in the 1980s Cold War era. She appeared opposite Matthew Rhys, who portrays her character's husband and spy partner. Russell and Rhys became partners in real life during this time. The series ended after six seasons.[20]\n\nIn 2013, Russell starred in the science-fiction horror film Dark Skies and the romantic comedy film Austenland. In 2014, she starred in the science fiction action film Dawn of the Planet of the Apes, a sequel to 2011's Rise of the Planet of the Apes.[21] She starred as Serena Knight in the 2016 historical war film Free State of Jones.\n\nIn 2017, she received a star on the Hollywood Walk of Fame.[22] In July 2018, Russell was announced to have joined the cast of the film Star Wars: The Rise of Skywalker, which was released on December 20, 2019. The film reunited her with J.J. Abrams, with whom she had worked on Felicity and Mission: Impossible III.[23] In August 2018, she was announced to star as Anna in the first Broadway revival of Lanford Wilson's play Burn This, which opened in March 2019 at the Hudson Theatre.[24]\n\n2020s [ edit ]\n\nOn March 16, 2023, Netflix announced that Russell will star in The Diplomat, a political series from The West Wing writer and producer Debora Cahn. The series premiered on April 20, 2023.[25]\n\nPersonal life [ edit ]\n\nIn 2006, Russell became engaged to Shane Deary, a Brooklyn-based contractor she met through mutual friends.[10] They married in New York on February 14, 2007.[26] They have two children: a son born in 2007 and a daughter born in 2011.[27][28] Russell and Deary separated in early 2013 and divorced in mid-2014.[29][30] Since 2014, she has been in a relationship with Welsh actor Matthew Rhys, her co-star in The Americans.[31] They have a son, born in 2016.[32][33] In interviews conducted in 2021, Russell and Rhys referred to each other as husband and wife.[34][35]\n\nFilmography [ edit ]\n\nFilm [ edit ]\n\nTelevision [ edit ]\n\nMusic videos [ edit ]\n\nYear Song Artist 1994 \"Always\" Bon Jovi\n\nVideo games [ edit ]\n\nYear Title Role Notes TBA Open Roads Opal Devine (voice)\n\nTheatre [ edit ]\n\nAwards and nominations [ edit ]\n\nNotes [ edit ]\n\n^ Where available, the \"Year\" value is linked to the specific ceremony.", "images": ["https://en.wikipedia.org/static/images/icons/wikipedia.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/KeriRussellApr06.jpg/130px-KeriRussellApr06.jpg", "https://upload.wikimedia.org/wikipedia/commons/c/c6/Keri_Russell_%2831481731266%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "https://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "https://en.wikipedia.org/static/images/footer/wikimedia-button.png", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Keri_Russell_%2831481731266%29_%28cropped%29.jpg/220px-Keri_Russell_%2831481731266%29_%28cropped%29.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c1/Keri_Russell_by_Gage_Skidmore.jpg/180px-Keri_Russell_by_Gage_Skidmore.jpg", "https://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/c/c6/Keri_Russell_%2831481731266%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Keri_Russell", "title": "Keri Russell", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c6/Keri_Russell_%2831481731266%29_%28cropped%29.jpg/640px-Keri_Russell_%2831481731266%29_%28cropped%29.jpg", "width": 640, "height": 969}, "title": "Keri Russell - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "https://en.wikipedia.org", "summary": ""}