{"url": "https://ew.com/recap/the-royals-season-3-premiere/", "text": "Because of the whole \"anarchy in the monarchy\" tagline for The Royals, I'm going to be recapping season 3 in my own special way: naming superlatives and, in the process, using a whole bunch of sometimes repetitive, seriously bad puns. But, like the show itself, it'll be fun — that much I can promise.\n\nBut first, what actually went down in this premiere: We picked up just two weeks from the season 2 finale, which concluded with Liam revealing Royal Head of Security Ted Pryce as King Simon's killer, which subsequently led an angry mob of Brits to kill Pryce. Days later, Liam is still feeling the weight of that decision, and the blood of Pryce on his hands, so he's coping by keeping extremely busy with charity events, frequenting some sort of fight club, chats with Wilhelmina over sugary cereal, and plenty of booze. Eleanor, meanwhile, is pretty much the same, seemingly spending most of her time trying to make Jasper squirm as he tries to win her back.\n\nQueen Helena attempts to get her hands on King Simon's bones, only to find that his body isn't in his tomb — current King Cyrus has them — so now she'll have to pluck a hair from Cyrus' head to get a DNA test done to prove Liam's paternity… and his right to the throne. Meanwhile, cancer-stricken Cyrus has all but quarantined himself to his quarters, while Helena is simultaneously interviewing for a new Lord Chamberlain and setting up an appointment with a paid gent of another sort. That doesn't really work out so well when Rachel isn't clear and Helena winds up sleeping with the new Lord Chamberlain, Spencer Hoenigsberg, before meeting… (wait for it)… Huge Grant. Oops.\n\nMost Royally Badass Moment of the Week\n\nWhen you're a queen, you can clear an Underground station at the blink of an eye. Which is exactly what Helena did when she wanted to to meet in private with the woman at the heart of the #KingLiam movement: Wilhelmina. Expect much more for this unusual pairing — the actress who plays Wilhelmina, Genevieve Gaunt, is a series regular this season.\n\nMost Surprising Twist\n\nWe spent most of the episode getting short flashes of Robert surviving on a beach — quite well, it seems — living in a lean-to and catching fish to fulfill his royal sushi needs (although, poor guy, it doesn't appear he has a Wilson to keep him company). Of course, we just assumed he was hoping for a rescue at any moment. Only, when he heard a plane in the distance, he didn't fire his one flare. Instead, he put out his fire and flattened himself to the ground, hoping not to be seen. And then, he scratched out his own name on his helmet. Oh Robert, you can't stay on this beach forever…\n\nCyrus' Most Conniving Moment\n\nNope, it wasn't when he poisoned Jeffrey Stewart after telling him he wasn't going to poison him in order to put a stop to the release of an incriminating video. It was that he'd taken King Simon's dead body from his tomb and dropped him into the Thames, leaving a note that just said, \"Gone Fishin'\" in the tomb for Helena to find.\n\nRunner Up: In an effort to keep Helena from his own DNA (which she wants to use for a paternity test to prove her children's rights to the throne), Cyrus goes full bubble boy when he's forced to meet with her.\n\nBest Performance By an Electric Razor\n\nYou talkin' to Cyrus? Because his new 'do looks oddly familiar.\n\nE!; Everett Collection\n\nMr. Hill's Winningest Move\n\nEver since his season 2 introduction, Eleanor's bodyguard, Mr. Hill, has become one of my favorite characters. He brings out the sweet, smart side of Eleanor without an ounce of stuffiness. So he's going to get a special category here. This week, every move he made in bringing Eleanor and Jasper back together was a delight, but his best move was, of course, showing Eleanor the security footage of Jasper's happy dance after she finally agreed to forgive him and go on a date with him.\n\nRunner Up: Mr. Hill going to Eleanor for her thoughts on his being offered the job of Head of Security was pretty effing great. Eleanor saying, \"The way I see it, you wouldn't be leaving me — you'd simply be looking after all of us, and I can't think of anyone more qualified,\" may have even put a little tear in my eye.\n\nWorst Paint Job\n\nLet's be honest, those green doors look TERRIBLE.\n\nNEXT: The outfit, quotes, and songs of the week\n\nShirtless Moment of the Week\n\nMeet HRH Tyler Durden. To blow off steam — and to punish himself for the death of Ted Pryce at the King's Cup at the conclusion of season 2 — Liam has been using the tunnels to visit some sort of underground fight club.\n\nJim Marks/E!\n\nBiggest HUH?!\n\nEvery once in a while, my memory is going to fail me, and I'm hoping you fair readers, will help me out in the comments. This week, I was left scratching my head over Liam's blond bartender pal. At first, I assumed she just happened to be there and didn't mind patching up the super-hot royal after his whole fight club knockout (I sure wouldn't). But then, at the end, he says, \"I thought about you a lot. I should have done more for you.\" HUH?! Are we supposed to know who this woman is?\n\nEleanor's Outfit of the Week\n\nApparently, this is what a princess wears to paint her room. And it's amazing.\n\nE!\n\nCrown Jewel Quips of the Episode\n\n\"I thought I smelled you: the queen's personal bouquet of spite and vagina.\" —Cyrus\n\n\"The people decided, and justice was served.\" —Eleanor jumping in during a talk show appearance to help Liam answer a question about Pryce's death\n\n\"You'll be fine — just try not to sleep with my mom.\" —Liam, advising Jasper on getting Eleanor back\n\n\"Princess Eleanor umbrellas, or, as we like to call them, Umbreleanors!\" —a total idiot trying to get Eleanor's endorsement for an umbrella with a tacky crown on top\n\n\"That smells like a whorehouse the next morning, and one of the whores has a yeast infection.\" —Eleanor's reaction to \"Elenoir\" perfume\n\n\"They see this brave, fearless girl who is defiantly and perfectly herself, no matter how hard anyone tries to make her something else. It compels them.\" —Jasper, perfectly summarizing why I love Eleanor\n\n\"Have some Froot Loops. They're the gateway drug to Apple Jacks.\" —Wilhelmina\n\n\"I'm the King of England — I don't do my own wet work.\" —Cyrus just before killing Jeffrey Stewart\n\n\"So a pack of wild dogs dragged you through the streets — that's what you're going with?\" —the pretty bartender as she cleans up Liam's face\n\nBest Musical Cues of the Week\n\n\"Alive,\" by Sia, as we first see Robert on the beach\n\n\"Legendary,\" by Welshy Arms, as Cyrus shaves his head\n\n\"Holy Ground,\" by BANNERS, as Cyrus dumps Jeffery Stewart's body and Eleanor and Jasper paint", "images": ["https://ew.com/thmb/-l4JcplzgC8fDBIzqeYq6s3uBz4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-9999-79672325605a4291b5c49bad7766a785.jpg", "https://ew.com/thmb/9aros0demFTnQNROugZGjvFnV0k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/royals-recap-1-2000-bbe7f1b0f1644481a806ff40b1b6bdb0.jpg", "https://ew.com/thmb/2-nRYM_IQ_pXvPKhSnK7nOQphUc=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/royals-2d935eb9de364b229fd1fabbd25ab866.jpg", "https://ew.com/thmb/GmQhqSEW49H3wzGVOJ9Bzriazxw=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tht_js_307_0265rt_f-2000-d2d9929b2ef14c299a46ec58451f9b64.jpg", "https://ew.com/thmb/88EYyKI3IXoihfkJZcVFae0wkP4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/screen-shot-2016-12-30-at-3-24-24-pm-2000-b77b5544f0bf45e48d0a8ef185ab4f6b.jpg", "https://ew.com/thmb/UeHRZNDymtuDGcdIjGT1U4IkxeM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/elizabethhurleyroyals-bf4b8a8f47e445678c945367ee9372d5.png", "https://ew.com/thmb/60l6fvBEsI2C_2jneyMSpPQxB_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2016-20991-294d40c3d6644ce08c20651b5be3078a.jpg", "https://ew.com/thmb/NjGijUzbAacE9s09WoD2tROYeEg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-recap-main-01-2000-da356caffbd04ee6ac7af0f100bf4234.jpg", "https://ew.com/thmb/hqUkGNjyjQH-J5SzZwY07Oh_kP0=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-recap-4-2000-6bd390f07f89476ab3c90e71f5a8a2a4.jpg", "https://ew.com/thmb/XN-vCpnmWEsiwL_xQS2DcFtIf5g=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/royals-860d1d94553349e6b49fa600b378b47a.jpg", "https://ew.com/thmb/0fuQqcEaF2lUd5uFU_ut15JE4oQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/royals-recap-33-2000-9c5c32ae6b684557a56b1720c5896dea.jpg", "https://ew.com/thmb/NdO2ljqXG6jlyzL3-MgvUVbzI28=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/jasper-eleanor-cd581b5f6eb949ec91995a33881ecd11.jpg", "https://ew.com/thmb/vYk6Mliix48PoTWysT3Ha4gtdVc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/tht_js_312_0238rt_f-2000-29dcfd1de5e34ce8acda31b8c8d79495.jpg", "https://ew.com/thmb/VNAF_iOY_zeieybDz-JWxzKF3uc=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/royals-recap-12-2000-2f70e755f679495ab93147f595710a20.jpg", "https://ew.com/thmb/uosO9EsczCLP4KRmtIOA3m3e8HQ=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-150503-b802a943a7004145a69673d0f1709be9.jpg", "https://ew.com/thmb/1-Fuk8304QOS7raYbBh8LnA2z1Y=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2000-256a3120c9884ee6a163ca3b71e6fd32.jpg", "https://ew.com/thmb/77mHgJVvOi2SIa1qvDPcfGvpMQ4=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/eleanor-2200d51df82a40b994e91e0d848c74b1.png", "https://ew.com/thmb/OzqFdD-cyBWOXSBwB5BiM0oBwXA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-3e68479c19404965bc7af32d20f431ab.jpg", "https://ew.com/thmb/ZPdtVjvxRtHtiQLqn-dGMYwve8I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2016-1343full-57e6d6c487b442129020b3cfc936e879.jpg", "https://ew.com/thmb/Q2NFRdENeQfJBEELS1y9BBkNErA=/282x188/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-150510-7d9acd3a20644401bfe273fb0e905ecb.jpg"], "top_img": "https://ew.com/thmb/60l6fvBEsI2C_2jneyMSpPQxB_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2016-20991-294d40c3d6644ce08c20651b5be3078a.jpg", "keywords": [], "authors": [], "canonical_link": "https://ew.com/recap/the-royals-season-3-premiere/", "title": "The Royals premiere recap: Season 3, Episode 1", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "Here are the most royally ridiculous moments of the week", "parsely-section": "TV", "parsely-tags": "Article,Recaps,TV,The Royals", "article": {"section": "EW", "author": "https://www.facebook.com/entertainmentweekly"}, "fb": {"app_id": 2485718348341688}, "og": {"type": "article", "site_name": "EW.com", "url": "https://ew.com/recap/the-royals-season-3-premiere/", "title": "'The Royals' Premiere Recap: The Monarchy's Back and Dirtier Than Ever", "description": "Here are the most royally ridiculous moments of the week", "image": "https://ew.com/thmb/60l6fvBEsI2C_2jneyMSpPQxB_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2016-20991-294d40c3d6644ce08c20651b5be3078a.jpg"}, "twitter": {"card": "summary_large_image", "site": "@EW", "title": "'The Royals' Premiere Recap: The Monarchy's Back and Dirtier Than Ever", "description": "Here are the most royally ridiculous moments of the week", "image": "https://ew.com/thmb/60l6fvBEsI2C_2jneyMSpPQxB_A=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/the-royals-2016-20991-294d40c3d6644ce08c20651b5be3078a.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.18.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.18.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.18.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.18.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.18.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://ew.com", "summary": ""}