{"url": "https://people.com/tv/kylie-jenner-secret-pregnancy-gave-kris-jenner-anxiety/", "text": "At long last, Kylie Jenner‘s pregnancy is being openly discussed on Keeping Up with the Kardashians.\n\nSunday’s episode chronicled the new mom welcoming her first child, daughter Stormi, with rapper Travis Scott on Feb. 1. When the day arrived, Kylie chose to have just her mom Kris Jenner and sister Khloé Kardashian in the delivery room with her, in addition to Scott. And while the other sisters may have been disappointed to be left out, they were mostly relieved that they wouldn’t be blamed if the secret got out. (Though PEOPLE first confirmed the news of the baby on the way in September 2017, Kylie, 21, didn’t publicly address it until after she gave birth.)\n\n“Kylie is about to have her baby and it’s pretty crazy that it really hasn’t been confirmed,” said Kourtney, 39. “So I don’t want to be the one with the info, or getting blamed for someone finding out the secret.”\n\nKim, 37, marveled that her little sister had some amazing friends for having kept the news under wraps all those months.\n\n“Can you believe that Kylie got out of the hospital with not one report?” she said. “Now Caitlyn [Jenner] can never say we have big mouths and we leak everything. We kept that a secret!”\n\nMomager Kris, 62, admitted keeping a lid on the news wasn’t easy.\n\n“That was a lot of anxiety for me,” she said. “People were saying, ‘We’re going to post, we’re going to announce,’ and I’m like, ‘No!’ But she did it perfectly and it was such a positive experience for her.”\n\n“Totally,” Kim said. “Everyone was just like, ‘Okay, we get it. We get why you kept it private.’ … Kylie’s always wanted to be a mom, so this is really exciting for her. She just didn’t want anyone changing her happy moment and her happy pregnancy, so I’m really proud of her that she stuck to her guns and was able to tell her story her way.”\n\nVivien Killilea/Getty\n\nAnd Kylie, who said she was “really doing this for myself,” said the experience couldn’t have gone any better.\n\n“I like [pregnancy,]” she said. “I miss it. I had the easiest pregnancy ever. You never feel alone — I was really sad to not be pregnant anymore.”\n\nAt the end of the day, no one was more proud than Kris, who delivered the baby herself.\n\n“It’s only been a couple of days since Kylie had baby Stormi, and I can already tell that Kylie is going to be the most amazing mom and is so in love with her baby,” she gushed.\n\nBut at the same time, the momager was going through a challenging time with a different daughter.\n\n“My relationship with Kourtney over the years has been kind of fabulous, but lately there’s definitely a shift,” she said. “I really don’t know where this is coming from and it makes me really, really sad. I just wish she would make an effort to treat me the way I would love to be treated. I love her so much. She’s my firstborn daughter.”\n\nAs it turned out, the tension had started bubbling up after Kourtney’s therapist apparently informed her that she has an “issue with betrayal” because Kris cheated on her father, the late Robert Kardashian Sr., with soccer player Todd Waterman.\n\nRELATED VIDEO: Kris Jenner Calls Cheating on Husband Robert Kardashian ‘One of My Biggest Regrets in Life’\n\n“Lately, in therapy, a lot of topics that have been coming up are about childhood issues and how that affects so many of my relationships today,” she said. “If I had a problem, I wouldn’t go to [Kris], ever. I would go to Dad. She was not my person that I found comforting.”\n\nBut Kris said Kourtney was “doted on” as a child.\n\n“I think she’s going through a phase in life where she has some anger inside that I don’t quite understand,” she said. “I wish her dad was around to say, ‘You’ve had the best most magical childhood of any child, ever.’ That’s what we prided ourselves on.”\n\n“She probably felt like she was always picking a side and it was always my dad’s,” remarked Khloé, 34. “In the divorce, she picked his. In the [O.J. Simpson] trial, she picked his. She wanted to live there over your house. She’s always picked his.”\n\nKhloé said she wished her sister would communicate her feelings more openly with the family.\n\n“I know Kourtney, for some reason, finds more comfort in talking to a stranger about family stuff, rather than talking to the source,” she said. “I would be fine with that if Kourtney took whatever her therapist talked about and then came to the source, but that’s the part we’re missing and that’s what’s frustrating to us all, because we never resolve something or work through something or just even fight about something if we don’t know what’s going on. It’s always us pulling teeth and guessing with her.”\n\nEventually, Kourtney decided she had to talk things through with Kris.\n\n“If my going to therapy and figuring this all out is making me resentful towards my mom, which is not how I want to feel and it’s not how I want to treat her, then I feel like it is worth having a conversation with her, just to let her know that’s not my intention,” she said. “It’s really about me working on myself.”\n\n“I’ve gone through a phase of being more sensitive to things,” she admitted. “It’s nothing bad, it’s just understanding and then understanding how that affects our current relationships. Like, if there’s certain behavior that Younes [Bendjima] will do that’s similar to things that my mom would do, just subconsciously, it will just bring up similar issues. There is that uncomfortable place when you are growing, but I think it’s something that I have to just deal with myself.”\n\nSitting down with her mom, Kourtney did her best to explain where she was coming from.\n\n“As you know, I’ve been gong to therapy lately and my therapist says your intimate relationships bring up childhood issues,” she said. “I just don’t think it’s fair if I’m not communicating it. I don’t want to go back in time … I feel like it has passed and I’m not feeling that way anymore, but I just wanted to explain that to you so you understand where it’s coming from.”\n\n“What we usually do as a family is we criticize each other, we’re judgmental and we give each other an attitude and we’re bitchy,” she added. “So moving forward in life, I’ve made a point with my sisters already to not accept that anymore.”\n\nTearing up, Kris said all she wanted was “the best, most joyful, peaceful life” for her daughter.\n\n“Whatever it takes for me to be part of that, that’s all I want,” she said. “That’s the joy of my life, is you guys. I have nothing else. I never want you to be disappointed in me, so if there’s something you want to say or something that you need to have me work on, I’m 100 percent ready to work on it because I love you so much. You’re my firstborn and I wouldn’t trade that for anything.”\n\nThe two of them hugged it out, and Kourtney agreed to work on things, too.\n\n“Moving forward, I’m going to tell you if I don’t like something or if something is hurtful, instead of just being a bitch about it,” she promised.\n\n“I think Kourtney and I have gotten through that rough patch and started a healing process,” said Kris. “That’s a really big step in the right direction, especially for her. She’s always going to hang onto the past a little bit, but what I am hopeful for is that we can look forward to an amazing future together because I love her more than anything.”\n\nKeeping Up with the Kardashians airs Sundays (9 p.m. ET) on E!", "images": ["https://people.com/thmb/RR0kIZduxY-70mRcq7JYJNyiVsY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(689x219:691x221)/kris-jenner-corey-gamble-b813bf264efb488893288f0f8dd1c63e.jpg", "https://people.com/thmb/hPFL13NnDxMWPH2Ss0zGEQc5Aco=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(649x392:651x394)/kourtney-kardashian-travis-barker-1-1-35d7544796bb4b6aa966c9749c20d83b.jpg", "https://people.com/thmb/Lje7sGaj3HgeS-yLg9z5JSNPfrU=/300x150/filters:no_upscale():max_bytes(150000):strip_icc()/people_magazine_sub-e6689738996d40f38f154099e1751481.png", "https://people.com/thmb/jtJIFnQNQ4j9qYCX4oAE6tq3iYg=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(734x148:736x150)/john-mcenroe-patti-smyth-060723-1-1fe53b6d84b849cfba2d7e5536d30f8e.jpg", "https://people.com/thmb/HGs2J4j6mDmZiUXUZkXdi0098Ew=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(999x0:1001x2)/Kris-Jenner-060723-723fa0610b4e48c095cfb82ace451520.jpg", "https://people.com/thmb/j-ROYD9KZKSkQFxuY8s-obvSU9Q=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Kris-Jenner-attends-The-2021-Met-Gala-08-14092021-4bcc500bb8ba46b7a38124b63fcb1e49.jpg", "https://people.com/thmb/b3mER0Fz3D-M_B3QA6ITz5nZ27w=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(764x449:766x451)/kris-caitlyn-jenner-42ed0eb9a4f9422987dec748a957595c.jpg", "https://people.com/thmb/HVFfH25NJm2S5sHMRQKTpG7aKe4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x599:961x601)/kourtney-kardashian-scott-disick-tout-efe2a8aec78943228831d11be4e9ae25.jpg", "https://people.com/thmb/_eybvdKGowLiFnCVBsvWqiZE788=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/Kardashians-Joke-Blac-Chyna-Ruined-Kourtneys-Wedding-Fitting-20191125_50-a6b05264ae514e548e413c167407e3d3.jpg", "https://people.com/thmb/PvAfAWVw-6gAEgrTnK5S8GtIHMs=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(979x412:981x414)/charlize-theron-dating-history-split-326b601412824a88857488ff9d554237.jpg", "https://people.com/thmb/CeHlsOd__TkM7Z56kwJ7FwlzwKY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(1079x524:1081x526)/carmelo-anthony-son-kiyan-1-5041476710e944e5a44ca9662f3f4d51.jpg", "https://people.com/thmb/wExjBSQr6ZFPEVjPcO9MQqDvtOY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kris-jenner-black-chyna-lawsuit-92822-c70ec4eb93154097b466a86e7fe4147d.jpg", "https://people.com/thmb/Pa-l4oQ_axqex2l2rlb155GEyFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(611x0:613x2)/kylie-jenner6-1-1d71067e198f4d82a3bfc0ea8da862b9.jpg", "https://people.com/thmb/4AefMr94wrVq-3cxGfBhjbN3jiM=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(478x251:480x253)/kylie-kris-jenner-stormi-lip-sync-tiktok-100722-105e3b63ae3b4da3b66fc29360f9f725.jpg", "https://people.com/thmb/25l7yFsRvkk9FSd-qwd4G9gcLrY=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(749x0:751x2)/kylie-jenner-pregnancy-no-2-the-kardashians-092922-1-020b1192f3d74fcb85c9735d06b0c12c.jpg", "https://people.com/thmb/QuhZMAjBVLVentxpFkzj5hfX9M4=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x0:961x2)/Screen-Shot-2020-10-07-at-11.43.54-AM-2-895008b6472046b688fabbaa94cb552c.jpg", "https://people.com/thmb/dCxtCxKmKGa8cOZsDY-JR7xpm-k=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(594x0:596x2)/kourtney-kardashian-scott-disick-ff4b9c0db0154652b059be3019dec921.jpg", "https://people.com/thmb/s_vB_AG_siU0qpSzkVpjh_myRME=/282x188/filters:no_upscale():max_bytes(150000):strip_icc():focal(959x569:961x571)/kylie-jenner-tyga-1-8d182b05f7d7419fb65dca1df1d5e360.jpg"], "top_img": "https://people.com/thmb/Pa-l4oQ_axqex2l2rlb155GEyFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(611x0:613x2)/kylie-jenner6-1-1d71067e198f4d82a3bfc0ea8da862b9.jpg", "keywords": [], "authors": ["Aurelie Corinthios"], "canonical_link": "https://people.com/tv/kylie-jenner-secret-pregnancy-gave-kris-jenner-anxiety/", "title": "Kylie Jenner's Secret Pregnancy Gave Kris 'Anxiety' — But It Was a 'Such a Positive Experience'", "meta_data": {"robots": "max-image-preview:large, NOODP, NOYDIR", "viewport": "width=device-width, initial-scale=1.0", "description": "On Sunday's Keeping Up with the Kardashians, Kylie Jenner welcomed her first child, daughter Stormi, after months of keeping the news under wraps", "emailcontenttype": "STRUCTUREDCONTENT", "emailvertical": "PEOPLE", "sailthru.author": "Aurelie Corinthios", "parsely-section": "Entertainment", "parsely-tags": "TV,Khloé Kardashian,Kourtney Kardashian,Kardashians,News,Kylie Jenner,Keeping Up with the Kardashians,Kim Kardashian,Parents,Kris Jenner", "article": {"section": "People", "opinion": "false", "author": "https://www.facebook.com/peoplemag"}, "fb": {"app_id": 610948219662029, "pages": 95926963131}, "og": {"type": "article", "site_name": "Peoplemag", "url": "https://people.com/tv/kylie-jenner-secret-pregnancy-gave-kris-jenner-anxiety/", "title": "Kylie Jenner's Secret Pregnancy Gave Kris 'Anxiety' — But It Was a 'Such a Positive Experience'", "description": "On Sunday's Keeping Up with the Kardashians, Kylie Jenner welcomed her first child, daughter Stormi, after months of keeping the news under wraps", "image": "https://people.com/thmb/Pa-l4oQ_axqex2l2rlb155GEyFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(611x0:613x2)/kylie-jenner6-1-1d71067e198f4d82a3bfc0ea8da862b9.jpg"}, "twitter": {"card": "summary_large_image", "site": "@people", "title": "Kylie Jenner's Secret Pregnancy Gave Kris 'Anxiety' — But It Was a 'Such a Positive Experience'", "description": "On Sunday's Keeping Up with the Kardashians, Kylie Jenner welcomed her first child, daughter Stormi, after months of keeping the news under wraps", "image": "https://people.com/thmb/Pa-l4oQ_axqex2l2rlb155GEyFo=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(611x0:613x2)/kylie-jenner6-1-1d71067e198f4d82a3bfc0ea8da862b9.jpg"}, "msapplication-TileColor": "#F4F4F4", "msapplication-TileImage": "/static/1.149.0/icons/favicons/mstile-144x144.png", "msapplication-square70x70logo": "/static/1.149.0/icons/favicons/mstile-70x70.png", "msapplication-square150x150logo": "/static/1.149.0/icons/favicons/mstile-150x150.png", "msapplication-square310x310logo": "/static/1.149.0/icons/favicons/mstile-310x310.png", "msapplication-wide310x150logo": "/static/1.149.0/icons/favicons/mstile-310x150.png"}, "movies": [], "publish_date": null, "source": "https://people.com", "summary": ""}