{"url": "https://web.archive.org/web/20171002131450/https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "text": "A gunman fired a barrage of bullets on an outdoor country music festival in Las Vegas Sunday night, killing at least 50 people and injuring more than 400 others, police said, in the worst mass shooting in modern American history.\n\nFrom his room on the 32nd floor of a glitzy hotel, the shooter, identified by law enforcement officials as Stephen Paddock, 64, of Mesquite, Nevada, fired shot after shot down on the crowd of more than 22,000, sending terrified concertgoers running for their lives.\n\n“We heard what sounded like firecrackers going off. Then all of a sudden we heard what sounded like a machine gun. People started screaming that they were hit… When we started running out there were probably a couple hundred [people] on the ground,” witness Meghan Kearney told MSNBC.\n\nPlay Facebook\n\nTwitter\n\nEmbed Watch Live: NBC News Special Report on Las Vegas Shooting autoplay autoplay Copy this code to your website or blog\n\n\"People kept dropping and dropping… People were getting shot one foot away from us,\" she said. “People were trying to save their friends. There were gunshots everywhere. Helping them would’ve meant that we got shot, too.”\n\nThe Latest:\n\n50 people were killed, an estimated 406 injured in deadliest mass shooting in modern American history.\n\nGunman identified as Stephen Paddock, 64-year-old man from Mesquite, Nevada.\n\nSeveral weapons were found inside Paddock's room at the Mandalay Bay Resort and Casino.\n\nPresident Donald Trump is monitoring the developments, the White House said.\n\nOfficials said it was unclear when Paddock checked into the Mandalay Bay Resort and Casino, and whether he had specifically requested a room on a high floor that overlooked the concert venue.\n\nPolice responded to reports of the shooting just after 10 p.m. (1 a.m. ET), and fatally shot the suspect in the hotel, officials said.\n\nThe shooting is not believed to be connected to international terrorism.\n\nRelated: Full Coverage on the Las Vegas Shooting\n\nAuthorities said they found \"multiple\" weapons in Paddock’s room after using explosives to enter. It was not immediately clear what kinds of weapons were found.\n\nThe shooting started while performer Jason Aldean was onstage, Sheriff Joseph Lombardo said at a news conference.\n\nAt least one off-duty Las Vegas police officer was shot, Lombardo said. Several other off-duty police officers are believed to be among the dead and injured.\n\nPolice have located Paddock’s roommate, Marilou Danley, 62, Lombardo said. They also found two vehicles related to the investigation: a Hyundai Tuscon and a Chrysler Pacifica Touring, both with Nevada license plates.\n\nMarilou Danley is wanted by police for questioning in connection with the shooting in Las Vegas on Oct. 1. LVMPD\n\nA search of their home in Mesquite, located about 80 miles away from Las Vegas, was underway.\n\nEarlier, police shut down the area and urged the public to stay away. Flights in and out of the airport were temporarily halted.\n\nRelated: List of Deadliest Mass Shootings in Modern America History\n\nAldean, who was named the Academy of Country Music's Entertainer of the Year in April 2017, was on stage performing on the final night of the three-day Route 91 Harvest festival at the Las Vegas Village when the first shots rang out.\n\nAldean later said via Instagram that he and his band were safe.\n\nPlay Facebook\n\nTwitter\n\nEmbed Las Vegas shooting witness: 'I saw guys plugging bullet holes with their fingers' 12:25 autoplay autoplay Copy this code to your website or blog\n\nFellow performer Jake Owen said he was standing about 50 feet away from Aldean when the shots started.\n\n\"It got faster and faster, almost like it was an automatic rifle,\" Owen said. \"At that point, everyone on stage started running everywhere.\"\n\nOwen passed by people who were covered in blood and eventually found shelter in his bus. The gunfire still hadn't stopped by the time he got there, he said.\n\n\"It wasn't something that was quick. It was chaos for a pure seven to ten minutes,\" he said.\n\nWitnesses said that the first round of shots sounded like fireworks. Only after the second burst of gunfire did the band stop playing.\n\n\"After the second round… everybody hit the ground around us,\" concert-goer Sean said on TODAY.\n\n\"It seemed like people were hit everywhere.\"\n\nPlay Facebook\n\nTwitter\n\nEmbed Popping of Gunfire in Las Vegas Caught on Camera 2:21 autoplay autoplay Copy this code to your website or blog\n\nAnother concertgoer, Jon Bessette, described a scene of \"pandemonium\" as \"the band ran off stage.\"\n\n\"Everyone was running, people were getting trampled,\" he said.\n\nPresident Donald Trump sent his condolences in a tweet Monday morning.\n\n\"My warmest condolences and sympathies to the victims and families of the terrible Las Vegas shooting. God bless you!\" he wrote.\n\nVice President Mike Pence also tweeted about the \"senseless violence.\"\n\n\"The hearts & prayers of the American people are with you. You have our condolences and sympathies,\" he wrote.\n\n\"To the courageous first responders, thank you for your acts of bravery,\" he added.\n\nMandalay Bay tweeted out a statement that said, \"Our thoughts & prayers are with the victims of last night's tragic events. We're grateful for the immediate actions of our first responders.\"\n\nPolice urged families looking to locate missing loved ones to call 1-866-535-5654.\n\nThis is a developing story. Please check back for updates.\n\nRichie Duchon and Andrew Blankstein reported from Los Angeles. F. Brinley Bruton, Rachel Elbaum and Yuliya Talmazan reported from London. Pete Williams reported from Washington. Elizabeth Chuck reported from New York.", "images": ["https://web.archive.org/web/20171002131450im_/https://media2.s-nbcnews.com/j/msnbc/components/video/201710/tdy_news_vegas_shooting_henry_bratton_russell_171002.nbcnews-ux-1080-600.jpg", "https://web.archive.org/web/20171002131450im_/https://media1.s-nbcnews.com/j/msnbc/components/video/201710/2017-10-02t08-24-47-866z--1280x720.nbcnews-ux-1080-600.jpg", "https://web.archive.org/web/20171002131450im_/https://nodeassets.nbcnews.com/images/transparent-placeholder.gif", "https://web.archive.org/web/20171002131450im_/https://media4.s-nbcnews.com/j/newscms/2017_40/2174696/171002-vegas-shooting-1010_11_88994ae3cb121abaaf564af25aa67ef4.nbcnews-fp-1200-630.jpg", "https://web.archive.org/web/20171002131450im_/https://media4.s-nbcnews.com/j/msnbc/components/video/201710/live_las_vegas.nbcnews-ux-1080-600.jpg", "https://web.archive.org/web/20171002131450im_/https://media1.s-nbcnews.com/j/newscms/2017_40/2174731/171002-marilou-danley-mc-1027_2_a152604eeaec18331f41764f891702ca.nbcnews-fp-360-360.jpg", "https://web.archive.org/web/20171002131450im_/https://nodeassets.nbcnews.com/cdnassets/projects/today-logo-site-nav.png", "https://web.archive.org/web/20171002131450im_/https://media1.s-nbcnews.com/j/newscms/2017_40/2174731/171002-marilou-danley-mc-1027_2_a152604eeaec18331f41764f891702ca.nbcnews-ux-600-700.jpg"], "top_img": "https://web.archive.org/web/20171002131450im_/https://media4.s-nbcnews.com/j/newscms/2017_40/2174696/171002-vegas-shooting-1010_11_88994ae3cb121abaaf564af25aa67ef4.nbcnews-fp-1200-630.jpg", "keywords": [], "authors": ["Andrew Blankstein", "Pete Williams", "Rachel Elbaum", "Yuliya Talmazan", "Elizabeth Chuck"], "canonical_link": "https://web.archive.org/web/20171002131450/https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "title": "Las Vegas Shooting: 50 Killed and 406 Hurt Near Mandalay Bay", "meta_data": {"description": "More than 50 people were killed when a gunman opened fire into a country music festival from the 32nd floor of Las Vegas' Mandalay Bay Resort and Casino on Sunday night, police said.\n\nSheriff Joseph Lombardo told reporters in a news conference that more than 200 people had been injured. Police responded to reports of the shooting just after 10 p.m. (1 a.m. ET), and later killed the suspected gunman in Mandalay Bay Resort, he added.", "viewport": "width=device-width, initial-scale=1", "“fb": {"pages”": "“1508175089456029\""}, "og": {"site_name": "NBC News", "description": "More than 50 people were killed when a gunman opened fire into a country music festival from the 32nd floor of Las Vegas' Mandalay Bay Resort and Casino on Sunday night, police said.\n\nSheriff Joseph Lombardo told reporters in a news conference that more than 200 people had been injured. Police responded to reports of the shooting just after 10 p.m. (1 a.m. ET), and later killed the suspected gunman in Mandalay Bay Resort, he added.", "title": "50 people killed, more than 400 hurt in Las Vegas Strip shooting", "url": "https://web.archive.org/web/20171002131450/https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "type": "article", "image": "https://web.archive.org/web/20171002131450im_/https://media4.s-nbcnews.com/j/newscms/2017_40/2174696/171002-vegas-shooting-1010_11_88994ae3cb121abaaf564af25aa67ef4.nbcnews-fp-1200-630.jpg"}, "twitter": {"card": "summary_large_image", "site": "NBCNews", "title": "50 people killed, more than 400 hurt in Las Vegas Strip shooting", "description": "More than 50 people were killed when a gunman opened fire into a country music festival from the 32nd floor of Las Vegas' Mandalay Bay Resort and Casino on Sunday night, police said.\n\nSheriff Joseph Lombardo told reporters in a news conference that more than 200 people had been injured. Police responded to reports of the shooting just after 10 p.m. (1 a.m. ET), and later killed the suspected gunman in Mandalay Bay Resort, he added.", "creator": "NBCNews", "image": "https://web.archive.org/web/20171002131450im_/https://media4.s-nbcnews.com/j/newscms/2017_40/2174696/171002-vegas-shooting-1010_11_88994ae3cb121abaaf564af25aa67ef4.nbcnews-fp-1024-512.jpg"}, "apple-itunes-app": "app-id=319740707, app-argument=https://www.nbcnews.com/storyline/las-vegas-shooting/las-vegas-police-investigating-shooting-mandalay-bay-n806461", "google-site-verification": "G4SGIUDh2TcgDVNjuleQ-Humwb3JAZaQD9Vg42Stfn8", "news_keywords": "News,U.S. news", "article": {"author": "https://www.facebook.com/NBCInvestigates?ref=hl"}, "DC.date.issued": "2017-10-02", "published": "2017-10-02T12:54:00.000Z", "blitz": "mu-e1e842c9-946002e6-ea8f0454-41b29546"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}