{"url": "https://web.archive.org/web/20161008094941/http://www.today.com/style/very-british-reason-why-prince-george-always-wears-shorts-t103657", "text": "The very British reason why Prince George always wears shorts\n\nshare tweet pin email\n\nWhen you see photos of Prince George, you probably focus on the 3-year-old’s sweet smile and cute chubby cheeks.\n\nBut there’s something else that people have noticed recently about the young royal: He’s always wearing shorts!\n\nCHRIS WATTIE / Reuters The royal family arrives at a children's party in British Columbia, Canada Sept. 29.\n\nRain or shine, when the little prince steps out in public, he sports a pair of adorable shorts, often paired with knee socks, a preppy striped belt and a tucked-in polo (yes, at age 3, young George is already more put together than most of us will ever be.)\n\nPool / Getty Images Prince William, Duchess Kate, Prince George and Princess Charlotte arrive in Victoria, Canada.\n\nWhy is Prince George never spotted in jeans or other long pants? Harper’s Bazaar UK did some investigating, and they found that dressing young boys in shorts is a long-standing tradition among the British royalty and aristocracy.\n\nRELATED: It's freezing, but boys want to wear shorts! Should you let them?\n\nSlideshow Photos Getty Images Europe The life of Prince George From the steps of St. Mary's Hospital in London to posing with his little sister Charlotte, take a look at the royal baby's adventures. The life of Prince George of The life of Prince George - Prince George, the adorable son of Prince William and Duchess Kate, continues to mesmerize the world. Take a look at the royal baby's cutest moments:\n\n\n\nCatherine, Duchess of Cambridge keeps an eye on Prince George of Cambridge during the Gigaset Charity Polo Match at the Beaufort Polo Club on June 14, 2015 in Tetbury, England. Getty Images / Getty Images\n\nThe life of Prince George of What goes up - Prince George of Cambridge walks up a hill during the Gigaset Charity Polo Match on June 14, 2015. Getty Images / Getty Images\n\nThe life of Prince George of Must come down - Prince George of Cambridge plays on a hill while his father, Prince William, Duke of Cambridge, plays polo. Getty Images / Getty Images\n\nThe life of Prince George of From the sidelines - Prince George of Cambridge is held up at a window of Buckingham Palace by his nanny Maria Teresa Turrion Borrallo to watch Trooping the Color on June 13, 2015 in London, England. The ceremony is Queen Elizabeth II's annual birthday parade and dates back to the time of Charles II in the 17th Century, when the Colors of a regiment were used as a rallying point in battle. Getty Images / Getty Images\n\nThe life of Prince George of The royal wave - Prince George of Cambridge is held by Prince William, Duke of Cambridge as they look out from the balcony of Buckingham Palace during the Trooping the Color on June 13, 2015 in London, England. Getty Images / Getty Images\n\nThe life of Prince George of Watching the parade - Britain's Queen Elizabeth II leads members of the royal family on the balcony of Buckingham Palace following the traditional Trooping the Color ceremony in central London, on June 13, 2015. From left: Prince Charles, Prince George, Prince William, Catherine, Duchess of Cambridge and Prince Harry. The Trooping marks the monarch's official birthday. EPA / EPA\n\nThe life of Prince George of Big brother - Prince William, Duke of Cambridge and Prince George of Cambridge arrive at St. Mary's Hospital in London, after Catherine, Duchess of Cambridge gave birth to a baby girl on May 2, 2015. Getty Images / Getty Images\n\nThe life of Prince George of First photo shoot - Prince George and Princess Charlotte pose for a photo. Getty Images / Getty Images\n\nThe life of Prince George of Kiss from big brother - The Duke of Duchess of Cambridge released the official photographs taken by the Duchess of Prince George and one-month-old Princess Charlotte together at their country retreat in Sandringham. AFP - Getty Images / AFP - Getty Images\n\nThe life of Prince George of Royally cute - \"We're delighted to share the first photo of Prince George with his little sister Princess Charlotte,\" the family photo was captioned by the Kensington Palace Twitter account. pool via Reuters / pool via Reuters\n\nThe life of Prince George of Sweet souvenirs - Royal souvenirs of British Prince George, Prince William and Catherine, Duchess of Cambridge, sit on a shelf at a souvenir shop in London, on April 9, 2015. Britain is preparing for the royal couples second child. EPA / EPA\n\nThe life of Prince George of Christmas greeting - Happy Christmas from the Prince! The Duke and Duchess of Cambridge have released three official Christmas photographs of Prince George. EPA / EPA\n\nThe life of Prince George of Picture perfect - Taken in November, the photographs show the 1-year-old prince in a courtyard at Kensington Palace. They are the first photos of Prince George released since his first birthday in July. PA Wire via Getty Images / PA Wire via Getty Images\n\nThe life of Prince George of That face - The prince is seen wearing a collared shirt and a sweater vest designed with soldier guardsmen on the front. Prince George will soon become a big brother. Duchess Kate is expecting a second child in April. EPA / EPA\n\nThe life of Prince George of Catherine, Duchess of Cambridge holds Prince George as he points to a butterfly on Prince William's hand as they visit the Sensational Butterflies exhibition at the Natural History Museum on July 2, 2014 in London. The family released the photo ahead of the first birthday of Prince George on July 22. WPA Pool via Getty Images / WPA Pool via Getty Images\n\nThe life of Prince George of Look, Mom, no hands! - This photo dated Wednesday July 2, 2014, was taken to mark the first birthday of Prince George and shows the Prince toddling during a visit to the Sensational Butterflies exhibition at the Natural History Museum on July 02, 2014 in London. WPA Pool via Getty Images / WPA Pool via Getty Images\n\nThe life of Prince George of Butterfly effect - Duchess Kate holds Prince George as they the Sensational Butterflies exhibition in London with Prince William. WPA Pool via Getty Images / WPA Pool via Getty Images\n\nThe life of Prince George of Horsing around - Duchess Kate and Prince George watch Prince William and Prince Harry play in the Jerudong Trophy charity polo match at Cirencester Park Polo Club on June 15, 2014. Getty Images / Getty Images\n\nThe life of Prince George of Baby steps - Prince George gets a little help from his mom as he practices standing up on his own two feet. Zuma Press / Zuma Press\n\nThe life of Prince George of And he's off - Prince George walks alongside his mother while attending the Jerudon Trophy polo match at Cirencester Park Polo Club, where George's dad, Prince William, was playing on June 15, 2014. Getty Images / Getty Images\n\nThe life of Prince George of Tiny teeth - Prince George, with newly grown in teeth, reacts in Prince William's arms after looking at an Australian animal called a bilby during a visit to Sydney's Taronga Zoo on April 20, 2014. Reuters / Reuters\n\nThe life of Prince George of Fatherly love - Prince William kisses Prince George as they look at an Australian animal called a bilby, which has been named after the young Prince, during a visit to Sydney's Taronga Zoo on April 20, 2014. Pool via Reuters / Pool via Reuters\n\nThe life of Prince George of What a wombat! - Duchess Kate holds her son Prince George as his father, Britain's Prince William, holds a toy wombat that was given as a present to him from Australia's Governor-General Peter Cosgrove at Admiralty House in Sydney April 16, 2014. Reuters / Reuters\n\nThe life of Prince George of Hugs for mama - Prince George, 8-months-old, shares an adorable moment with his mother, Catherine, the Duchess of Cambridge, during a Plunkett's Parents Group playdate at the Government House in Wellington, New Zealand. The Duke and Duchess of Cambridge are on a three-week tour of Australia and New Zealand, the first official trip overseas with their son, Prince George. Woolf Crown Copyright via AFP - Getty Images / Woolf Crown Copyright via AFP - Getty Images\n\nThe life of Prince George of Meet and greet - Prince William looks on as Catherine, Duchess of Cambridge, and Prince George attend a parenting group at the Government House in Wellington, New Zealand. George, wore navy blue shorts with a sailboat on it by designer Rachel Riley. Government House NZ via Getty Images / Government House NZ via Getty Images\n\nThe life of Prince George of Chubby cheeks - Britain's Prince George is carried by his mother Catherine, the Duchess of Cambridge. Reuters / Reuters\n\nThe life of Prince George of Making friends - Prince George plays with toys alongside other babies while attending a parenting group at the Government House on April 9, 2014 in Wellington, New Zealand. Pool via Getty Images / Pool via Getty Images\n\nThe life of Prince George of Pulling mom's hair - The little prince has some fun with his mom's hair during a visit with a parenting group at the Government House in Wellington, New Zealand. The day marked the public’s first chance to see Prince George interacting with other children. Pool via Getty Images / Pool via Getty Images\n\nThe life of Prince George of First official outing - Prince William, Duke of Cambridge, Catherine, Duchess of Cambridge and Prince George of Cambridge arrive at Wellington Airport on April 7, 2014 in Wellington, New Zealand. Getty Images / Getty Images\n\nThe life of Prince George of Family event - Prince William, Duke of Cambridge and his wife Catherine, Duchess of Cambridge, arrive with Prince George of Cambridge at Chapel Royal in St. James's Palace in London on Oct. 23, 2013, ahead of the christening of the 3-month-old prince. AFP - Getty Images / AFP - Getty Images\n\nThe life of Prince George of Full family - Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge, sit with their son, Prince George, in the garden of the Middleton family home in Bucklebury, Berkshire, England on Aug. 20, 2013. The family is surrounded by retriever Tilly (a Middleton family pet) and Lupo, the couple's cocker spaniel. EPA / EPA\n\nThe life of Prince George of George's debut - Prince William and Catherine, Duchess of Cambridge, show their newborn baby boy, Prince George, to the world's media while standing on the steps outside the Lindo Wing of St. Mary's Hospital in London on July 23, 2013. AFP - Getty Images / AFP - Getty Images\n\nThe life of Prince George of Media madness - Two days after George's birth, British newspaper front pages show photographs of the royal baby and his parents. George was born on Monday July 22, 2013. Getty Images / Getty Images\n\n“It’s a very English thing to dress a young boy in shorts,” British etiquette expert William Hanson told Bazaar. “Trousers are for older boys and men, whereas shorts on young boys is one of those silent class markers that we have in England. Although times are (slowly) changing, a pair of trousers on a young boy is considered quite middle class–quite suburban. And no self-respecting aristo or royal would want to be considered suburban.”\n\nPrince George waves to the public and media as he visits the Lindo Wing at St. Mary's Hospital to meet his little sister for the first time. A photo posted by Kensington Palace (@kensingtonroyal) on May 2, 2015 at 12:27pm PDT\n\nMost boys graduate to full-length trousers at about 8 years old, Hanson explained. He said the shorts-only tradition may stem from the antiquated custom of “breeching,” which dates back centuries in the U.K.\n\nRELATED: Watch Princess Charlotte, Prince George play with balloons, bubbles during party\n\nTraditionally, he said, young British boys were dressed in gowns for the first few years of their lives, until being “breeched” and graduating to short trousers.\n\nMATT PORTEOUS / PA Prince George, who celebrates his third birthday on July 22, balances on a wooden swing. The picture was taken at the family's Norfolk home in mid-July.\n\nPrince George is following in his father’s footsteps in the shorts department. The Duke of Cambridge sported a very similar look in his younger years:\n\nPrincess Diana Archive / Getty Images Princess Diana taking Prince William for his first day of nursery school in September 1985.\n\n“The British upper set are always keen to hold on to tradition, and this one also silently marks them out from 'the rest,” Hanson told Bazaar.\n\nHowever, though the Duke and Duchess of Cambridge may be following royal tradition when it comes to George’s shorts, they certainly aren’t elitist when it comes to where they buy clothes for their kids.\n\nChris Jackson / Getty Images Duchess Kate and Prince George visit the Royal International Air Tattoo at RAF Fairford on July 8.\n\nRELATED: Prince George’s $39 robe sells out after he wears it while meeting the Obamas\n\nKate and William are known for dressing Prince George and Princess Charlotte in affordable, down-to-earth brands. Take these cute red corduroy shorts that George wore during the royal family’s recent trip to Canada:\n\nGetty Images Prince George waves as he leaves from Victoria Harbour to board a sea-plane on the final day of their t our of Canada on Oct. 1.\n\nThey’re from London-based childrenswear brand Pepa & Co., and they cost the equivalent of about $20.\n\nDonaCarmen.es\n\nKeep rocking the shorts, Prince George — they couldn’t be any cuter!", "images": ["https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/i/newscms/2016_38/1160887/royals-canada-1-today-160925-tease_52a512917d9d439d209d014494cbe56d.jpg", "https://web.archive.org/web/20161008094941im_/http://www.today.com/style/very-british-reason-why-prince-george-always-wears-shorts-t103657", "https://web.archive.org/web/20161008094941im_/http://media1.s-nbcnews.com/j/newscms/2016_27/1141835/prince-george-royal-international-air-tattoo-007-tease-today-160708_a6e249b57cda97848ad8248a7f8a4414.today-inline-large.JPG", "https://web.archive.org/web/20161008094941im_/http://media3.s-nbcnews.com/j/MSNBC/Components/Video/201610/tdy_klg_luxe_161007.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media1.s-nbcnews.com/j/newscms/2016_25/1138079/lindsay_lowe_headshot_70d5d8a8d635c6a136d9797f2c61e1e4.today-byline.png", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/MSNBC/Components/Video/201610/tdy_take_fashion_161003.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media3.s-nbcnews.com/j/MSNBC/Components/Slideshows/_production/_archive/TODAY/Royals/ss-140409-Prince-George/ss-150619-prince-george-01.today-ss-slide-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media3.s-nbcnews.com/j/newscms/2016_40/1164061/prince-george-shorts-inline-today-161007_0e74420e2d8403dfacf16d7829a8168b.today-inline-large.jpg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/newscms/2016_40/1164062/princess-diana-prince-william-shorts-inline-today-161007_0e74420e2d8403dfacf16d7829a8168b.today-inline-large.jpg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/MSNBC/Components/Video/201610/tdy_take_shoes_161006.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media2.s-nbcnews.com/j/MSNBC/Components/Video/201609/tdy_klg_royals_160928__059316.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/MSNBC/Components/Video/201609/tdy_keir_royals_160928.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media1.s-nbcnews.com/j/MSNBC/Components/Video/201610/x_tdy_ov_stylepronunciation_1610050.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media3.s-nbcnews.com/j/newscms/2016_39/1162271/royals-attend-birthday-party-001-inline-today-160929_44640b457c4a89e097c64910eca94b35.today-inline-large.jpg", "https://web.archive.org/web/20161008094941im_/http://media2.s-nbcnews.com/j/MSNBC/Components/Video/201609/tdy_keir_royals_160927__131317.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/newscms/2016_40/1163959/pantalon-tenesis-prince-george-shorts-today-16-10-06_0263f65afd59e4bef733afb66b36b7ef.today-inline-large.jpg", "https://web.archive.org/web/20161008094941im_/http://c.betrad.com/pub/icon1.png", "https://web.archive.org/web/20161008094941im_/http://nodeassets.today.com/img/svg/641a740d.video-play-white.svg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/MSNBC/Components/Video/201609/tdy_keir_royals_160930.today-vid-canonical-small-desktop.jpg", "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/j/newscms/2016_38/1160887/royals-canada-1-today-160925-tease_52a512917d9d439d209d014494cbe56d.today-inline-large.jpg", "https://web.archive.org/web/20161008094941im_/http://media1.s-nbcnews.com/j/newscms/2016_29/1145082/prince-george-birthday-002-inline-today-160722_7e7e35263310c008d5704254bc48ada4.today-inline-large.jpg"], "top_img": "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/i/newscms/2016_38/1160887/royals-canada-1-today-160925-tease_52a512917d9d439d209d014494cbe56d.jpg", "keywords": [], "authors": ["Lindsay Lowe"], "canonical_link": "https://web.archive.org/web/20161008094941/http://www.today.com/style/very-british-reason-why-prince-george-always-wears-shorts-t103657", "title": "The very British reason why Prince George always wears shorts", "meta_data": {"viewport": "width=device-width initial-scale=1 maximum-scale=1 user-scalable=no", "msvalidate.01": "43434ADDF3F60D7897F819F388E2FADF", "author": "Lindsay Lowe", "og": {"description": "An etiquette expert explains why Prince George always wears shorts in public.", "title": "The very British reason why Prince George always wears shorts", "site_name": "TODAY.com", "type": "article", "image": "https://web.archive.org/web/20161008094941im_/http://media4.s-nbcnews.com/i/newscms/2016_38/1160887/royals-canada-1-today-160925-tease_52a512917d9d439d209d014494cbe56d.jpg", "url": "https://web.archive.org/web/20161008094941/http://www.today.com/style/very-british-reason-why-prince-george-always-wears-shorts-t103657"}, "description": "An etiquette expert explains why Prince George always wears shorts in public.", "twitter": {"title": "The very British reason why Prince George always wears shorts", "card": "summary_large_image", "site": "@TodayShow", "description": "An etiquette expert explains why Prince George always wears shorts in public.", "creator": "@TodayShow", "domain": "TODAY.com", "image": {"src": "http://media4.s-nbcnews.com/j/newscms/2016_38/1160887/royals-canada-1-today-160925-tease_52a512917d9d439d209d014494cbe56d.today-inline-vid-featured-desktop.jpg"}}, "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 12566691349}, "news_keywords": "Royals ,Trending,Style,Parents,Celeb style", "google-site-verification": "uDRXhvw8LRHhorJhIUmXCkUPjqGebM6KFh9jZGwH6VA", "DC.date.issued": "2016-10-07T18:02:00.000Z", "apple-itunes-app": "app-id=416357699, affiliate-data=ct=todaycom_sb&pt=211554, app-argument=http://www.today.com/style/very-british-reason-why-prince-george-always-wears-shorts-t103657"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}