{"url": "https://www.techradar.com/black-friday/black-friday-cyber-monday-2018-deals-in-usa", "text": "While Black Friday has come and gone, there are still plenty of impressive offers to shop, thanks to extended sales from Amazon, Best Buy, and Walmart. That means you can still find Black Friday deals on best-selling tech, home items, appliances, mattresses, and gift ideas.\n\n\n\nI'm combing through all of the available sales to bring you all the best Black Friday deals that are still live. While several offers have ended, there are still some gems to be had on Apple devices, OLED TVs, robot vacuums, gaming consoles and smart home devices.\n\nBelow is a list of today's best sales, followed by the best Black Friday deals still available. Some highlights include this rare offer from Hulu that gets you a year for just $0.99 a month, this Samsung 75-inch 4K smart TV on sale for $579.99, and the Apple Watch SE on sale for $179.\n\n\n\nKeep in mind that most offers will be ending soon, and you might not see prices like this outside of holiday events like the upcoming Christmas sales.\n\n15 best Black Friday deals available today\n\nHulu: was $7.99 now $0.99 a month for the first year\n\nRare deal: Down to its lowest ever price – last seen during Black Friday in 2020 – you can now get Hulu's With-Ads plan for just $0.99 a month for the first 12 months of your subscription. That's a massive 87% saving on the Hulu price, and not likely to be a rate we'll see for another year now. So lock in and consider adding STARZ as a premium add-on, paying just $0.99 for your first six months (usually $9.99 a month in addition).\n\nApple AirTag 4 pack: was $99 now $79 at Amazon\n\nBest-seller: The Apple AirTag is the best-selling gadget on Amazon and rarely gets discounted, but Amazon has the 4-pack on sale for $79 - the lowest price we've seen all year. If you tend to misplace your keys, luggage, or wallet, just attach the AirTag to anything you don't want to want to lose, and your iPhone will locate the item.\n\nSamsung 75-inch 4K Smart Tizen TV (2022): was $749.99 now $579.99 at Best Buy\n\nThis Samsung Crystal 4K smart TV was a best-seller at last year's Black Friday sale, and Best Buy currently has the 75-inch model on sale for a record-low price of $579.99. This 4K UHD TV packs a solid 'Crystal' UHD 4K processor, an easy-to-use Tizen operating system, and full HDR support - all for under $600, which is an incredible deal.\n\nBissell Little Green Portable Carpet Cleaner: was $123.34 now $78 at Walmart\n\nBissell carpet cleaners have become all the rage lately, and Walmart's Black Friday deals include the top-rated Little Green model on sale for $78 – a new record-low price. Perfect for pet owners and parents, the portable carpet cleaner can magically erase spills and stains on carpets, couches, auto interiors, and more.\n\nApple AirPods (2nd Generation): was $159 now $89.99 at Amazon\n\nIf you're looking to grab today's cheapest AirPods deal, Amazon has the best-selling AirPods 2 on sale for $89.99. That's the best deal you can find right now and fantastic value for a pair of Apple's premium earbuds. This deal is highly recommended if you want new AirPods and don't need noise-canceling technology.\n\nNectar Memory Foam mattress: now from $359 at Nectar\n\n40% off everything: The Nectar is a great all-rounder memory foam mattress that will suit plenty of tastes and sleep styles. Today's Black Friday sale knocks 40% off everything, which takes the price of a queen down to $659. Our reviewers found this mattress delivered good pressure relief and motion isolation, making it a good choice for anyone with achy joints or who shares a bed with a partner. It comes with a lifetime warranty and a year's risk-free trial, so you'll have plenty of time to make sure it suits you.\n\nNintendo Switch (Neon) + Mario Kart 8 Deluxe + 3 Months Switch Online: $299.99 at Best Buy\n\nRare deal: A very familiar Nintendo Switch bundle is back again for this year's Black Friday. It includes the Switch console, a digital copy of Mario Kart 8 Deluxe, and a 3-month Switch Online membership. This represents a saving of around $70 compared to buying all three separately so it's excellent value for money if you are looking to buy the popular Nintendo console for the holidays.\n\nPS5 Slim + Marvel's Spider-Man 2: $499 at Walmart\n\nGoing fast: Walmart currently has stock for the PS5 Slim, and it's a brilliant bundle to boot, packing in a copy of Marvel's Spider-Man 2 and the new detachable disc drive, giving you the option of playing physical games. We're expecting stock to sell through very quickly here, so be sure to act fast!\n\niRobot Roomba Combo i5+ Robot Vacuum & Mop: was $549.99 now $229 at Amazon\n\nAmazon's Black Friday deals include the iRobot Roomba i5+ robot vacuum and mop combo on sale for $229, thanks to today's massive 35% discount. The robot vacuum not only provides powerful suction to clean your floors, but it's also designed for wet floor cleaning and automatically empties its bin on its own for up to 60 days.\n\nApple Watch SE (2nd Gen, GPS): was $249 now $179 at Amazon\n\nLowest price: Eying up that Apple Watch 9 but don't want to pay a premium? The latest Apple Watch SE is a fantastic choice, and right now, it's at its lowest-ever price at Amazon. Sure, the SE 2 doesn't feature the always-on display or ECG of the Series 8, but it's a superb device that's more than capable of all the essentials. You can check out our Apple Watch SE 2 review for why we awarded this model four and a half stars out of five.\n\nDyson Airwrap: was $599 now $479.99 at Amazon\n\nRare deal: The highly-coveted Dyson Airwrap has several hair-styling tools in one, allowing you to style your hair however you want without switching your main tool, only the attachments. In our review, we praised it for being lightweight and easy to use but also lauded it for producing gorgeous and healthy results with its intelligent heat control and enhanced Coanda airflow. Right now, it's discounted with a $19.01 coupon, which you should remember to tick before checkout.\n\nDell XPS 13 laptop: was $799 now $599 at Dell\n\nLowest price: This is the cheapest price we've ever seen for a Dell XPS 13 laptop, and it's one of the latest models. As you'd expect, this isn't the highest configuration since it's got a 12th gen Intel Core i5 chipset, 8GB of RAM, and a 256GB SSD, but this is a superb price for such a premium machine. The main selling points are the gorgeous aluminum chassis, excellent display, and incredibly lightweight design that's perfect for everyday carry.\n\nMeta Quest 3 (128GB) + Asgard's Wrath 2: $499 at Amazon\n\nHot-seller: The brand-new Meta Quest 3 hasn't been discounted for Black Friday, but you can pick up this bundle that comes with a copy of the action RPG Asgard's Wrath 2 for free - effectively saving you $60. It's definitely one to consider, as we awarded the VR headset a full five stars in our Meta Quest 3 review and called it a massive step up over the Quest 2. It also holds the top spot in our guide to the best VR headset for its overall performance and impressive catalog of games and experiences.\n\nChristmas Trees at Amazon: deals starting at $19.99\n\nSave up to 50% off: Looking to add a new Christmas Tree to your home this year? You can save over 50% on a wide range of best-selling Christmas Trees at Amazon, with prices starting at just $19.99. You'll find different sizes, heights, and styles from well-known brands, plus save on more holiday decor like wreaths, candles, ornaments, and greenery.\n\nLG C3 65-inch OLED TV (2023): was $ 2,499.99 now $1,599.99 at Best Buy\n\nLowest price: You can get the all-new 65-inch LG C3 OLED TV on sale for $1,599.99 at Best Buy. That's a whopping $900 discount and the lowest price we've ever seen. The stunning OLED TV features a brilliant picture with bright colors and powerful contrast thanks to LG's latest Alpha9 Gen6 chip. Plus, you're getting four HDMI 2.1 ports for next-gen consoles, a sleek, thin design, and an updated webOS experience - all for under $2,000, which is a fantastic value for a 2023 OLED display.\n\nBlack Friday deals 2023: TVs\n\nHisense 65-Inch U6K Series mini-LED 4K TV: was $799.99 now $498 at Amazon\n\nIf you're looking for a big-screen budget TV this Black Friday, you aren't going to get much better than this Hisense 65-inch 4K TV on sale for an incredible price of just $498. The U6 Series TVs are Hisense's least expensive models with mini-LED backlighting, plus a QLED display, full-array local dimming, and support for Dolby Vision and HDR10+ high dynamic range. Jump on this deal before it's gone.\n\nSamsung Q80C 85-inch QLED 4K TV: was $2,197 now $1,997 at Amazon\n\nWe described this as offering \"maximum picture quality for your buck\" in our review, which is exactly what you want from a Black Friday TV – and is especially what you want from a huge TV since you'll definitely notice any flaws. This is a bright QLED TV with great contrast, superb 4K detail, and great gaming features. This isn't a new deal for Black Friday – it's been this price for a few weeks – but it's still an excellent buy.\n\nSamsung 75-inch 4K Smart Tizen TV (2022): was $749.99 now $579.99 at Best Buy\n\nThis Samsung Crystal 4K smart TV was a best-seller at last year's Black Friday sale, and Best Buy currently has the 75-inch model on sale for a record-low price of $579.99. This 4K UHD TV packs a solid 'Crystal' UHD 4K processor, an easy-to-use Tizen operating system, and full HDR support - all for under $600, which is an incredible deal.\n\nLG 86-inch UR7800 Series 4K UHD Smart webOS TV: was $1,249.99 now $899.99 at Best Buy\n\nIf you're looking for a massive display in today's Black Friday TV deals, Best Buy has this 86-inch LG UR7800 Series 4K TV on sale for $899.99. You're getting a premium picture thanks to LG's α5 AI processor Gen6, plus webOS 23 for seamless streaming from your favorite apps and compatibility with Alexa and the Google Assistant for hands-free control.\n\nSamsung S90C 65-inch 4K OLED TV: was $2,599 now $1,599.99 at Samsung\n\nOur Samsung S90C review awarded this TV five stars out of five, praising its gorgeous picture and gaming features. Its screen is brighter than other OLED TVs at the same price, and it has great built-in sound, so it's just fantastic value. This is the cheapest price it's ever been (though only by a little).\n\nSony A95K QD-OLED 55-inch 4K TV: was $2,799.99 now $1,699.99 at Best Buy\n\nThis is an absurd deal and offers incredible value for money for PS5 (or Xbox Series X) players or, well, anyone looking for a top-tier 4K TV this winter. This won countless awards and critical acclaim last year and remains one of the best TVs ever made for gaming. If our calculations are correct, this price beats its lowest ever by a whopping $600!\n\nSamsung 75-inch The Frame QLED 4K Smart TV (2022): was $2,999 now $1,899 at Walmart\n\nSamsung's stunning The Frame TV is always a Black Friday best-seller, and Walmart has this 75-inch model on sale for the lowest price of $1,899. The best-selling Samsung Frame TV transforms into a beautiful piece of art to seamlessly blend into your home's decor and includes customizable bezels, a QLED screen, and smart capabilities.\n\nLG C3 65-inch OLED TV (2023): was $ 2,499.99 now $1,599.99 at Best Buy\n\nYou can get the all-new 65-inch LG C3 OLED TV on sale for $1,599.99 at Best Buy. That's a whopping $900 discount and the lowest price we've ever seen. The stunning OLED TV features a brilliant picture with bright colors and powerful contrast thanks to LG's latest Alpha9 Gen6 chip. Plus, you're getting four HDMI 2.1 ports for next-gen consoles, a sleek, thin design, and an updated webOS experience - all for under $2,000, which is a fantastic value for a 2023 OLED display.\n\nTCL 65-inch S4 S-Class 4K UHD HDR LED Smart TV: was $529.99 now $399.99 at Best Buy\n\nAnother big-screen budget display in today's Black Friday deals, Best Buy has the TCL 65-inch 4K smart TV on sale for a stunning price of just $399.99. The TCL S4 Series TV packs 4K Ultra HD Resolution, Dolby Vision, HDR10, DTS Virtual: X, and the Google TV Smart operating system with Chromecast built-in - all for under $500.\n\nAmazon 50-inch 4-Series 4K Smart Fire TV (2021): was $449.99 now $289.99 at Amazon\n\nThe Amazon 4-Series is one of the best-selling TVs on Amazon, and it's now down to a record-low price of $289.99 for Black Friday. You're getting 4K HD resolution, smart capabilities with the Fire operating system, and a voice remote with hands-free Alexa, so you can use your voice to control your TV.\n\nLG A2 48-inch OLED TV: was $1,299.99 now $549.99 at Best Buy\n\nBest Buy has the 48-inch LG A2 OLED TV on sale for a record-low price of $549.99. Named as one of our best OLED TVs and rated four out of five stars in our LG A2 review, it packs an Alpha α7 Gen5 processor that delivers sharp images and great upscaling from HDR, and Dolby Vision HDR support makes the most of movies and TV. LG's smart software is also excellent, and the included Magic remote allows you to navigate your TV seamlessly.\n\nTCL 40-inch FHD smart Fire TV: was $229.99 now $149.99 at Best Buy\n\nIf you're looking for a cheap TV for a small space, you can't get much better than this TCL 40-inch smart TV on sale for an incredible price of just $149.99. While the 40-inch TV lacks 4K resolution, it does come with the Fire operating system, so you can seamlessly stream apps like Netflix, Hulu, and Disney Plus.\n\nAmazon Fire TV 32-inch 2-Series HD smart TV (2023): was $199.99 now $109.99 at Amazon\n\nOur cheapest Black Friday TV deal is this 32-inch Amazon HD Fire TV on sale for a record-low price of just $109.99. While the Amazon 2-Series TV lacks 4K resolution, you're getting smart capabilities with the Fire TV experience and Amazon Alexa on board for hands-free control.\n\nBlack Friday deals 2023: Apple devices\n\nApple AirTag 4 pack: was $99 now $79 at Amazon\n\nThe Apple AirTag is the best-selling gadget on Amazon and rarely gets discounted, but Amazon has the 4-pack on sale for $79 - the lowest price we've seen all year. If you tend to misplace your keys, luggage, or wallet, just attach the AirTag to anything you don't want to want to lose, and your iPhone will locate the item.\n\nApple AirPods (2nd Generation): was $159 now $89.99 at Amazon\n\nIf you're looking to grab today's cheapest AirPods deal, Amazon has the best-selling AirPods 2 on sale for $89.99. That's the best deal you can find right now and fantastic value for a pair of Apple's premium earbuds. This deal is highly recommended if you want new AirPods and don't need noise-canceling technology.\n\nApple Watch SE (2nd Gen, GPS): was $249 now $179 at Amazon\n\nEying up that Apple Watch 9 but don't want to pay a premium? The latest Apple Watch SE is a fantastic choice, and right now, it's at its lowest-ever price at Amazon. Sure, the SE 2 doesn't feature the always-on display or ECG of the Series 8, but it's a superb device that's more than capable of all the essentials. You can check out our Apple Watch SE 2 review for why we awarded this model four and a half stars out of five.\n\nApple iPhones at Verizon: get a free iPad and Apple Watch with an unlimited plan\n\nVerizon's headline Black Friday deal is here, and it's offering a free 10th gen iPad 10.9 and a free 2nd-gen Apple Watch SE. These freebies alone are worth $780 by themselves, so this is a significant addition to the host of already awesome trade-in rebates of up to $1,000 on the iPhone 15 series. The caveat here, however, is that you'll still need an unlimited data plan to be eligible for this saving.\n\nMacBook Air 13-inch (M1): was $999.99 now $749.99 at Amazon\n\nThe 2020 Apple MacBook Air with an M1 chip is a little old now, but it's still one of the best laptops ever made - and Amazon has the laptop on sale for a record-low price of $749.99. Our MacBook Air M1 review awarded the device 4.5 stars out of five, where we particularly praised Apple's premium device for its speed, responsiveness, beautiful design, and long-lasting battery life.\n\nApple 2023 MacBook Air 15 M2 laptop: was $1,299.99 now $1,049 at Amazon\n\nIf you're looking for a powerful MacBook, Amazon has the all-new MacBook Air M2 on sale for $1,049 right now - a match for the lowest price we've ever seen. The 2023 MacBook Air packs a 15.3-inch liquid retina display, Apple's powerful M2 chip, a six-speaker sound system, and 18 hours of battery life. You need to apply a voucher (included on the page) to get the full discount.\n\nBlack Friday deals 2023: under $25\n\nNishel Travel Toiletry Bag: was $29.99 now $18.99 at Amazon\n\nThis Nishel Travel toiletry bag is down to just $18.99 for Black Friday - the lowest-ever price. The space-efficient toiletry bag can hold all your travel essentials and can hang up so you don't have to dig through a bag to find your toiletries.\n\nFullstar Vegetable Chopper: was $39.99 now $23.95 at Amazon\n\nBest-seller: The Fullstar vegetable chopper has over 60,000 positive reviews and was a best-seller at last year's Black Friday sale. You can chop your favorite veggies in a flash with the four interchangeable blades that allow you to julienne, chop, and slice vegetables. Today's Black Friday deal brings the price down to just $23.95.\n\nAmazon Fire TV Stick with Alexa Voice Remote: was $39.99 now $19.99 at Amazon\n\nGet the best-selling Fire TV Stick on sale for just $19.99 at Amazon's Black Friday deals event. The HD streaming player allows you to enjoy tens of thousands of channels, apps, and Alexa skills and features an Alexa voice remote, plus support for Dolby Vision, HDR, HDR10+, and Amazon Alexa for hands-free control.\n\nEcho Dot (5th generation): was $49.99 now $22.99 at Amazon\n\nAmazon's best-selling Echo Dot just dropped to a record-low price in today's Black Friday deals. You can get the 5th generation smart speaker for just $22.99. The Echo Dot offers an improved audio experience, plus a new temperature sensor and all the handy features from Alexa, like playing music, answering questions, and checking the weather completely hands-free.\n\nToys under $25 at Walmart: Lego, Barbie, Star Wars and more\n\nWalmart's Black Friday sale has a large selection of best-selling toys that are all under $25. You can find deals from brands like Lego, Barbie, Star Wars, and Paw Patrol for all ages, plus you can score free two-day shipping on orders over $35.\n\nLifeStraw Personal Water Filter: was $50 now $9.99 at Amazon\n\nLifeStraw's personal water filter has become a breakout star during holiday sales like Black Friday, and Amazon has the nifty device on sale for just $9.99 - the lowest-ever price. Perfect for camping or hikes, the hand-held LifeStraw filters bacteria & parasites to provide clean and safe drinking water.\n\nChamberlain Smart Garage Control: was $29.98 now $24.98 at Amazon\n\nThe handy Chamberlain smart garage control allows you to open and close your garage from anywhere, and the best part? It's on sale for just $24.98. You can also set a schedule to make sure your garage is always closed at night and receive notifications anytime your garage door is opened or closed.\n\nSweese Double Wall Glass Coffee Mugs: was $36.99 now $14.99 at Amazon\n\nFor just $14.99, you can grab these double-wall glass coffee mugs at Amazon's Black Friday sale. The stylish 12.5-ounce insulated coffee mugs are the perfect size to enjoy an espresso or cappuccino and feature a double-wall design to keep your beverage at the desired temperature.\n\nKasa Smart Plug Mini: was $29.99 now $21.99 at Amazon\n\nGrab the handy Alexa-enabled Kasa Smart Plug for a record-low price of $21.99 at Amazon. Great for upcoming holiday decor, the four-pack of smart plugs allows you to add voice control to any outlet, so you can turn on and off lights and appliances completely hands-free or with the compatible Kasa app.\n\nEufy Smart Scale C1: was $29.99 now $23.98 at Amazon\n\nThe top-rated Eufy smart scale is on sale for $23.98 at Amazon right now - the lowest price we've seen. The Eufy Smart Scale C1 can measure your body's body fat ratio, BMI, bone mass, muscle mass, as well as your weight and gives you a more detailed way of checking in with your health and what that number on the scale actually means.\n\nBlack Friday deals 2023: Computing\n\nHP 15.6-inch laptop: was $249.99 now $199.99 at Walmart\n\nLooking for a cheap but capable laptop in today's Black Friday deals? Walmart has this 15.6-inch HP laptop on sale for just $199.99. The 15.6-inch display makes it more portable compared to the larger screen options, but it still offers a reasonable level of performance thanks to the Intel processor, 4GB of RAM, and speedy 128GB SSD.\n\nHP Chromebook X360 14-inch 2-in-1: was $329 now $199 at Walmart\n\nWith an Intel Celeron processor and 4GB DDR4 RAM, this Chromebook isn't going to be setting any records, but it's a great 2-in-1 for young students who'll love the splash of teal color on the outside, while you'll love that it's $40 off at Walmart for Black Friday.\n\nDell Inspiron 15 3511: was $529.99 now $359 at Amazon\n\nA gorgeous 15.6-inch laptop perfect for students and office workers, the Inspiron 15 3511 has the flexibility needed to carry you through whatever work and school can throw at you. A bright 1080p LED display and 11th-gen Intel CPU plus a great selection of ports (including HDMI for connecting a second display) mean you can tackle any task with ease.\n\nAsus TUF 15.6-inch gaming laptop: was $1,399 now $979.99 at Best Buy\n\nThis heavily reduced Asus TUF is easily one of the cheapest laptops we've ever seen to feature the speedy new RTX 4070 graphics card. This GPU, combined with a 12th-gen Intel Core i7 chipset, 16GB of RAM, and a 1TB SSD means this Asus is packing some serious gaming chops under the hood. While it's not at the very cutting edge of components or overall design, you're getting almost unbeatable bang for the buck here with this Asus, thanks to a healthy $300 discount at Best Buy.\n\nDell XPS 15 laptop: was $1,499 now $1,099 at Dell\n\nFor those who need a serious amount of power, consider this fantastic Black Friday deal on the latest Dell XPS 15. This specced-out machine features a 13th gen Intel Core i7 chipset, 16GB of DDR5 RAM, a 512GB SSD, and an Intel Arc A370M graphics card. These specs are definitely overkill for a simple daily driver, but those who want a pro-level machine will find a lot to work with here.\n\nMacBook Air 15-inch (M2): was $1,299 now $1,049 at Amazon\n\nAmazon dropped the latest 15-inch MacBook Air to $1,049 - the lowest price we've ever seen. No surprises - we're huge fans of this model at TechRadar and awarded it four stars out of five during our Apple MacBook Air 15-inch (2023) review. While it is essentially just an upscaled version of the 13-inch machine, that's by no means a bad thing when you consider the outstanding M2 processor inside. If you can make use of the bigger 15-inch display, this deal is absolutely recommended.\n\nDell SE2422H 24-inch FHD monitor: was $149.99 now $79.99 at Dell\n\nThis 24-inch full HD monitor from Dell might not be the best for gaming or content creation, but for under $80, this is perfect for those who just need a good monitor for basic computing work and don't want to spend a lot of money.\n\nAcer Nitro 27-inch gaming monitor: was $259 now $145 at Walmart\n\nIf you're looking to upgrade your monitor to 1440p on a budget, this Acer Nitro is a great choice. It's a VA panel, but it's one of the cheapest 27-inch monitors we've seen to feature 1440p. It's also rapid, supporting a 170Hz refresh rate and 1MS response time - perfect for those intensive gaming sessions.\n\nLG 27-inch IPS LED 4K UHD Monitor with HDR: was $349.99 now $199.99 at Best Buy\n\nThis 27-inch 4K monitor with HDR from Best Buy is one of the cheapest we've seen in a long while thanks to this $150 saving.\n\nBlack Friday deals 2023: Smart home\n\nChamberlain Smart Garage Control: was $29.98 now $24.98 at Amazon\n\nThe handy Chamberlain smart garage control allows you to open and close your garage from anywhere, and the best part? It's on sale for just $24.98. You can also set a schedule to make sure your garage is always closed at night and receive notifications anytime your garage door is opened or closed.\n\nAmazon Fire TV Stick with Alexa Voice Remote: was $39.99 now $19.99 at Amazon\n\nGet Amazon's best-selling Fire TV Stick on sale for a record-low price of $19.99 at Amazon's Black Friday deals event. The HD streaming player allows you to enjoy tens of thousands of channels, apps, and Alexa skills and features an Alexa voice remote, plus support for Dolby Vision, HDR, HDR10+, and Amazon Alexa for hands-free control.\n\nAll-new Fire TV Stick 4K Max: was $59.99 now $39.99 at Amazon\n\nThis is the lowest price we've seen for Amazon's premium streaming device for Black Friday. The Fire TV Stick 4K Max streams the same content in the same quality as the standard 4K version, but the extra power inside means faster performance when navigating apps. Plus, it uses WiFi 6E technology to give you a more stable and consistent streaming experience.\n\nAll-new Echo Show 5 (2023): was $89.99 now $39.99 at Amazon\n\nYou can get the all-new Echo Show 5 on sale for $39.99 - that's a massive 56% discount and a new record-low price. The 2023 Echo Show 5 features a compact 5.5-inch display but packs impressive sound with deeper bass and clearer vocals, so you can listen to podcasts, movies, music, and more with the help of Amazon Alexa.\n\nEcho Dot (5th generation): was $49.99 now $22.99 at Amazon\n\nAmazon's best-selling Echo Dot is down to its lowest price ever in today's Black Friday deals. Amazon's latest model Echo Dot offers an improved audio experience, plus a new temperature sensor and all the handy features from Alexa, like playing music, answering questions, and checking the weather completely hands-free.\n\nAmazon Echo (4th Gen): was $99.99 $54.99 at Amazon\n\nThe Amazon Echo is a more robust smart speaker, and today's Black Friday deal brings the price down to $54.99 - just $5 more than the record-low we saw during Black Friday. The powerful speaker delivers rich sound that adapts to any room and works with Amazon Alexa to become a smart home hub.\n\nBlack Friday deals 2023: gaming\n\nPS5 Slim + Call of Duty Modern Warfare 3: $499 at Best Buy\n\nThis is another chance to get your hands on the newest model of PS5, this time bundled with a copy of the very latest Call of Duty, the brand new Modern Warfare 3. Like other bundles this year, we expect this to sell out fairly quickly.\n\nNintendo Switch Console - Mario Kart 8 Deluxe Bundle: $299.99 at Walmart\n\nThis superb Nintendo Switch bundle packs the console, a copy of Mario Kart 8 Deluxe, and 3 months subscription to the Nintendo Switch Online service. It's become increasingly common to see this bundle over key sales periods, and it's reliably in stock at multiple retailers. Price check: GameStop - $299.99 | Amazon - $299\n\nXbox Series S Starter Bundle: was $299.99 now $234.99 at Dell\n\nThe Xbox Series S Starter Bundle is being discounted across the internet, but not to the same degree as this excellent saving hosted by Dell. With it, you'll get the console and 3 months of Xbox Game Pass Ultimate for even less. Price check: Walmart - $249\n\nXbox Series X Diablo 4 Bundle + 3 months of Xbox Game Pass Ultimate: $484.98 at Microsoft\n\nThis bundle offers a fantastic way to secure one of the most popular Xbox Series X games for less. Not only are you getting an included copy of Diablo 4, but also 3 months' worth of Xbox Game Pass Ultimate subscription time.\n\nCrucial P3 Plus 2TB NVMe M.2 SSD: was $189.99 now $98.99 at Amazon\n\nIt doesn't get much cheaper than this when it comes to M.2 SSDs with a huge 2TB of storage. While certainly not the fastest storage drive on the market, PS5 owners who want to store and run a ton of games without needing to delete older ones as much will be well-served here. Especially now that it's under $100. Price check: Best Buy - $98.99 | Newegg - $98.99\n\nBlack Friday deals 2023: Phones\n\niPhone 14: was $729.99 now $679.99 at Best Buy\n\nBest Buy has knocked a record-high $50 off the price of Apple's standard iPhone 14 for Black Friday. If you're simply looking for a capable iPhone at a cut price, then the iPhone 13 (which is now discounted at Apple) is pretty much the same phone as the iPhone 14 but cheaper. That said, Best Buy's device-only price is a good one, so if you're already sold on the iPhone 14, this is the deal to go for.\n\nApple iPhone 15 series: get a free iPad and Apple Watch with an unlimited plan at Verizon\n\nVerizon's headline pre-Black Friday deal is here, and it's offering a free 10th-gen iPad 10.9 and a free 2nd-gen Apple Watch SE. These freebies alone are worth $780 by themselves, so this is a significant addition to the host of already awesome trade-in rebates on the iPhone 15 series. The caveat here, however, is that you'll still need an unlimited data plan to be eligible for this saving.\n\nApple iPhone 15 Pro: up to $1,000 off with a trade-in, plus free iPad and Apple Watch at Verizon\n\nThis is our favorite trade-in rebate available right now on Verizon. While the maximum saving of $1,000 off is nothing new on the excellent iPhone 15 Pro, Verizon is letting you hand over any iPhone model to achieve that maximum rebate. That means you can potentially hand over an old beater and get a new Phone 15 Pro in return - plus the free Apple Watch and iPad. Note, this promo is only eligible with a new line on an unlimited data plan (upgraders can get up to $830 off).\n\nApple iPhone 14 Plus: get four devices with an unlimited data plan for $120 per month at Verizon\n\nVerizon's latest promotion offers four iPhone 14 Plus handsets for just $40 each - and that's with a line on an unlimited data plan. Yes, the bundled plan is the carrier's more basic 'Unlimited Welcome' tier, but this is still an amazing offer. Previously, an iPhone 14 Plus bundled with a single line would have cost close to $100 by itself, so you get some incredible savings here.\n\nSamsung Galaxy S23 Ultra: was $1,199.99 now $899.99 at Amazon\n\nWinner of TechRadar's reader's choice awards for 2023, the Samsung Galaxy S23 Ultra is a fantastic pick if you're on the hunt for a flagship device with heaps of power, a gorgeous display, and class-leading cameras. It's currently on sale for a record-low price at Amazon, though if you're in the latter region and have an existing Samsung device to trade in, Samsung's discount-plus-rebate offer may be the better option.\n\nBlack Friday deals 2023: headphones\n\nBeats Studio Buds: was $149.95 now $89.95 at Amazon\n\nThe Beats Studio Buds are the best Beats earbuds you can buy, and Amazon now has the earbuds down to $99.95 – just $10 more than the record-low price. You're getting Active Noise Cancelling technology, a comfortable fit, and decent audio performance. Compared to Apple's AirPods Pro 2 (which are regularly priced at $234), this deal is a great alternative for premium earbuds under $100.\n\nBeats Studio Pro: was $349 now $169.99 at Amazon\n\nThis massive saving makes Beats' newest, July 2023 over-ears a whopping 51% cheaper than they were at launch – a return to their lowest-seen price during Amazon's Prime Day event. They're gorgeous looking, easy to use and the sound is good, (read about it in our Beats Studio Pro review) so if the lack of multipoint and wearer detection doesn't bother you, this is a solid deal.\n\nBose QuietComfort Earbuds II: was $299 now $199 at Amazon\n\nIf you want the best noise-blocking power, you can get for the price, these deliver it. They also sound superb and have a ton of useful smart features. But the headline is the noise cancellation, and you can't get better for under $200. Actually, you basically can't get better, period. Oh, and this is the cheapest they've ever been – we'd be surprised if they go any lower.\n\nBlack Friday deals 2023: Mattresses\n\nNectar Serenity weighted blanket: was $149 now from $63 at Nectar\n\nCozy and soothing, the Nectar Serenity weighted blanket contains pockets full of glass beads that apply gentle pressure across the body. Right now, you can save up to an extra 6% on a Nectar Serenity weighted blanket with our exclusive link. That's a standard 15lb blanket for a very calming $63.\n\nSaatva Classic mattress: was $1,095 now from $695 at Saatva\n\nExclusive: The Saatva Classic is a luxurious innerspring hybrid mattress that's available in three different sleep feels and two sizes, and it sits in the #1 spot of our best mattress ranking. Our testers found it was comfortable in all sleeping positions, and well-suited to hot sleepers and people with back pain. The extras are great too: you get a 365-night trial and lifetime warranty. Click any of the links on this page to unlock an exclusive $400 discount, which means a queen size is currently $1,595.\n\nNectar Memory Foam mattress: now from $359 at Nectar\n\nThe Nectar is a great all-rounder memory foam mattress that will suit plenty of tastes and sleep styles. Right now there's a flash sale that knocks 40% off everything, which takes the price of a queen down to $659. Our reviewers found this mattress delivered good pressure relief and motion isolation, making it a good choice for anyone with achy joints, or who shares a bed with a partner. It comes with a lifetime warranty and a year's risk-free trial, so you'll have plenty of time to make sure it suits you.\n\nHelix Midnight mattress: was $936 now from $702, plus additional free bedding at Helix\n\nThe Helix Midnight is a softer memory foam hybrid. We think it's the best mattresses for side sleepers because the plush foams contour to the sleeper's joints, allowing the lower hip and shoulder to sink in just enough to prevent pressure from building up and ensuring neutral spinal alignment. Right now, there's 25% off all sizes, with a free bedding bundle, including pillows, sheets, and a protector, thrown in for free. That drops the cost of a queen size down to $999.\n\nTempur-Adapt mattress: was $1,699 now from $1,499 at Tempur-Pedic\n\nThe Tempur-Adapt mattress is specialized for contouring comfort, and you can choose from three different sleep feels (soft, medium or firm), or upgrade to a hybrid with springs if you prefer. Tempur-Pedic is known for its high-end, sink-in foams, and the current 30% off deal delivers the best prices we ever see.\n\nThe Casper mattress: was $595 now from $476 at Casper\n\nCasper sales don't come along very often, but for Cyber Monday it's taking 20% off all mattresses (as well as pillows and sheets). This includes its brand new The Casper all-foam mattress, which was already an affordable option and is now even more so. With 20% off, the queen size is reduced to an extremely reasonable $796, with free delivery, a 100-night trial, and a 10-year warranty.\n\nBlack Friday deals 2023: Streaming\n\nMax: $9.99 $2.99 a month for first 6 months\n\nGet Max's Ad-Supported plan and pay just $2.99 a month for your first six months (down from $9.99 a month). This gets you access to Max originals like House of the Dragon and And Just Like That, as well as movies including Barbie, the complete Harry Potter collection, and a whole host of reality TV from Discovery's catalog, too.\n\nPeacock: $5.99 $1.99 a month for 12 months\n\nWhile not as low as 2022's $0.99 deal, the Black Friday Peacock deal is still an excellent saving for those who want to sample the NBC platforms catalog of content for up to 12 months. You can get your reality TV fix with a ton of Bravo content, as well as Below Deck and Love Island Games. It also has amazing Peacock Originals including Poker Face, Bel-Air, Wolf Like Me, and great movies including new releases, too.\n\nParamount Plus: pay from $1.99 a month for first 3 months\n\nSave 67% on your Paramount Plus subscription in this amazing Black Friday streaming deal. Previously, Paramount Plus offered a Black Friday offer on its annual plans, but this one allows you the flexibility of its monthly plans. Pay $1.99 for your first three on its Essential plan (usually $5.99 a month), which is ad-supported, or reap the benefits of both Paramount Plus and Showtime's libraries and lock in a price of just $3.99 a month, down from $11.99.\n\nAmazon Prime Video: Up to 75% off Amazon Channels\n\nFrom Paramount Plus to AMC Plus, STARZ, Britbox, Cinemax, and more, you can upgrade your Amazon Prime Video subscription this Black Friday and get up to 75% in savings on your first two months on a variety of add-ons. A great way to sample another service's library, the promotion also includes PBS Masterpiece, AcornTV, and channels for kids like Noggin' and PBS Kids.\n\nPhilo: Save 50% on first month | $25 $12.50 a month\n\nWith 70+ channels, for many this is a great choice for those who want to finally cut the cable cord. No contracts, Philo hosts a ton of live TV channels in the States, including Comedy Central, AMC, Lifetime, Food Network, TLC, VH1, and more. Already uber affordable at $25 a month, in this Black Friday streaming deal you can pay just $12.50 for your first month with 50% off. Offer ends November 28\n\nBlack Friday deals 2023: Appliances\n\nBella Pro Series 4.2-qt. Air Fryer: was $59.99 now $29.99 at Best Buy\n\nNot on the air fryer craze yet? This cheap and cheerful one at Best Buy will give you the chance to try out the cooking revelation for just $29.99 - the lowest-ever price. The timer is simple to set, the capacity is large enough to cook meals for four to six people, and dishwasher-safe components mean it's easy to clean for reuse time and time again.\n\nNinja 12-in-1 Smart Double Oven: was $349.99 now $249.99 at Ninja\n\nGetting a lofty 4.5 out of 5 rating in our review, this premium air fryer oven may be on the pricey side. However, it's more than worth it considering it has two separate ovens that will let you knock off two dishes off your list at once. This will save you a whole lot of cooking time for that holiday dinner. Right now, it's $100 off at the Ninja online store.\n\nKeurig K-Classic Single-serve Coffee Maker: was $149.99 now $89.99 at Amazon\n\nThis Keurig coffee maker can turn compatible coffee pods into barista-style drinks. This is one of the simpler Keurig options, and it can only produce single-serve drinks, but if you're just after a coffee machine for yourself, then it might be all you need. Today's Black Friday deal is a record-low price.\n\nKeurig K-Mini single-serve pod coffee machine: was $99 now $49.99 at Amazon\n\nThis Keurig K-Mini is a great choice for those working with a small space thanks to its compact size and Amazon has the coffee maker on sale for just $49.99. The coffee maker can brew a cup in just minutes and is less than five inches wide, so it's an easy fit for even the most cramped of kitchens.\n\nKeurig K-Duo Essentials: was $99.99 now $79 at Walmart\n\nThis coffee machine can brew a large carafe using ground beans or single cups using K-Cup coffee pods. It's a best-of-both-worlds coffee maker, and Walmart's Black Friday sale has the Keurig down to $79.99 - the best deal you can find.\n\nNespresso VertuoPlus coffee machine: was $199 now $139.30 at Amazon\n\nFor a pod coffee machine, we highly recommend the VertuoPlus from Nespresso. It's one of the best coffee makers you can buy, and this specific model includes a handy milk frother, so you can enjoy a cup of premium, creamy coffee without leaving your home. Today's Black Friday deal from Amazon brings the price down to $139.30 - the lowest price we've seen this year.\n\nNinja SS101 Foodi Smoothie Maker: was $119.99 now $79.99 at Amazon\n\nWorking out is not enough. Eating healthier plays a big part in making your wellness journey a success as well, which means cutting back on processed foods and consuming more fruits and veggies. Luckily, this blender from Ninja lets you do just that, and if you're not a fan of vegetables, this will let you whip them up into delicious smoothies in no time. Right now, it's 33% off as a Black Friday wellness treat.\n\nNutriBullet Juicer Pro Centrifugal Juicer Machine: was $159.99 now $99.95 at Amazon\n\nThe dual-size food pusher lets you choose between wide and narrow feed chutes to accommodate fruit and veggies of different sizes, and three precision speeds help you get the most out of every ingredient - From soft berries and kiwis to pineapples and cucumbers to hard carrots and beets.\n\nGE Profile Opal 2.0 Countertop Nugget Ice Maker: was $649.99 now $499 at Best Buy\n\nThe GE nugget ice maker is on my Christmas wish list this year, and Best Buy might make my dreams come true with this Black Friday deal that brings the price down to a record low of $499. The countertop ice maker makes chewable, crunchable ice and features built-in wifi and voice control.\n\nBlack Friday deals 2023: Vacuums\n\nBissell Little Green Portable Carpet Cleaner: was $123.34 now $78 at Walmart\n\nBissell carpet cleaners have become all the rage lately, and Walmart's Black Friday deals include the top-rated Little Green model on sale for $78 – a new record-low price. Perfect for pet owners and parents, the portable carpet cleaner can magically erase spills and stains on carpets, couches, auto interiors, and more.\n\nBissell CleanView Swivel Vacuum Cleaner: was $175 now $119 at Amazon\n\nThe Bissell CleanView Swivel vacuum features powerful suction that features a triple action brush roll to seamlessly pick up pet hair. The lightweight vacuum also includes a quick-release extension wand and a pet turbo eraser tool for quick and convenient pick-ups and has an automatic cord rewind. Today's Black Friday deal brings the price down to $119 - a new record-low price.\n\nShark ION Robot Vacuum: was $249 now $129 at Walmart\n\nThis is probably the best price for a robot vacuum that you'll find at Walmart's Black Friday sale. And, as a bonus, this is also a record-low price of $129. The Shark ION robot vacuum works on carpets and hardwood floors and works with Amazon Alexa and Google Assistant for hands-free control.\n\niRobot Roomba 694 Robot Vacuum: was $364.99 now $159 at Amazon\n\nAmazon has the top-rated iRobot Roomba 694 robot vacuum on sale for $159 - the lowest price we've ever seen. Designed with homes with pets in mind, the Roomba 694 delivers powerful suction and includes a high-efficiency filter that traps mold, pollen, and dust mites along with dust, dirt, pet hair, and other large debris.\n\nShark Cordless Pro stick vacuum: was $399 now $198 at Walmart\n\nIt's typically a pricey buy, but we'd rank the Cordless Pro among the best shark vacuums money can buy right now, especially with this discount. Not only is it peerlessly powerful (for a cordless), but its clever clean Sense IQ automatically adjusts suction power depending on how dirty the surface area is. Its odor neutralizer is surprisingly handy, and the brush roll is exceptionally good for picking up those pet hairs.\n\neufy Clean L50 SES robot vacuum: was $499 now $198 at Walmart\n\nThis Eufy Clean L50 specifically features a huge docking station for two months of hands-free cleaning, an advanced LiDAR sensor, and an automatic surface sensor that adjusts power depending on need. Overall, it's not one of the basic models, but it's much, much easier on the pocket since it's on sale for a record-low price of $198 for Black Friday.", "images": ["https://cdn.mos.cms.futurecdn.net/dgYtefDJyyYEbBsUcJLPKj-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/AQ6ByxgJAPXapdjLtJXNFo-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/uPgDEDvukvRa24fBXEExFB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/ebW8vLEoF2XCWBeEgraEKi-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/mRchGBaGjxWoYwvfriH6yW-200-100.png", "https://cdn.mos.cms.futurecdn.net/7vscNmtwDHPEVuNLKFHnjR-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/NNv5cZeCcmKw8Xs5dDnLnk-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/eDNZ8VnZovjtCRnkXYiHwg-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/tsFDCcQd35Zqp6xqsogGGN-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/Fx9VWC9yTmPd9fUaX7UrFE-200-100.png", "https://cdn.mos.cms.futurecdn.net/W7vRQYkYKfmBjFHik2n6KK-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/4YHuSSdmVKR6uUZczwTZ6E.jpeg", "https://cdn.mos.cms.futurecdn.net/GdvJf73cjBG8MpAed4Af2E-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/XV2qwshqon6i5at684tU5K-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/Pr6adx9nUkLPhXmF2swhfK-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/5RktbEBk64m3iSxHa9fwmg-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/HH3h6HQs8U4tcPUeuwoJAN-200-100.png", "https://vanilla.futurecdn.net/techradar/media/shared/img/flags/nosize/US.svg", "https://cdn.mos.cms.futurecdn.net/kMwFp4mDFoi4qYxGLPNPz-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/hMN86djqKRs7GpZmko72MR-200-100.jpeg", "https://cdn.mos.cms.futurecdn.net/pFbV4arhd2U4GtJ5285qUB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/wznv6tzQ2rRsgvHFvpDUh3-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/9N8hcTRVSh6tfRcNBGDVKi-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/cDJtLJQXchX2dfPhkouxBM-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/ttamT25wZ3hKTKf2uTfgM9-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/mzEQqfckMwpSckdFjUEnsC-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/zkamTkMjS4RAHE8qwhux8Q-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/HyE9JR2fNZAykRZtr4qMZH-200-100.png", "https://cdn.mos.cms.futurecdn.net/JWXdqVxWwMDiwGGp2fuong-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/DC2drMJRebcH453V7Q5oti-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/bhyqudLBfMw7KeCkdxjRBL-200-100.png", "https://cdn.mos.cms.futurecdn.net/hjLMiHM26peGHMNorm4EqB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/zxio3rBJuibegJURmqrVfD-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/XedX7TygZdk36FaDuFKL8G-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/pvfCiY6XTziYUJqQZBSwfU-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/G26HXuJoJEkgoVqcPx9QuL-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/pYAdNXerinLdHtkE8afspi-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/2vz7VcrJ4Tu8LDNx6qHVwY-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/jYCjRd6qrWZpiydhhzw4ZB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/q42VVqbVvBJaBuqzrcunH3-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/LvEZhk7TjW2kppRqzVy9fg-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/MGh6ANRGFwU7FbvMhNxJuC-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/aqPpVQ8QBhGJ3nRvtcF2k-200-100.png", "https://cdn.mos.cms.futurecdn.net/KoZpmmMpoTPcUfSVMZbTvA-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/MR9wKk8dKFNWVfAaayRgEV-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/2GQpdGwPuemYF76AApJFmZ-200-100.jpg", "https://vanilla.futurecdn.net/cyclingnews/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/LYfuTWCvtzEFWyn9q65N9W-200-100.png", "https://cdn.mos.cms.futurecdn.net/AyWTppBHXyfdUZn5kxPTfS-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/VLRfn8Hs2eVPTWNjbiENJi-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/NfhYP9jDugtvMfkY3ZBiMb-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/eo39rRgMgonMYXCnRuRzSN-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/KFaWK4hFaM3PKcuddRnQni-200-100.png", "https://cdn.mos.cms.futurecdn.net/s8LRs7EnuzMcQcQY52oBrE-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/L2ASkRjfgVMNDTs7bsm3KL-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/EVy3U4Kt7uWCBpa8AHFLEY-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/kVRkjhVvysLiTZQUAuoKaE-200-100.jpeg", "https://cdn.mos.cms.futurecdn.net/aUFXZcEkGhHGovPQ2BsL-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/BqSVSsoyudwAzxcETVzRXR-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/kRaEFgCwHg5VA4TdMo5Lxg-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/aWgnr4mRAkMpZXLK9rSonn-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/x8HseL2vzfyFawkriH7tLn-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/GcV39yqLSAy6mMcR5P2x68-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/SJcQKqJFn9CjHnuwvFhddE-320-80.jpg", "https://cdn.mos.cms.futurecdn.net/DQDAuXQaE7cPMUeY7UgxfQ-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/cQYsqFFfqodk7boE8AHRgV-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/hE8VfNeEyuQACFSFbpNUv8-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/rNxbNdAvXqiGtzVUgyXpEX-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/NzfNSiCxLz667co8zo7a2S-200-100.png", "https://cdn.mos.cms.futurecdn.net/zUGAprWY9vjYBXfEEY7JRA-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/k9iauNPKCmZo2rGqgFnYM3-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/eBdrDiDZ4znftJeG973Z26-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/j4nfAm7jjBqMpimjRvF9HS-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/YjLD9D5B5hKMjGkUcVJHLn-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/692vEoLpdZ9kaWC6qXTYAA-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/AXnM6pJDBagVN7bu4UE8uA-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/Xii6QEzKTbEFxCVxiLHkDQ-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/Pd9RMB4V76xKHmvK6zJdj5-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/MFZiYVgtXBfwTamFgi3goP-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/gLtxY98sbBREUXyVTzy5cB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/9HXgFXZyceUVHDYz2c68BB-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/bY6DbWPYjQCVHi5tjovNyJ-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/t2gm3EmRqfAUC7yu7gAWM3-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/KLZh8kBFizYrfYbxN8f5VE-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/4wRnui3KC2F6JoTfyCMCNG-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/8S5teQsK9rfXfcboQ9YMbQ-1200-80.jpeg", "https://cdn.mos.cms.futurecdn.net/9rqtemtVgxHe3sjaAwm4sL-200-100.jpg", "https://vanilla.futurecdn.net/techradar/media/img/missing-image.svg", "https://cdn.mos.cms.futurecdn.net/RSeAMPboD76u2Q7gF79fuP-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/Ey5JgMSbvHfAUhW9pubff6-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/qDLRbHGRpCy4Xsy9KdF6LN-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/eipvd6nnHNjvDu3qVJdzmM-200-100.jpg", "https://cdn.mos.cms.futurecdn.net/RnWjdX7WJ8vnsYS4WbyxdX-200-100.png"], "top_img": "https://cdn.mos.cms.futurecdn.net/8S5teQsK9rfXfcboQ9YMbQ-1200-80.jpeg", "keywords": [], "authors": ["Mackenzie Frazier", "Social Links Navigation"], "canonical_link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "title": "Best Black Friday deals 2023: extended sales from Amazon, Walmart, and Best Buy", "meta_data": {"viewport": "width=device-width,minimum-scale=1,initial-scale=1", "pub_date": "2022-10-31T15:38:59+00:00", "description": "Black Friday deals have been extended, and I'm rounding up all the top sales still available from Amazon, Walmart, and Best Buy.", "robots": "max-image-preview:large", "msapplication-TileColor": "#000000", "msapplication-TileImage": "https://vanilla.futurecdn.net/techradar/823894/apple-touch-icon.png", "og": {"site_name": "TechRadar", "image": {"identifier": "https://cdn.mos.cms.futurecdn.net/8S5teQsK9rfXfcboQ9YMbQ-1200-80.jpeg", "width": 1200}, "type": "article", "title": "Best Black Friday deals 2023: extended sales from Amazon, Walmart, and Best Buy", "url": "https://www.techradar.com/black-friday/black-friday-deals-sales", "description": "Black Friday deals are still available - see today's top offers"}, "article": {"publisher": "https://www.facebook.com/TechRadar", "published_time": "2022-10-31T15:38:59Z", "modified_time": "2023-11-28T16:39:11Z"}, "parsely-type": "post", "parsely-post-id": "A6Z7AwX8Mv95rqJVoZah9o", "parsely-pub-date": "2022-10-31T15:38:59Z", "parsely-title": "Best Black Friday deals 2023: extended sales from Amazon, Walmart, and Best Buy", "parsely-link": "https://www.techradar.com/black-friday/black-friday-deals-sales", "parsely-image-url": "https://cdn.mos.cms.futurecdn.net/8S5teQsK9rfXfcboQ9YMbQ.jpeg", "parsely-section": "Seasonal Sales", "parsely-tags": "Category: Seasonal Sales,Category: Other,Category: Deals,holiday,Black Friday,deals,black friday deals,Black Friday sales,Black Friday 2023,techdeals,blackfridayhub,deals,van_sticky_side_nav,van-black-friday-breadcrumbs,_van_ads_none,van-block-taboola,no-recommended,type_deal,van-disable-inbody-ads,van-disable-sidebar,disable-auto-tag-links,channel_other,serversidehawk", "parsely-author": "Mackenzie Frazier", "fb": {"app_id": 235441786508054}, "twitter": {"card": "summary_large_image", "site": "@TechRadar", "title": "Best Black Friday deals 2023: extended sales from Amazon, Walmart, and Best Buy", "description": "Black Friday deals are still available - see today's top offers", "creator": "@TechRadar", "image": "https://cdn.mos.cms.futurecdn.net/8S5teQsK9rfXfcboQ9YMbQ-1200-80.jpeg", "account_id": 15560223}, "google-site-verification": "jEzBNX-r47v-rgc86g7xG47qMqF4VJuXdLUueTx8saU", "p": {"domain_verify": "10329f1fd4d0a2cd5c0d3b3b809cb4cd"}, "OMG-Verify-V1": "1036697-2d2c9025-5430-4e79-8349-e8c1c926dd73", "taboola": {"url": "https://www.techradar.com/black-friday/black-friday-deals-sales"}, "botify-site-verification": "xkNFqB6l1qBl8BEqMjQvrHuYinhxlJVe", "msvalidate.01": "CC462E6DF91492086145CA5EBDCB615E", "theme-color": "#090E21", "lomadee-verification": 22816996}, "movies": [], "publish_date": 1667230739.0, "source": "https://www.techradar.com", "summary": ""}