{"url": "https://www.grammy.com/grammys/news/2018-latin-grammy-awards-complete-winners-list", "text": "In the world of hip-hop, fashion is more than just clothing. It's a powerful means of self-expression, a cultural statement, and a reflection of the ever-evolving nature of the culture. Since its origin in 1973, hip-hop has been synonymous with style — but the epochal music category known for breakbeats and lyrical flex also elevated, impacted, and revolutionized global fashion in a way no other genre ever has. Real hip-hop heads know this. Before Cardi B was gracing the Met Gala in Mugler and award show red carpets in custom Schiaparelli, Dapper Dan was disassembling garment bags in his Harlem studio in the 1980s, tailoring legendary looks for rappers that would appear on famous album cover art. Crescendo moments like Kendrick Lamar’s performance at the Louis Vuitton Men’s Spring-Summer 2023 runway show in Paris in June 2022 didn’t happen without a storied trajectory toward the runway. Big fashion moments in hip-hop have always captured the camera flash, but finding space to tell the bigger story of hip-hop’s connection and influence on fashion has not been without struggle. Journalist and author Sowmya Krishnamurphy said plenty of publishers passed on her anthology on the subject, Fashion Killa: How Hip-Hop Revolutionized High Fashion, and \"the idea of hip hop fashion warranting 80,000 words.\" \"They didn't think it was big enough or culturally important,\" Krishnamurphy tells GRAMMY.com, \"and of course, when I tell people that usually, the reaction is they're shocked.\"\n\nYet, at the 50 year anniversary, sands continue to shift swiftly. Last year exhibitions like the Fashion Institute of Technology’s Fresh, Fly, and Fabulous: Fifty Years of Hip-Hop Style popped up alongside notable publishing releases including journalist Vikki Tobak’s, Ice Cold. A Hip-Hop Jewelry Story. Tabak’s second published release covering hip-hop’s influence on style, following her 2018 title, Contact High: A Visual History of Hip-Hop. \"I wanted to go deeper into the history,\" Krishnamurphy continues. \"The psychology, the sociology, all of these important factors that played a role in the rise of hip-hop and the rise of hip-hop fashion\" What do the next 50 years look like? \"I would love to see a hip-hop brand, whether it be from an artist, a designer, creative director, somebody from the hip-hop space, become that next great American heritage brand,\" said Krishnamurphy.\n\nIn order to look forward we have to look back. In celebration of hip-hop’s 50 year legacy, GRAMMY.com examines iconic moments that have defined and inspired generations. From Tupac walking the runways at Versace to Gucci's inception-esque knockoff of Dapper Dan, these moments in hip-hop fashion showcase how artists have used clothing, jewelry, accessories, and personal style to shape the culture and leave an indelible mark on the world.\n\nDapper Dan and Logomania: Luxury + High Fashion Streetwear Dapper Dan, the legendary designer known as \"the king of knock-offs,\" played a pivotal role in transforming luxury fashion into a symbol of empowerment and resistance for hip-hop stars, hustlers, and athletes starting in the 1980s. His Harlem boutique, famously open 24 hours a day, became a hub where high fashion collided with the grit of the streets. Dapper Dan's customized, tailored outfits, crafted from deconstructed and transformed luxury items, often came with significantly higher price tags compared to ready-to-wear luxury fashion. A friend and favorite of artists like LL Cool J and Notorious B.I.G., Dapper Dan created iconic one-of-a-kind looks seen on artists like Eric B and Rakim’s on the cover of their Paid in Full album. This fusion, marked by custom pieces emblazoned with designer logos, continues to influence hip-hop high fashion streetwear. His story — which began with endless raids by luxury houses like Fendi, who claimed copyright infringement — would come full circle with brands like Gucci later paying homage to his legacy.\n\nAthleisure Takes Over Hip-hop's intersection with sportswear gave rise to the \"athleisure\" trend in the 1980s and '90s, making tracksuits, sweatshirts, and sneakers everyday attire. This transformation was propelled by iconic figures such as Run-D.M.C. and their association with Adidas, as seen in photoshoots and music videos for tracks like \"My Adidas.\"\n\nLL Cool J’s Kangol hat The Kangol hat holds a prominent place in hip-hop fashion, often associated with the genre's early days in the '80s and '90s. This popular headwear became a symbol of casual coolness, popularized by hip-hop pioneers like LL Cool J and Run-D.M.C. The simple, round shape and the Kangaroo logo on the front became instantly recognizable, making the Kangol an essential accessory that was synonymous with a laid-back, streetwise style.\n\nN.W.A & sports team representation Hip-hop, and notably N.W.A., played a significant role in popularizing sports team representation in fashion. The Los Angeles Raiders' gear became synonymous with West Coast hip-hop thanks to its association with the group's members Dr. Dre, Eazy-E, and Ice Cube, as well as MC Ren.\n\nSlick Rick’s rings & gold chains Slick Rick \"The Ruler\" has made a lasting impact on hip-hop jewelry and fashion with his kingly display of jewelry and wealth. His trendsetting signature look — a fistful of gold rings and a neck heavily layered with an array of opulent chains — exuded a sense of grandeur and self-confidence. Slick Rick's bold and flamboyant approach to jewelry and fashion remains a defining element of hip-hop's sartorial history, well documented in Tobak's Ice Cold.\n\nTupac walks the Versace runway show Tupac Shakur's runway appearance at the 1996 Versace runway show was a remarkable and unexpected moment in fashion history. The show was part of Milan Fashion Week, and Versace was known for pushing boundaries and embracing popular culture in their designs. In Fashion Killa, Krishnamurpy documents Shakur's introduction to Gianni Versace and his participation in the 1996 Milan runway show, where he walked arm-in-arm with Kadida Jones.\n\nWomen embrace oversized styles Oversized styles during the 1990s were not limited to menswear; many women in hip-hop during this time adopted a \"tomboy\" aesthetic. This trend was exemplified by artists like Aaliyah’s predilection for crop tops paired with oversized pants and outerwear (and iconic outfits like her well-remembered Tommy Hilfiger look.)\n\nMany other female artists donned oversized, menswear-inspired looks, including TLC and their known love for matching outfits featuring baggy overalls, denim, and peeking boxer shorts and Missy Elliott's famous \"trash bag\" suit worn in her 1997 music video for \"The Rain.\" Speaking to Elle Magazine two decades after the original video release Elliot told the magazine that it was a powerful symbol that helped mask her shyness, \"I loved the idea of feeling like a hip hop Michelin woman.\"\n\n\"Diddy\" launches Sean John Sean \"Diddy\" Combs’ launch of Sean John in 1998 was about more than just clothing. Following the success of other successful sportswear brands by music industry legends like Russell Simmons’ Phat Farm, Sean John further represented a lifestyle and a cultural movement. Inspired by his own fashion sensibilities, Diddy wanted to create elevated clothing that reflected the style and swagger of hip-hop. From tailored suits to sportswear, the brand was known for its bold designs and signature logo, and shared space with other successful brands like Jay-Z’s Rocawear and model Kimora Lee Simmons' brand Baby Phat.\n\nLil’ Kim steals the show Lil' Kim’s daring and iconic styles found a kindred home at Versace with In 1999, Lil' Kim made waves at the MTV Video Music Awards with her unforgettable appearance in a lavender jumpsuit designed by Donatella Versace. This iconic moment solidified her close relationship with the fashion designer, and their collaboration played a pivotal role in reshaping the landscape of hip-hop fashion, pushing boundaries and embracing bold, daring styles predating other newsworthy moments like J.Lo’s 2000 appearance in \"The Dress\" at the GRAMMY Awards.\n\nLil Wayne popularizes \"bling bling\" Juvenile & Lil Wayne's \"Bling Bling\" marked a culturally significant moment. Coined in the late 1990s by Cash Money Records, the term \"bling bling\" became synonymous with the excessive and flashy display of luxury jewelry. Lil Wayne and the wider Cash Money roster celebrated this opulent aesthetic, solidifying the link between hip-hop music and lavish jewelry. As a result, \"bling\" became a cornerstone of hip-hop's visual identity.\n\nJay-Z x Nike Air Force 1 In 2004, Jay-Z's partnership with Nike produced the iconic \"Roc-A-Fella\" Air Force 1 sneakers, a significant collaboration that helped bridge the worlds of hip-hop and sneaker culture. These limited-edition kicks in white and blue colorways featured the Roc-A-Fella Records logo on the heel and were highly coveted by fans. The collaboration exemplified how hip-hop artists could have a profound impact on sneaker culture and streetwear by putting a unique spin on classic designs. Hova's design lives on in limitless references to fresh white Nike kicks.\n\nPharrell Williams' hat at the 2014 GRAMMY Awards Pharrell Williams made a memorable red carpet appearance at the 2014 GRAMMY Awards in a distinctive and oversized brown hat. Designed by Vivienne Westwood, the hat quickly became the talk of the event and social media. A perfect blend of sartorial daring, Pharrell's hat complemented his red Adidas track jacket while accentuating his unique sense of style. An instant fashion moment, the look sparked innumerable memes and, likely, a renewed interest in headwear.\n\nKanye’s rise & fall at Adidas (2013-2022) Much more than a \"moment,\" the rise and eventual fall of Kanye’s relationship with Adidas, was as documented in a recent investigation by the New York Times. The story begins in 2013 when West and the German sportswear brand agreed to enter a partnership. The collaboration would sell billions of dollars worth of shoes, known as \"Yeezys,\" until West’s anti-semitic, misogynistic, fat-phobic, and other problematic public comments forced the Adidas brand to break from the partnership amid public outrage.\n\nSupreme drops x hip-hop greats Supreme, with its limited drops, bold designs, and collaborations with artists like Nas and Wu-Tang Clan, stands as a modern embodiment of hip-hop's influence on streetwear. The brand's ability to create hype, long lines outside its stores, and exclusive artist partnerships underscores the enduring synergy between hip-hop and street fashion.\n\nGucci Pays \"homage\" to Dapper Dan When Gucci released a collection in 2017 that seemingly copied Dapper Dan's distinctive style, (particularly one look that seemed to be a direct re-make of a jacket he had created for Olympian Dionne Dixon in the '80s), it triggered outrage and accusations of cultural theft. This incident sparked a conversation about the fashion industry's tendency to co-opt urban and streetwear styles without proper recognition, while also displaying flagrant symbols of racism through designs. Eventually, spurred by public outrage, the controversy led to a collaboration between Gucci and Dapper Dan, a significant moment in luxury fashion's acknowledgement and celebration of the contributions of Black culture, including streetwear and hip-hop to high fashion. \"Had Twitter not spotted the, \"Diane Dixon\" [jacket] walking down the Gucci runway and then amplified that conversation on social media... I don't think we would have had this incredible comeback,\" Sowmya Krishnamurphy says.\n\nA$AP Rocky x DIOR Self-proclaimed \"Fashion Killa\" A$AP Rocky is a true fashion aficionado. In 2016, the sartorially obsessed musician and rapper became one of the faces of Dior Homme’s fall/winter campaign shot by photographer Willy Vanderperre — an early example of Rocky's many high fashion collaborations with the luxury European brand. A$AP Rocky's tailored style and impeccable taste for high fashion labels was eloquently enumerated in the track \"Fashion Killa\" from his 2013 debut album Long. Live. ASAP, which namedrops some 36 luxury fashion brands. The music video for \"Fashion Killa\" was co-directed by Virgil Abloh featuring a Supreme jersey-clad Fenty founder, Rihanna long before the two became one of music’s most powerful couples. The track became an anthem for hip-hop’s appreciation for high fashion (and serves as the title for Krishnamurphy’s recently published anthology).\n\nCardi B Wears vintage Mugler at the 2019 GRAMMYs Cardi B has solidified her \"it girl\" fashion status in 2018 and 2019 with bold and captivating style choices and designer collaborations that consistently turn heads. Her 2019 GRAMMYs red carpet appearance in exaggerated vintage Mugler gown, and many custom couture Met Gala looks by designers including Jeremy Scott and Thom Browne that showcased her penchant for drama and extravagance. But Cardi B's fashion influence extends beyond her penchant for custom high-end designer pieces (like her 2021 gold-masked Schiaparelli look, one of nine looks in an evening.) Her unique ability to blend couture glamour with urban chic (she's known for championing emerging designers and streetwear brands) fosters a sense of inclusivity and diversity, and makes her a true trendsetter.\n\nBeyoncé & Jay-Z in Tiffany & Co.’s \"About Love\" campaign The power duo graced Tiffany & Co.'s \"About Love'' campaign in 2021, showcasing the iconic \"Tiffany Yellow Diamond,\" a 128.54-carat yellow worn by Beyoncé alongside a tuxedo-clad Jay-Z. The campaign sparked controversy in several ways, with some viewers unable to reconcile the use of such a prominent and historically significant diamond, sourced at the hands of slavery, in a campaign that could be seen as commercializing and diluting the diamond's cultural and historical importance. Despite mixed reaction to the campaign, their stunning appearance celebrated love, adorned with Tiffany jewels and reinforced their status as a power couple in both music and fashion.\n\nKendrick Lamar performs at Louis Vuitton When Kendrick Lamar performed live at the Louis Vuitton Men’s spring-summer 2023 runway show in Paris in June 2022 following the passing of Louis Vuitton’s beloved creative director Virgil Abloh, he underscored the inextricable connection between music, fashion and Black American culture.\n\nLamar sat front row next to Naomi Campbell, adorned with a jeweled crown of thorns made from diamonds and white gold worth over $2 million, while he performed tracks including \"Savior,\" \"N95,\" and \"Rich Spirit'' from his last album, Mr. Morale and the Big Steppers before ending with a repeated mantra, \"Long live Virgil.\" A giant children’s toy racetrack erected in the Cour Carrée of the Louvre became a yellow brick road where models marched, clad in designer looks with bold, streetwear-inspired design details, some strapped with oversized wearable stereo systems.", "images": ["https://i8.amplience.net/i/naras/Lil Kim_GettyImages-74709383.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797306174-594x594 (1).jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://i8.amplience.net/i/naras/Maria Becerra _Rodrigo VarelaGetty Images for Latin Recording Academy.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "https://i8.amplience.net/i/naras/GettyImages-1797082814.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797219444-594x594 (1) (1).jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/search", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/paid in full.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Slick Rick.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Kenia_OS_2023_latin_grammys_gettyimages_1797178395.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Cardi B_2019 GRAMMYs_GettyImages-1128885018.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Edgar Barrera_gettyimages-1796980180.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Leon Leiden-Natascha Falcao and Paola Guanche-1797456327-2.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797164764-594x594.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/TLC_GettyImages-893492944.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/LL Cool J _Paul NatkinGetty Images.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797166923-594x594.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/TWolters Headshot.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Dapper Dan_ Gucci_GettyImages-689797212.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797238692-594x594 (1).jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/joaquina_Rodrigo VarelaGetty Images for Latin Recording Academy.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797232078-594x594 (1).jpg?w=821&sm=c", "https://www.facebook.com/tr?id=338622743242551&ev=PageView&noscript=1", "https://i8.amplience.net/i/naras/Pharrell_Daft PUnk_GettyImages-465350543.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797100966-594x594.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://cdn.media.amplience.net/i/naras/2024-grammys-66G_CBS_Tune_In_Logo_2045x793.webp?w=175", "https://naras.a.bigcontent.io/v1/static/connected", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v3_KeyArt_1644x925", "https://i8.amplience.net/i/naras/Supreme_Nas_WuTang_Clan_collaborations.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/NWA Too Short.jpg?w=821&sm=c", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://i8.amplience.net/i/naras/gettyimages-543531002-594x594.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Shakira_2023 Latin Grammys_RedCarpet.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/gettyimages-1797218371-594x594 (1) (1).jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v1_KeyArt_1644x925", "https://i8.amplience.net/i/naras/gettyimages-1797217794-594x594 (1).jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Peso Pluma_Nicki Nicole.jpg?w=821&sm=c"], "top_img": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, 2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/2018-latin-grammy-awards-complete-winners-list", "title": "2018 Latin GRAMMY Awards Complete Winners List | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/gettyimages-1062036782.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 33}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}