{"url": "https://www.inquisitr.com/4354145/maksim-chmerkovskiy-and-peta-murgatroyd-host-their-wedding-party-in-taylor-swifts-blank-space-castle/", "text": "Maksim Chmerkovskiy and Peta Murgatroyd found the perfect space for their wedding, and pop music fans may recognize it as photos from the couple’s supersized wedding weekend begin to surface. On July 7, the Dancing with the Stars pro dancers and their posse partied the night away at Oheka Castle, the sprawling piece of real estate featured in Taylor Swift’s “Blank Space” video. According to E! News, the night before their July 8 wedding, Maks and Peta hosted their pre-wedding party at the famous Long Island wedding venue. The couple reportedly rented out the space for their weekend-long wedding extravaganza, and they will exchange vows there.\n\nEntertainment Tonight previously reported that Maks Chmerkovskiy and Peta Murgatroyd planned to host a Shabbat dinner at Oheka the night before the ceremony and a Sunday brunch the morning after the wedding.\n\nFor the wedding eve event, Peta Murgatroyd was picture perfect in a white, satin, strapless sheath dress. Other attendees at the gala included Maks’ brother, Val Chmerkovskiy, and his rumored girlfriend and fellow Dancing With the Stars pro dancer Jenna Johnson, as well as former DWTS troupe member Nicole Volynets Gamer, who was not only Peta’s maid of honor but also her wedding planner.\n\nOther DWTS alums on hand to celebrate the couple’s wedding weekend included longtime DWTS pros Tony Dovolani, Keo Motsepe, Henry Byalikov, and actress Rumer Willis, who was Val Chmerkovskiy’s celebrity partner on the 20th season of the ABC celebrity ballroom competition. Other celebs that were previously rumored to have made the guest list include Val’s ex, Amber Rose, Nyle DiMarco, and Bachelor star Nick Viall, who was Peta Murgatroyd’s most recent celebrity partner on the ABC celebrity ballroom competition.\n\nAccording to E!, Maks and Peta’s longtime pal and fellow DWTS pro, Sharna Burgess, is a member of the couple’s wedding party but she missed the Friday night festivities due to another wedding. Sharna landed in town on Saturday just in time to get glammed up for the main event.\n\nMaksim Chmerkovskiy had his eye on the famed wedding venue for more than 20 years after spotting it when his family first immigrated to the United States in the 1990s. In an interview with People, Peta Murgatroyd admitted her jaw dropped when she first saw the castle estate, which was built in 1919 and is surrounded by a golf course. Murgatroyd originally assumed she would get married in a church, but she fell in love with Maks’ castle pick at first sight.\n\nIn addition to its Taylor Swift cred, Oheka Castle was featured in the movie Cruel Intentions and it served as an inspiration for F. Scott Fitzgerald’s classic novel The Great Gatsby. Now, the venue can add Dancing With the Stars royalty to its list of credits.\n\nTake a look at the video below to see Oheka Castle featured in Taylor Swift’s “Blank Space” video.\n\n[Featured Image by Michael Buckner/Getty Images]", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Victoria Miller"], "canonical_link": "https://www.inquisitr.com/4354145/maksim-chmerkovskiy-and-peta-murgatroyd-host-their-wedding-party-in-taylor-swifts-blank-space-castle", "title": "Maksim Chmerkovskiy And Peta Murgatroyd Host Their Wedding Party In Taylor Swift’s ‘Blank Space’ Castle", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Maksim Chmerkovskiy and Peta Murgatroyd found the perfect space for their wedding, and pop music fans may recognize it as photos from the couple&#8217;s supersized wedding weekend begin to surface. On July 7, the Dancing with the Stars pro dancers and their posse partied the night away at Oheka Castle, the sprawling piece of real [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Maksim Chmerkovskiy And Peta Murgatroyd Host Their Wedding Party In Taylor Swift’s ‘Blank Space’ Castle", "url": "https://www.inquisitr.com/4354145/maksim-chmerkovskiy-and-peta-murgatroyd-host-their-wedding-party-in-taylor-swifts-blank-space-castle", "type": "article", "description": "Maksim Chmerkovskiy and Peta Murgatroyd found the perfect space for their wedding, and pop music fans may recognize it as photos from the couple&#8217;s supersized wedding weekend begin to surface. On July 7, the Dancing with the Stars pro dancers and their posse partied the night away at Oheka Castle, the sprawling piece of real [&hellip;]"}, "article": {"published_time": "2017-07-08T14:54:25", "modified_time": "2017-07-08T14:54:25", "author": "Victoria Miller"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Maksim Chmerkovskiy And Peta Murgatroyd Host Their Wedding Party In Taylor Swift’s ‘Blank Space’ Castle", "description": "Maksim Chmerkovskiy and Peta Murgatroyd found the perfect space for their wedding, and pop music fans may recognize it as photos from the couple&#8217;s supersized wedding weekend begin to surface. On July 7, the Dancing with the Stars pro dancers and their posse partied the night away at Oheka Castle, the sprawling piece of real [&hellip;]"}}, "movies": ["https://www.youtube.com/embed/e-ORhEE9VVg?feature=oembed"], "publish_date": 1499514865.0, "source": "https://www.inquisitr.com", "summary": ""}