{"url": "https://web.archive.org/web/20180116081506/http://ew.com/recap/the-bachelor-season-22-episode-3/2/", "text": "The Bachelor\n\ntype TV Show Current Status In Season seasons 20 run date 03/25/02 performer Aaron Buerge, Andrew Firestone, Bob Guiney, Alex Michel, Estella Gardinier, Trista Rehn, Jen Schefft Producer Mike Fleiss broadcaster ABC genre Reality TV\n\nNext up, Bekah lies on Arie and tells him about her longest relationship — 2.5 to 3 years — which translates in my mind to: middle school. She and Arie then bond about how breakups can make you reevaluate things and how you, like, totally end up hitting the gym and stuff, right? Totally! Then they make out and she straddles him while the rest of the women discuss how well their nights went.\n\nSo while Bekah mounts Arie, Krystal pulls a Trump and decides that everyone else is living in their own “false reality” and the truth is only what she believes, which is that she and Arie are the OTP…and then Arie gives the date rose to Bekah. As he so eloquently puts it, “You were outstanding today and tonight you were amazing.” (I can only imagine how great his wedding vows will be.)\n\nThe next day, Krystal admits that she’s been hated on by “jealous” girls her entire life. She has struggled for so long and she’s had to be SO strong and carry so much all by herself, and now, she just has to endure it one more time because she knows she and Arie will end up together. This process is just the latest thing she has to get through in order for them to be together in the end. Meanwhile, I can’t wait until ABC forces her to watch this on the Women Tell All special and let me tell you: THAT will be something to endure.\n\nAs for Lauren S., she’s off to Napa Valley with Arie for her one-on-one date in wine country, and she, for one, is looking forward to all the “cheersing” that will be happening. But the wine isn’t the only great thing about this date. There’s also the riveting conversation.\n\nFirst up, they discuss how early they go to bed. THEN they discuss how early they wake up. And wait, isn’t it crazy how you reach a certain age and you suddenly just start wearing cardigans?! So cray.\n\nAnd if you thought that was great stuff, just wait until the dinner portion of the evening in which Lauren S. talks so much that ARIE ACTUALLY EATS. This might be the first time in Bachelor history that we’ve seen someone eat on a date, and that’s how you know it’s bad.\n\nSitting down to dinner, Arie kicks things off by explaining that he’s not a wine connoisseur, he just likes going to wineries and drinking wine. He then asks Lauren ONE question about her journey to get here, and she tells him about past relationships, her amazing friends and family, that one time her mom got an eye infection when she was in college, why she loves music, how she doesn’t really know what “science” is, and the fact that her last relationship lacked chemistry. Welp, I’d say that last thing applies here too.\n\nBefore the night’s over, she tries to rescue herself by talking SOME MORE about how she wasn’t herself tonight and how she’s not sure what’s happening. (Surely it’s not the wine you’ve been drinking all day.) But in the end, Arie tells her he can’t give her the rose because, to quote him, “I don’t even know.” Same, Arie. Same. He then walks her out and says his super easy “most difficult” goodbye yet.\n\nBack at the house, Lauren’s luggage is taken away, and Krystal takes it upon herself to perform some sort of funeral for Lauren’s “beautiful soul” before offering the other women the never-before-heard advice to make the most of their time, and Caroline has had enough of it. As Lauren’s friend, Caroline is done with Krystal and the fact that she thinks she can be condescending to everyone just because “you met his dog.” (Next: Who let the dogs out?)", "images": ["https://web.archive.org/web/20180116081506im_/http://subscription-assets.timeinc.com/current/2332_top1_205_thumb.jpg", "https://web.archive.org/web/20180116081506im_/http://subscription-assets.timeinc.com/article-covers/2332_106821743_2017_04_07_205_thumb.jpg", "https://web.archive.org/web/20180116081506im_/https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?w=2000", "https://web.archive.org/web/20180116081506im_/https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?crop=0px%2C274px%2C2700px%2C1419px&resize=1200%2C630", "https://web.archive.org/web/20180116081506im_/http://ew.com/img/sign-up-bg.jpg"], "top_img": "https://web.archive.org/web/20180116081506im_/https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?crop=0px%2C274px%2C2700px%2C1419px&resize=1200%2C630", "keywords": [], "authors": ["Samantha Highfill"], "canonical_link": "https://web.archive.org/web/20180116081506/http://ew.com/recap/the-bachelor-season-22-episode-3/", "title": "The Bachelor recap: Season 22, Episode 3", "meta_data": {"viewport": "width=device-width, initial-scale=1, maximum-scale=1, minimum-scale=1, user-scalable=no", "keywords": "The Bachelor, The Bachelor recap, The Bachelor season 22, Arie Luyendyk Jr", "news_keywords": "The Bachelor, The Bachelor recap, The Bachelor season 22, Arie Luyendyk Jr", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "og": {"title": "'The Bachelor' recap: The women give wrestling a try", "type": "article", "site_name": "EW.com", "url": "https://web.archive.org/web/20180116081506/http://ew.com/recap/the-bachelor-season-22-episode-3/", "description": "The women give wrestling a try, and Annaliese unveils yet another childhood trauma", "image": {"identifier": "https://web.archive.org/web/20180116081506im_/https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?crop=0px%2C274px%2C2700px%2C1419px&resize=1200%2C630", "width": 1200, "height": 630}}, "pinterest": {"url": "http://ew.com/recap/the-bachelor-season-22-episode-3/", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "media": "https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?crop=0px%2C274px%2C2700px%2C1419px&resize=1200%2C630"}, "twitter": {"card": "summary_large_image", "url": "https://web.archive.org/web/20180116081506im_/http://ew.com/recap/the-bachelor-season-22-episode-3/", "title": "'The Bachelor' recap: The women give wrestling a try", "description": "Week three involves wrestling, dogs, and two women getting sent home early.", "site": "@ew", "image": "https://web.archive.org/web/20180116081506im_/https://ewedit.files.wordpress.com/2018/01/147763_7383.jpg?crop=0px%2C274px%2C2700px%2C1419px&resize=1200%2C630"}, "fb": {"pages": 52150999700}}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}