{"url": "https://www.grammy.com/grammys/news/ed-sheeran-wins-best-pop-solo-performance-2018-grammys", "text": "It's hard to say that Ed Sheeran is having a \"moment\" — since his debut album + in 2011, he's had countless groundbreaking career milestones. But 2023 may just be his most monumental year yet. Sheeran's banner 2023 came on the heels of what was arguably his hardest year to date, as his Disney+ documentary, Ed Sheeran: The Sum Of It All detailed. The four-part doc sees the star cope with losing his best friend, his wife's cancer diagnosis, and his copyright case for \"Shape of You\" — and in turn, channeling all of that pain and grief into his sixth album, Subtract. By the end of the doc, Sheeran says of his wife's positive prognosis and the pending album releases, \"All great news. And heading into a year where, hopefully, it's all good news.\" Fortunately for the four-time GRAMMY winner, 2023 has been all good news. Sheeran himself has said this year has been his best year so far, telling fans on Reddit, \"The older I get, the more I feel I'm figuring it out and having more fun with it.\" His latest 2023 achievement comes in the form of Autumn Variations, Sheeran's seventh album and second in just five months. What's more, the LP arrived just one week after Sheeran broke yet another stadium attendance record at Los Angeles' SoFi Stadium, where he ended his North American Mathematics Tour on Sept. 23. (He'll play a rescheduled show in Las Vegas on Oct. 28 after experiencing production issues on Sept. 9.) Below, check out 11 moments that helped 2023 become Ed Sheeran's definitive year. Paying Tribute to Jamal Edwards\n\nSheeran started out the new year with a beautiful tribute to his late best friend, Jamal Edwards, on the YouTube channel for SBTV, which Edwards founded in 2006. Shot in Stamford Bridge — the home to Edwards' favorite football team, Chelsea F.C. — surrounded by candles, Sheeran raps about the anguish over losing his \"brother\" and vows to keep his legacy alive. Edwards, who helped launch Sheeran's career in the early days, died suddenly from a drug-induced heart attack in February 2022. His death hit Sheeran hard, inspiring several songs for Subtract, including lead single \"Eyes Closed.\" The F64 video relaunched the series for SBTV and garnered over 2 million views. \"Everyone remembers him the way the media is telling you — that he was a mogul and he set up SBTV and he was worth this and that,\" Sheeran emotionally told Zane Lowe in their Apple Music interview upon Subtract's May release. \"But, he was just a really great, lovely, funny bloke.\" Breaking Multiple Stadium Attendance Records\n\nView this post on Instagram A post shared by Ed Sheeran (@teddysphotos) Throughout his Mathematics World Tour this year, Sheeran has broken several stadium attendance records — some of which were his own records. He first broke some in Melbourne, Brisbane, Wellington, and Perth in February and March;. at Melbourne's MCG Stadium, Sheeran initially broke the record by performing to a 107,000-strong crowd on March 2, but topped that record 24 hours later with 109,500 fans for this March 3 show. \"Ed loves to break a record and he's smashed this one,\" Matt Gudinski, CEO of Mushroom Group, the live entertainment management group for the Mathematics World Tour, said in a press release. In North America, Sheeran continued smashing attendance records in Santa Clara, Minneapolis, New Jersey, Seattle, Denver, Atlanta, Philadelphia, Foxborough, Chicago, Nashville, Kansas City, Vancouver, and Los Angeles. As Sheeran noted on Instagram, his biggest US attendance was at MetLife Stadium in New Jersey, where he played to more than 82,000 fans. \"My dad told me if you can make it in New York, you can make it anywhere, and today was really reminiscing about playing my first show at mercury lounge in 2012 to 130 people,\" he added in the caption. \"It feels like a dream today.\" Debuting A Disney+ Docuseries\n\nIn May, Sheeran released a documentary series with Disney+ alongside his Subtract release. It documented the process of the album, and showed a little more depth into Sheeran's personal life — one that he keeps very private. His wife, Cherry Seaborn, came up with the idea of the documentary after she was diagnosed with cancer while pregnant with their second child. Fortunately, it ended up being less serious than it was initially diagnosed, but it made her reflect on her own mortality — what people's perception of her would be and what she would leave behind. \"For Ed, the whole point is that he wants to say to people, 'I'm not just this music machine. I'm not just this robot that tries to get No. 1. I'm a father. I'm a son. I'm a friend. I'm a husband,'\" Seaborn reflects in the docuseries. Filmed throughout 2022, the series follows Sheeran as he processes his pain and grief over the loss of Edwards, while also working on his visual album. The four-episode series focused on the themes Love, Loss, Focus, and Release. After the release of the album and documentary, Sheeran told Z100's The Elvis Duran Morning Show how much he enjoys hearing that people are connecting with both the record and docuseries despite its sad undertones. \"What I didn't want is like, 'sad pop star does sad documentary and sad album,'\" Sheeran explains. \"What I wanted was to do a sort of snapshot of grief and depression and have people connect it to their own feelings. The people that made the documentary for me, two of them lost their mothers whilst we were doing the documentary. They found the process cathartic by making it and watching it. I think it's good.\" Releasing Subtract\n\nSubtract, the final album in Sheeran's mathematically titled series, arrived on May 5. It's the first of his albums to have a visual album alongside it — 14 different music videos created for each song. During his press tour, Sheeran shared that he loved all of his albums, but Subtract reflected more of who he was at the start of his career as an acoustic singer/songwriter. Because of this, he felt uncomfortable about the release, unsure how it would do commercially. \"It's foreign territory for me,\" Sheeran told Zane Lowe. \"Usually with Equals, Plus or Multiply, it's like you write for three years and pick the best songs and then that's the album, whereas this one I wrote for a month and all the songs came out. It's not even necessarily a risk because my fans originally liked me for my singer/songwriter stuff, but it's the unknown of not having 'Shivers' to fall back on. Each of my albums, I've always been like I've got this.\" Subtract in fact has been a commercial success: Sheeran reached his sixth No. 1 on the UK Music Chart, becoming the UK's fastest-selling album of 2023 so far, shifting 76,000 chart units in its opening week. It also reached No. 1 in Australia, Austria, Belgium, France, Germany, Ireland, the Netherlands, New Zealand, Poland, Scotland, and Switzerland, and hit No. 2 on the Billboard 200 in the U.S. Winning Two \"Thinking Out Loud\" Copyright Lawsuits\n\nWithin two weeks of each other in May, Sheeran won two copyright infringement lawsuits involving his 2014 GRAMMY-winning song \"Thinking Out Loud,\" which was sued for its similarities to Marvin Gaye's classic \"Let's Get It On.\" He believes the verdict would help protect the creative process for songwriters in the U.S. and globally; Sheeran even claimed he would quit the music industry if he had lost the case. \"I am obviously very happy with the outcome of the case and it looks like I am not having to retire from my day job after all,\" he said after the rulings. \"But at the same time I'm unbelievably frustrated that baseless claims like this are allowed to go to court at all.\" Sheeran testified in court with his guitar, playing demos for the jury to prove the 1-3-4-5 chord progression at issue was a common \"building block\" of pop music and couldn't be owned. Music experts for the defense also proved that the chords were used prior to Gaye's song. After three hours of deliberations that followed the two-week trial, the jury were in favor of Sheeran, finding that he independently created his hit single. Performing With Luke Combs At The ACM Awards\n\nOn May 11, Sheeran made his Academy of Country Music Awards debut with his Subtract track \"Life Goes On,\" which he performed as a duet with country superstar Luke Combs. The duet version of the song was officially released following the show. While it was Sheeran's first ACM appearance, it wasn't the first time he and Combs have performed together. Combs — who has covered Sheeran's song \"Dive\" many times — brought Sheeran out as a surprise guest while singing \"Dive\" during his C2C Festival set in March 2022. (Combs later released an official recorded version of his cover.) Their friendship hit a whole new level after Sheeran posted a video on Instragram of the country star teaching him how to shotgun a beer. Combs finished his beer within three seconds, to which Sheeran said, \"That's really impressive.\" Surprising Fans All Over The Country\n\nView this post on Instagram A post shared by Ed Sheeran (@teddysphotos) In conjunction with the release of Subtract in May, Sheeran teamed up with American Express to create a weekend Subtract Pop-Up experience in New York City, Los Angeles, Dallas, Chicago, and Boston. Along with giving fans an interactive take on the album, Sheeran made surprise appearances to the pop-ups in NYC, LA, and Dallas, performing several songs outside each venue. Sheeran made surprise appearances at iconic establishments on several stops of his tour — from performing \"Lego House\" at the LEGO Store at the Mall of America in Minnesota, to playing barista at the Starbucks' original Pike Place location in Seattle, to serving up cheesesteaks at Philadelphia's famous Philip's Steaks. He also sang \"Thinking Out Loud\" for not one, but two sets of newlyweds: one at his favorite karaoke bar in Nashville, and another at Little White Wedding Chapel in Las Vegas. Before his Chicago concert at Soldier Field, Sheeran stepped behind the counter of The Wieners Circle, a restaurant notoriously known for hurling insults at their customers while serving hot dogs. According to a tweet from the establishment, Sheeran's stint seemingly held up his reputation as one of the nicest guys in the industry: \"Our newest trainee @edsheeran has a lot to learn, he's way too proper and friendly.\" He added to the fun with Autumn Variations, performing tracks from the album in fans' homes, which he unveiled in a series of videos and an album version titled Autumn Variations (Fan Living Room Sessions). Giving Intimate Subtract Concerts\n\nView this post on Instagram A post shared by Ed Sheeran (@teddysphotos) Alongside Sheeran's North American stadium shows, he played a series of intimate performances of Subtract in its entirety (as well as his biggest songs) at much smaller venues. The Subtract Tour was inspired by Sheeran's performance at London's Union Chapel, where he played the tracks in front of a crowd for the first time. As he was performing, he began to weep — a rare occurrence for the star, but an important learning moment. \"Every time you release music, it starts to just belong to the public. That's why music is really special because whenever an artist releases music, it does belong to you guys. It does become your stories and your thoughts,\" Sheeran said during his Subtract Tour show in Los Angeles. \"And what I wanted with this album was to come out and play it more so I can feel less sad about it. It's kind of a grieving process for me to sort of stand on stage and sing these songs.\" Performing Alongside His Heroes & Fellow Superstars\n\nView this post on Instagram A post shared by Ed Sheeran (@teddysphotos) It's no surprise that a global superstar like Ed Sheeran would draw a number of famous folks to his concerts — like Chef Gordon Ramsey, Chris Hemsworth, Lil Nas X, and Matt Damon, who all paid Sheeran a surprise visit at his Metlife show. But it was the guests that appeared next to him on stage that surprised the fans, too. Ontario-bred singer Shawn Mendes surprised the crowd at Rogers Centre in Toronto, where the pair sang Sheeran's 2011 single \"Lego House\" and Mendes' 2017 hit, \"There's Nothin' Holding Me Back.\" Mendes had originally wanted to attend the concert, but Sheeran suggested, \"You can't just come to the show. You gotta come up and sing a song.\" When Sheeran's opener Khalid couldn't perform in Foxborough, Massachusetts, Sheeran called on some friends to help out: John Mayer on June 30 and Little Big Town on July 1. After Mayer opened the show, he later joined Sheeran on stage to sing \"Thinking Out Loud\" which they've performed together the 2015 GRAMMYs and again at Mayer's show in Tokyo in 2019. \"When Ed asked me, the idea was just too intriguing to pass up,\" Mayer wrote on Instagram. \"I love the opportunity to help cover for two of my friends at the same time.\" Two weeks later, Sheeran asked his Detroit crowd if he could perform a cover of the city's rap icon Eminem. In the middle of singing \"Lose Yourself,\" Eminem emerged from beneath the stage and joined in on the song. They continued their duets with Eminem's 2000 hit \"Stan,\" which the duo performed together during the rapper's induction into the Rock & Roll Hall of Fame last year. \"I remember spraying my hair yellow and rapping Eminem in the school talent show when I was 11, insane to be able to bring him out to my show in Detroit,\" Sheeran reminisced on Instagram. \"Really a moment I will never forget, a real career and life highlight.\" Sheeran continued the trend of bringing out a performer from their hometown with Macklemore at Lumen Field in Seattle. Sheeran caught up with Macklemore that day — as he told the crowd, they've been friends for 10 years — and invited him to perform alongside him that night.\" The duo, who performed together back in 2014 at the iHeartRadio Music Festival, sang Macklemore's hits \"Thrift Shop\" and \"Can't Hold Us.\" Opening For John Mayer At The Wiltern\n\nView this profile on Instagram John Mayer (@johnmayer) • Instagram photos and videos After opening for Sheeran at Gillette Stadium, John Mayer called on his friend to repay the favor to support a good cause at LA's The Wiltern on Sept. 19. The show benefitted the Heart and Armor Foundation, which supports the health of veterans of war. Sheeran kicked off the evening with seven songs, including \"Castle on the Hill,\" \"Bad Habits,\" \"Shivers,\" and \"Shape of You.\" He later joined Mayer on stage to duet on 2006's Continuum fan favorite, \"Slow Dancing in a Burning Room,\" and a cover of Tom Petty's \"Free Fallin.\" Following the duets, the two hugged and Sheeran told the crowd, \"I just said to John, 'I feel like I'm going to watch that on YouTube for the rest of my life.' That was so special.\" Releasing His First Album On His Own Label", "images": ["https://naras.a.bigcontent.io/v1/static/twitter-icon", "https://naras.a.bigcontent.io/v1/static/youtube-icon", "https://i8.amplience.net/i/naras/Ed-Sheeran-2023-GettyImages-1486458498.jpg?w=821&sm=c", "https://naras.a.bigcontent.io/v1/static/search", "https://naras.a.bigcontent.io/v1/static/facebook-icon", "https://i8.amplience.net/i/naras/HH50_GR_Kendrick_Hero_1920x1080.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/show_categoryarticles_bestpopsoloperformance.jpg.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/TWolters Headshot.jpg?w=821&sm=c", "https://i8.amplience.net/i/naras/Skrillex-Fred-Again-2023.jpg?w=821&sm=c", "https://www.facebook.com/tr?id=338622743242551&ev=PageView&noscript=1", "https://naras.a.bigcontent.io/v1/static/2023-new-members-class-recording-academy-announcement-Invitation-Email-header-1200-690", "https://cdn.media.amplience.net/i/naras/2024-grammys-66G_CBS_Tune_In_Logo_2045x793.webp?w=175", "https://naras.a.bigcontent.io/v1/static/connected", "https://naras.a.bigcontent.io/v1/static/instagram-icon", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v3_KeyArt_1644x925", "https://cdn.media.amplience.net/i/naras/RA_Logo_black", "https://naras.a.bigcontent.io/v1/static/Banner-Pop_1500x1000", "https://naras.a.bigcontent.io/v1/static/2024_grammys_nominations_66th_grammy_awards_Noms_Editorial_v1_KeyArt_1644x925", "https://i8.amplience.net/i/naras/show_categoryarticles_bestpopsoloperformance.jpg"], "top_img": "https://i8.amplience.net/i/naras/show_categoryarticles_bestpopsoloperformance.jpg", "keywords": [], "authors": [], "canonical_link": "https://www.grammy.com/news/ed-sheeran-wins-best-pop-solo-performance-2018-grammys", "title": "Ed Sheeran Wins Best Pop Solo Performance", "meta_data": {"viewport": "width=device-width", "google-site-verification": "mjYJq7vX2IJfypeIqe00aJUZ98j7fzgMwjkIC_eBGto", "robots": "index,follow", "googlebot": "index,follow", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "og": {"title": "Ed Sheeran Wins Best Pop Solo Performance | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "url": "https://www.grammy.com/news/ed-sheeran-wins-best-pop-solo-performance-2018-grammys", "type": "article", "image": {"identifier": "https://i8.amplience.net/i/naras/show_categoryarticles_bestpopsoloperformance.jpg", "alt": "GRAMMY.com", "width": 1200, "height": 630}}, "keywords": "GRAMMY, GRAMMY.COM, Ed Sheeran Wins Best Pop Solo Performance | 2018 GRAMMYs | GRAMMY.com", "twitter": {"url": "https://www.grammy.com/news/ed-sheeran-wins-best-pop-solo-performance-2018-grammys", "title": "Ed Sheeran Wins Best Pop Solo Performance | 2018 GRAMMYs | GRAMMY.com", "description": "As the world&#039;s leading society of music professionals, the Recording Academy is dedicated to celebrating, honoring, and sustaining music&#039;s past, present, and future.", "image": "https://i8.amplience.net/i/naras/show_categoryarticles_bestpopsoloperformance.jpg", "site": {"id": 17243213}}, "bingbot": "index,follow", "next-head-count": 33}, "movies": [], "publish_date": null, "source": "https://www.grammy.com", "summary": ""}