{"url": "www.scmp.com/news/world/europe/article/2146295/meghan-markles-father-says-he-wants-walk-his-daughter-down-aisle", "text": "But he wasn’t sure if he would be able to travel to Britain.\n\n“Of course I’d walk her down the aisle. This is a historic moment. I’d like to be a part of history,” he told the website.\n\nThomas Markle told the celebrity news site TMZ on Tuesday that he wanted to walk his daughter down the aisle, but was not sure if he could.\n\nWhether Meghan Markle’s father shows at St. George’s Chapel at Windsor Castle on Saturday was the subject of fevered speculation among royal obsessives on Tuesday.\n\nHe said he was back in the hospital after suffering chest pains and wasn’t sure if the doctors would release him in time.\n\nHe also told TMZ website that Meghan tried calling him on Monday, but he missed the call. She then texted him saying she loved him and was concerned about his health, the website said.\n\nHis latest chat with TMZ comes after Prince Harry and Meghan Markle asked for “understanding” amid claims that her father would not attend the royal wedding.\n\nKensington Palace, the official residence of Prince Harry and Meghan Markle, issued a statement late on Monday following reports that Thomas Markle, who lives quietly in Mexico, had pulled out of the wedding. The statement did not confirm or deny speculation surrounding his attendance.\n\n“This is a deeply personal moment for Ms. Markle in the days before her wedding. She and Prince Harry ask again for understanding and respect to be extended to Mr. Markle in this difficult situation,” the statement said.\n\nMeghan Markle, right, attending the closing ceremonies of the Invictus Games with her mother, Doria Ragland, in Toronto last September. Photo: The Canadian Press via AP\n\nAccording to TMZ, as of Monday, Markle had decided to pull out of the wedding because he does not want to embarrass his daughter or the royal family. The website also claimed that he had recently suffered a minor heart attack.\n\nTMZ said that he had regretted posing for pictures, which included photographs of him getting measured for his wedding suit and another of him looking at pictures of his daughter and future son-in-law. Thomas Markle told the website he looked “stupid and hammy.”\n\nThe 73-year-old retired Hollywood lighting director told TMZ he was “popping Valium” because of chest pains brought on by “emotional upset”. Markle worried he might return to the hospital soon.\n\nThe reports of a possible no-show by Markle’s father were splashed across the front pages of several British newspapers on Tuesday.\n\nMarkle’s half-sister, Samantha Markle, said that she was the one to blame for the snaps and that they were intended to portray her father in a positive light.\n\n“The bad press over my father doing staged photos is my fault,” she said, according to tweets seen by the BBC.\n\n“The media was unfairly making him look bad so I suggested he do positive photos for his benefit and the benefit of the royal family. We had no idea he would be taken advantage of. It was not for money.”\n\nOn Tuesday, Samantha Markle tangled with host Piers Morgan on ITV’s Good Morning Britain show.\n\n“You say that this is all the media’s fault that he’s not coming to the wedding because of this,” Morgan said. “Many of our viewers may have watched your activities in a year and a half and noticed you have been treating your sister in a shabby way.”\n\nBritish police patrol Windsor Castle in Windsor, England, on Tuesday, ahead of the wedding on Saturday of Britain’s Prince Harry to the American actress Meghan Markle. Photo: EPA-EFE\n\nSamantha Markle defended her father’s granting permission to be photographed. “The goal of those photographs was basically because he’s feeling defenceless,” she said. “A person has the right to say enough is enough.”\n\n“Yeah but here’s the problem. The media have been bombarded with letters from Kensington Palace and Thomas Markle as well,” claiming the press should not intrude on his privacy, Morgan said.\n\n“Now it turns out he was actively invading his own privacy for a check from a photographer,” he said.\n\nThen the TV host lashed into Samantha Markle for cashing in as well by publishing her book, The Diary of Princess Pushy’s Sister.\n\n“There’s no bigger media vulture than you,” Morgan said. “You’ve been trashing her for two years, you little vulture.”", "images": ["https://cdn4.i-scmp.com/sites/default/files/images/methode/2018/05/16/dc41876e-5877-11e8-a7d9-186ba932a081_1320x770_072211.jpg", "https://cdn1.i-scmp.com/sites/default/files/images/methode/2018/05/16/351efae0-587a-11e8-a7d9-186ba932a081_1320x770_072211.jpg", "https://img.i-scmp.com/cdn-cgi/image/fit=contain,width=60,format=auto/sites/default/files/styles/118x118/public/the-washington-post-250.jpg?itok=qoGv5M98", "https://assets-v2.i-scmp.com/production/_next/static/media/wheel-on-gray.af4a55f9.gif", "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2018/05/16/cd090ede-5877-11e8-a7d9-186ba932a081_image_hires_072211.jpg?itok=KO42A2vE&v=1526426537", "https://cdn1.i-scmp.com/sites/default/files/images/methode/2018/05/16/dbd2a390-587b-11e8-a7d9-186ba932a081_600x_072211.JPG", "https://cdn.i-scmp.com/sites/default/files/styles/768x768/public/images/methode/2018/05/16/cd090ede-5877-11e8-a7d9-186ba932a081_1280x720_072211.jpg?itok=jg7OywN4"], "top_img": "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2018/05/16/cd090ede-5877-11e8-a7d9-186ba932a081_image_hires_072211.jpg?itok=KO42A2vE&v=1526426537", "keywords": [], "authors": ["The Washington Post"], "canonical_link": "https://www.scmp.com/news/world/europe/article/2146295/meghan-markles-father-says-he-wants-walk-his-daughter-down-aisle", "title": "Meghan Markle’s father now says he will walk his daughter down the aisle – if he can make it to the UK", "meta_data": {"robots": "max-image-preview:large", "description": "Thomas Markle says, ‘I’d like to be a part of history’, but is not sure if he will be able to travel to Britain and attend the royal wedding because of his health", "twitter": {"card": "summary_large_image", "site": "@SCMPNews"}, "fb": {"app_id": 282931841805811}, "og": {"title": "Meghan Markle’s dad now says he’ll walk her down aisle – if he can get to UK", "description": "Thomas Markle says, ‘I’d like to be a part of history’, but is not sure if he will be able to travel to Britain and attend the royal wedding because of his health", "url": "https://www.scmp.com/news/world/europe/article/2146295/meghan-markles-father-says-he-wants-walk-his-daughter-down-aisle", "type": "article", "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_scmp_120/public/images/methode/2018/05/16/cd090ede-5877-11e8-a7d9-186ba932a081_image_hires_072211.jpg?itok=KO42A2vE&v=1526426537", "site_name": "South China Morning Post"}, "al": {"ios": {"app_store_id": 623201967, "app_name": "SCMP", "url": "scmp://news/world/europe/article/2146295/meghan-markles-father-says-he-wants-walk-his-daughter-down-aisle?entity=node&type=article&id=2146295"}, "android": {"package": "com.scmp.newspulse", "app_name": "SCMP", "url": "scmp://news/world/europe/article/2146295/meghan-markles-father-says-he-wants-walk-his-daughter-down-aisle?entity=node&type=article&id=2146295"}}, "apple-itunes-app": "app-id=623201967", "keywords": "Royal wedding, Meghan Markle, Thomas Markle", "news_keywords": "Royal wedding, Meghan Markle, Thomas Markle", "article": {"section": "Culture", "tag": "Celebrity children", "published_time": "2018-05-16T04:11:17+08:00", "modified_time": "2018-05-16T07:22:15+08:00"}, "pocket-site-verification": "25fd909c3fd10ded451415fc076ba8", "theme-color": "#ffffff", "mobile-web-app-capable": "yes", "viewport": "width=device-width, maximum-scale=1, user-scalable=no, initial-scale=1", "cXenseParse": {"articleid": 2146295, "author": "The Washington Post", "image": "https://cdn.i-scmp.com/sites/default/files/styles/768x768/public/images/methode/2018/05/16/cd090ede-5877-11e8-a7d9-186ba932a081_image_hires_072211.jpg?itok=i5G4hjoe&v=1526426537"}, "next-head-count": 48}, "movies": [], "publish_date": 1526415077.0, "source": "http://www.scmp.com", "summary": ""}