{"url": "www.westcoastsurrogacy.com/become-a-surrogate-mother/surrogate-mother-compensation", "text": "Gestational Surrogate Compensation at West Coast Surrogacy\n\nIt takes a special person to become a gestational carrier (also known as surrogate mother). The gift that surrogates provide is both remarkable and generous. In addition to the feeling of joy you experience as a surrogate, we will help to ensure that you are paid for your efforts, including generous compensation for surrogacy-related expenses.\n\nBecome a Surrogate: Apply Today!\n\nSurrogacy Agency benefit and compensation packages vary greatly. WCS is proud to offer one of the highest surrogacy base fees in the country, along with itemized expenses and allowances for individual circumstances.\n\nUnderstanding how benefit packages are structured is an important factor in selecting your agency. Please contact our office to review your specific benefit package.\n\nNon-Employed Surrogate Compensation\n\nExperienced Surrogate in CA $85,000 Experienced Surrogate outside CA $80,000 First Time Surrogate in CA $65,000 First Time Surrogate Outside of CA $60,000\n\nEmployed Surrogate Compensation\n\nExperienced Surrogate in CA $92,000 Covers first $10,000 of lost wages Experienced Surrogate outside CA $87,000 Covers first $10,000 of lost wages First Time Surrogate in CA $72,000 Covers first $10,000 of lost wages First Time Surrogate Outside of CA $67,000 Covers first $10,000 of lost wages\n\nAdditional Surrogate Fees & Allowances\n\nOne-Time Bonus (Upon Contract Signing) $3,000.00 Additional monthly and other allowances $300.00 Non accountable allowance (for maternity clothing, housekeeping, massages and other self pampering) $3,000 paid in installments of $1,000 every 12 weeks Multiples fee – twin pregnancy $10,000.00 Multiples fee – triplet pregnancy $20,000.00 Cesarean section $3,000.00 Embryo Transfer Fee $1,500.00 Surrogate’s compensation for lost wages, up to $10,000 if surrogate is employed, will be covered by the base fee. If lost wages exceed the original $10,000, an additional $10,000 may be covered in the event of physician ordered rest, recovery from birth, missed time from work due to pregnancy and/or appointments. Actual cost as determined Health insurance premium Monthly premium reimbursed if your policy is surrogate friendly\n\nHow much does surrogacy pay from state to state?\n\nEvery surrogacy case is unique and involves many factors that can impact the overall compensation. The average amount of compensation, including expenses, can range from $60,000 to $92,000 depending on experience and the individual arrangements. In states like California, where surrogates are in high demand, surrogates may be paid slightly higher. Legal requirements and the costs of other services can also vary from state to state. However, the amount surrogate mothers get paid doesn't vary greatly between cities like Los Angeles, San Francisco, Chicago and Houston.\n\nHow much do gestational surrogates make?\n\nSurrogate compensation varies depending on a wide range of factors, including state of residence, employment status, and whether you have been a surrogate before. At West Coast Surrogacy, surrogate compensation ranges between $60,000 to $92,000.\n\nHow much can surrogates make for a second surrogacy?\n\nSurrogates who have already been a surrogate once typically receive higher compensation than first-time surrogates. At West Coast Surrogacy, experienced surrogates can earn between $80,000 to $92,000 for their second and subsequent surrogacy journeys.\n\nWhat is the highest compensation available for surrogates?\n\nWest Coast Surrogacy offers one of the highest surrogacy base fees in the country, along with itemized expenses and allowances for individual circumstances. Our highest-paying surrogate compensation package is $92,000 for experienced and employed surrogates living in California.\n\nWhat factors are considered when determining surrogate compensation?\n\nSurrogate compensation is determined by several factors, including state of residence, employment status, experience as a surrogate, medical procedures, and non-accountable items. For example, you may live in a state, such as California, where the demand for surrogates is greater and the average surrogate compensation amount is higher. Your surrogate base compensation, along with reimbursement for lost wages or non-accountable items, like clothing, can vary among states. Additionally, certain medical circumstances, including those for pregnancy, may factor in.\n\nIs surrogate compensation taxable?\n\nIf you receive a 1099-MISC form for your surrogate compensation, you must report it to the Internal Revenue Service and claim it as income on your taxes. This form should be provided by your intended parents, surrogacy agency, or escrow service. If you don’t receive the form, it may be because your surrogacy contract has an established policy of not issuing federal taxation forms, but this does not exempt you from having to pay taxes on your compensation. For any questions about your taxation requirements and responsibilities as a surrogate, contact West Coast Surrogacy to speak with one of our representatives.\n\nHow often and when do surrogates receive their compensation?\n\nYou can expect to receive your initial base compensation once the pregnancy’s been confirmed with a heartbeat, after about six weeks. Typically, base compensation is paid out every month. At West Coast Surrogacy, your various fees and allowances will be paid in different frequencies, including a one-time $3,000 bonus upon contract signing. You’ll also receive non-accountable allowance payments every 12 weeks. You’ll be paid for other allowances and insurance premium reimbursements every month. If you have any questions regarding surrogate compensation and benefits packages, please contact West Coast Surrogacy.\n\nAre there any expenses that surrogates need to cover themselves?\n\nNo. The intended parents will pay for any expenses related to your surrogacy journey, pregnancy, and labor.\n\nIs the compensation package different for surrogates who have previously completed successful surrogacy journeys?\n\nYes, experienced surrogates are paid more than first-time surrogates. For example, at West Coast Surrogacy, an experienced surrogate can expect her compensation to be between $80,000 to $92,000, depending on her employment status and state of residence. Comparatively, a first-time surrogate will earn between $60,000 to $72,000.\n\nWhat happens if there are complications during the surrogacy process? Does the compensation change?\n\nWhile every measure is taken to prevent complications throughout a surrogacy journey, it’s impossible to 100% avoid all potential risks. Most agencies, including West Coast Surrogacy, establish certain milestones for compensation before the surrogacy process begins. Should complications, such as miscarriage, if you’ve achieved specific, agreed-upon milestones, you’ll likely be paid up to that point.\n\nHow is surrogate compensation handled legally? Are there any contracts or agreements involved?\n\nYes. Your surrogate contract agreement, drafted by the intended parent’s attorney, covers all relevant legal information, including compensation and escrow accounts. You’ll also have access to independent attorneys specializing in reproductive and surrogacy law. We encourage you to have an attorney review your legal contract and advise you on your rights and obligations. The intended parents pay all legal fees related to surrogacy.", "images": ["https://www.westcoastsurrogacy.com/content/logo-b.svg", "http://bat.bing.com/action/0?ti=5036062&Ver=2", "https://www.westcoastsurrogacy.com/content/logo-a.svg", "https://www.facebook.com/tr?id=1728921510685592&ev=PageView&noscript=1", "http://www.westcoastsurrogacy.com/assets/images/twitter.svg", "https://www.westcoastsurrogacy.com/content/3-become-a-surrogate-mother/3-surrogate-mother-compensation/video-5.png"], "top_img": "https://www.westcoastsurrogacy.com/content/3-become-a-surrogate-mother/3-surrogate-mother-compensation/video-5.png", "keywords": [], "authors": [], "canonical_link": "https://www.westcoastsurrogacy.com/become-a-surrogate-mother/surrogate-mother-compensation", "title": "Surrogate Mother Compensation", "meta_data": {"viewport": "width=device-width,initial-scale=1.0", "msvalidate.01": "CBAB0ECB524237165EE7B6E5A7D6C1C1", "description": "Help make dreams come true while earning up to $80,000 at West Coast Surrogacy. Visit us and learn about surrogate compensation and pay. Apply today!", "og": {"title": "Surrogate Mother Compensation | How Much Do Surrogates Get Paid in California?", "description": "Help make dreams come true while earning up to $80,000 at West Coast Surrogacy. Visit us and learn about surrogate compensation and pay. Apply today!", "image": "https://www.westcoastsurrogacy.com/content/3-become-a-surrogate-mother/3-surrogate-mother-compensation/video-5.png", "url": "https://www.westcoastsurrogacy.com/become-a-surrogate-mother/surrogate-mother-compensation", "site_name": "West Coast Surrogacy", "type": "article"}, "twitter": {"title": "Surrogate Mother Compensation | How Much Do Surrogates Get Paid in California?", "description": "Help make dreams come true while earning up to $80,000 at West Coast Surrogacy. Visit us and learn about surrogate compensation and pay. Apply today!", "image": {"src": "https://www.westcoastsurrogacy.com/content/3-become-a-surrogate-mother/3-surrogate-mother-compensation/video-5.png"}, "url": "https://www.westcoastsurrogacy.com/become-a-surrogate-mother/surrogate-mother-compensation", "site": "@WSurrogacy", "card": "summary_large_image"}, "theme-color": "#ffffff", "facebook-domain-verification": "hunq3rl90kbar7j3acqymgwx83zl8x"}, "movies": [], "publish_date": null, "source": "http://www.westcoastsurrogacy.com", "summary": ""}