{"url": "en.wikipedia.org/wiki/Jennifer_Lopez", "text": "American singer and actress (born 1969)\n\nJennifer Lynn Affleck[1] (née Lopez; born July 24, 1969),[2] known by her maiden name and also shortened to J.Lo, is an American singer and actress. Often considered a Latin pop culture icon,[3] Lopez is one of the most influential Hispanic entertainers in North America, credited for helping propel the Latin pop movement in American music. Her most successful singles on the US Billboard Hot 100 include the number one singles \"If You Had My Love\", \"I'm Real\", \"Ain't It Funny\" and \"All I Have\".[4]\n\nIn 1991, Lopez began appearing as a Fly Girl dancer on the sketch comedy television series In Living Color, where she remained a regular until she decided to pursue an acting career in 1993. For her first leading role in Selena (1997), she became the first Hispanic actress to earn over US$1 million for a film. She went on to star in Anaconda (1997) and Out of Sight (1998), and established herself as the highest-paid Hispanic actress in Hollywood.[5] Lopez ventured into the music industry with her debut studio album On the 6 (1999) and later starred in the psychological horror The Cell (2000). With the simultaneous release of her second studio album J.Lo and her romantic comedy The Wedding Planner in 2001, she became the first woman to have a number-one album and film in the same week. Her 2002 release, J to tha L–O! The Remixes, became the first remix album in history to debut atop the US Billboard 200. Later that year, she released her third studio album, This Is Me... Then and starred in the film Maid in Manhattan.\n\nAfter starring in Gigli (2003), a critical and commercial failure, Lopez starred in the successful romantic comedies Shall We Dance? (2004) and Monster-in-Law (2005). Her fifth studio album, Como Ama una Mujer (2007), had the highest first week sales for a debut Spanish album in the United States. Following a relatively unsuccessful period, she returned to prominence in 2011 with her appearance as a judge on American Idol and released her seventh studio album, Love?, spawning the international hit \"On the Floor\". From 2016 to 2018, she starred in the police drama series Shades of Blue and performed a residency show, Jennifer Lopez: All I Have, at Planet Hollywood Las Vegas. She also produced and served as a judge on World of Dance (2017–2020). In 2019, she garnered critical acclaim for her performance as a stripper in the crime drama Hustlers.\n\nFor her contributions to the recording industry, Lopez has a landmark star on the Hollywood Walk of Fame, and has received the Billboard Icon Award and the Michael Jackson Video Vanguard Award, among other honors. In 2012, Forbes ranked her the world's most powerful celebrity, and the 38th most powerful woman in the world.[6] Time listed her among their 100 most influential people in the world in 2018. Her other ventures include beauty and clothing lines, fragrances, a production company and a charitable foundation.[7]\n\nEarly life\n\nJennifer Lynn López was born on July 24, 1969, in the Bronx, a borough of New York City, and raised in its Castle Hill neighborhood.[8][9][10] Her parents, David López and Guadalupe Rodríguez, were born in Puerto Rico and met in New York City.[11][12] After serving in the army, David worked as a computer technician at Guardian Insurance Company.[13] Guadalupe was a homemaker for the first ten years of López's life and later worked as a Tupperware salesperson[14] and a kindergarten and gym teacher.[15][16] They divorced in the 1990s after 33 years of marriage.[14]\n\nLopez is a middle child; she has an older sister, Leslie, and a younger sister, Lynda.[17] The three shared a bedroom.[18] Lopez has described her upbringing as \"strict\".[19] She was raised in a Roman Catholic family; she attended Mass every Sunday and received a Catholic education, attending Holy Family School and the all-girls Preston High School.[20] In school, López ran track on a national level, participated in gymnastics and was on the softball team.[21][22] She danced in school musicals and played a lead role in a production of Godspell.[23]\n\nThere was \"lots of music\" in the typically Puerto Rican household,[24] and López and her sisters were encouraged to sing, dance and create their own plays for family events.[23][22] West Side Story made a particular impression on the young López and she wanted to be an entertainer from an early age.[25] As a teenager, she learned flamenco, jazz and ballet at the Kips Bay Boys & Girls Club[25] and taught dance to younger students, including Kerry Washington.[26] After graduating from high school, she had a part-time secretarial job at a law firm[27][25] and studied business at New York's Baruch College for one semester.[23] At age 18, she enrolled as a full-time student at Manhattan's Phil Black Dance Studio, where she had already taken night classes in jazz and tap dance.[19][18][25] Her parents were unhappy with her decision to leave college to pursue a dance career.[23] Her mother asked her to move out of the family home and they stopped speaking for eight months.[23][28] López moved to Manhattan, sleeping in the dance studio's office for the first few months.[19][18][25]\n\nCareer\n\n1989–1996: Professional dancing and early acting roles\n\nLópez's first professional job came in 1989 when she spent five months touring Europe with the musical revue show Golden Musicals of Broadway. She was the only member of the chorus not to have a solo and later characterized it as a pivotal moment where she realized the importance of a \"tough skin\" in the entertainment business.[29][30] In 1990, she danced alongside MC Hammer in an episode of Yo! MTV Raps[31] and traveled around Japan for four months as a chorus member in Synchronicity.[25] When she returned to the United States, she was hired as a backup dancer for New Kids on the Block's performance of \"Games\" at the 1991 American Music Awards.[32] She also traveled around America with regional productions of the musicals Jesus Christ Superstar and Oklahoma![33] During this period, Lopez also danced in music videos including Doug E. Fresh's \"Summertime\", Richard Rogers' \"Can't Stop Loving You\", EPMD's \"Rampage\"[34] and Samantha Fox's \"(Hurt Me! Hurt Me!) But the Pants Stay On\".[35]\n\nLópez's most high-profile job as a professional dancer was as a Fly Girl jazz-funk dancer on the sketch comedy television series In Living Color. At the New York audition, the show's choreographer, Rosie Perez, noticed that Lopez had \"star quality\" and \"did not complain, not once\" when asked to repeatedly perform the dance routine.[36] López moved to Los Angeles in late 1991 for the job; she filmed In Living Color during the day and attended acting classes taught by Aaron Speiser at night.[25] The head of Virgin Records considered signing The Fly Girls as a girl group to rival the Spice Girls, but the deal fell apart.[30] After appearing as a Fly Girl in seasons three and four of In Living Color, López left to work as a backup dancer for Janet Jackson, and appeared in the music video for \"That's the Way Love Goes\".[37] She was scheduled to tour with Jackson on her Janet World Tour in late 1993 but opted to pursue an acting career instead.[38]\n\nLópez's first professional acting job was a small recurring role on the television show South Central (1994). She was invited to audition for the pilot by a casting director who had seen her speak to camera during a behind-the-scenes In Living Color segment.[25] López then acquired an agent and was cast in the CBS show Second Chances and its spin-off Hotel Malibu. She appeared in the direct-to-video drama film Lost in the Wild (1993).[39] For her first major movie role, in Gregory Nava's 1995 drama Mi Familia,[40] López received a nomination for the Independent Spirit Award for Best Supporting Actress.[40] Lopez then starred in the action comedy Money Train (1995). Kenneth Turan of the Los Angeles Times said she \"mostly holds her own\" with co-stars Wesley Snipes and Woody Harrelson,[41] while Stephen Holden of The New York Times praised her \"scene-stealing charm\".[42] In 1996, Lopez had a supporting role opposite Robin Williams in the comedy Jack.[43] She next starred opposite Jack Nicholson in the neo-noir thriller Blood and Wine (1997).[44] David Rooney of Variety felt López delivered in \"juggling\" the \"smoldering and soulful sides\" of the character[45] but Lisa Schwarzbaum of Entertainment Weekly said she was \"used as a place marker rather than as a real girl.\"[46]\n\n1997–2002: Movie and pop stardom\n\nWith her casting as the singer Selena Quintanilla-Pérez in the biopic Selena (1997), López became the first Latina actress to earn $1 million. She was excited by the rare opportunity to \"actually star\" in a movie \"in the title role\"[47] but expressed disappointment that other Latina actors were not being afforded the same opportunities.[48] Despite having previously worked with the film's director Gregory Navq on Mi Familia, López participated in an intense auditioning process[49] and spent time with the late singer's family in Corpus Christi, Texas before filming began.[50] Roger Ebert of the Chicago Sun-Times described it as \"a star-making performance\" and particularly enjoyed the onstage scenes: \"She has the star presence to look convincing in front of 100,000 fans.\"[51] Kenneth Turan of the Los Angeles Times praised the \"incandescent\" performance.[52] López received her first Golden Globe nomination for the performance.[53] The director later said he asked the heads of Warner Bros. to fund an Academy Award campaign for López but was told the academy would \"never nominate a Latina.\"[54] Later in 1997, López starred opposite Ice Cube in the horror film Anaconda.[55] While Joe Leydon of Variety found Anaconda \"silly\", he said the film deserved \"a little credit\" for being \"the first movie of its kind to have a Latina and an African-American\" as its stars.[56] In the crime film U Turn (1997),[57] López appeared topless in a sex scene that was added by director Oliver Stone during filming. Speaking in 2003, López said it was not something \"I would have chosen to do\" and that she and Stone fought over it: \"It's hard being the only woman on a set ... But it actually worked in the movie.\"[58]\n\nLópez starred opposite George Clooney in the crime caper Out of Sight (1998), Steven Soderbergh's adaptation of the Elmore Leonard novel of the same name.[59] Cast as a deputy federal marshal who falls for a charming criminal, López won rave reviews for her performance.[60] Janet Maslin of The New York Times described it as her \"best movie role thus far, and she brings it both seductiveness and grit; if it was hard to imagine a hard-working, pistol-packing bombshell on the page, it couldn't be easier here.\"[61] Turan of the Los Angeles Times described López as \"an actress who can be convincingly tough and devastatingly erotic\" and said the film solidified \"her position as a woman you can confidently build a film around.\"[62] Ebert of the Chicago Sun-Times was impressed by the \"rich comic understanding\" Lopez brought to the role and enjoyed the \"repartee\" between her and Clooney: \"These two have the kind of unforced fun in their scenes together that reminds you of Bogart and Bacall.\"[63] In 2021, Peter Bradshaw of The Guardian named Lopez and Clooney's partnership as one of the best examples of on-screen chemistry in cinema history.[64] Also in 1998, Lopez provided the voice of Azteca in the animated film Antz.[65]\n\nLópez launched a music career in 1999 because, after Selena, she had missed \"the excitement of the stage\"[30] and was \"really feeling [her] Latin roots\".[66] Lopez's new manager Benny Medina sought to position her as \"a brand name that will cross over into all media.\"[30] Lopez recorded a Spanish-language demo for circulation among prospective labels. Tommy Mottola, the head of Sony Music's Work Group, signed her but suggested that she sing in English instead.[67] Her debut album On the 6, named after the 6 Subway line which connected her childhood home in the Bronx to Manhattan,[68] was filled with what Ed Morales of the Los Angeles Times described as \"state-of-the-art dance pop ... even if Lopez's vocals are largely anonymous.\"[30] The album was a success and Lopez's debut single, \"If You Had My Love\", topped the Billboard Hot 100,[69] with another single, \"Waiting for Tonight\", reaching number eight. In 2000, Lopez and then-boyfriend Sean Combs attended the Grammy Awards, with Lopez wearing a plunging green Versace silk chiffon dress.[70] The dress generated worldwide attention and became the most popular search query in Google's history,[71] leading to the creation of Google Images.[72] Lopez returned to the big screen in 2000, starring in the psychological thriller The Cell. David Edelstein of Slate remarked that the \"imperious\" Lopez was \"trying to look waifishly expectant\"[73] while Amy Taubin of The Village Voice noted that she appeared to be engaged \"in some kind of pouting competition\" \"in lieu of acting.\"[74]\n\nLopez became the first woman to have a number one film and album simultaneously when, in early 2001, the romantic comedy The Wedding Planner, co-starring Matthew McConaughey, and her sophomore album J.Lo were released in the same week.[75] In a review of The Wedding Planner, Bob Graham of the San Francisco Chronicle remarked that, while there was \"no doubt of Lopez's screen poise or acting chops\", she should choose comedic projects with \"more bite.\"[76] Jessica Winter of The Village Voice found her \"bewilderingly miscast\" as a \"buttoned down, celibate\" woman, writing that the movie \"achieves the dubious but perversely impressive feat, for its 90-minute duration, of neutering Jennifer Lopez.\"[77] The album J.Lo received mixed reviews. Jon Pareles of Rolling Stone was unimpressed by her \"merely adequate, studio-assisted voice\": \"While dance pop doesn't necessarily demand great singers, Lopez is just scraping by.\"[78] J.Lo ultimately became the best-selling release of her career, and included the singles \"Love Don't Cost a Thing\" and \"I'm Real\", the latter of which reached number one in the US.[80] In other 2001 work, Lopez launched her first business venture, the clothing line J.Lo by Jennifer Lopez,[81] and starred opposite Jim Caviezel in the romantic drama Angel Eyes.[82] Lopez's performance was well-reviewed,[83][84] with Mick LaSalle of the San Francisco Chronicle describing her as \"an actress who can do things other movie stars can't do. She doesn't push, just thinks, and her thoughts and emotions burn into the film.\"[85]\n\nThe romantic comedy Maid in Manhattan (2002), in which Lopez starred opposite Ralph Fiennes, became the highest-grossing film of her career.[86] Reviewing Maid in Manhattan, A. O. Scott of The New York Times enjoyed Lopez as a romantic lead and said \"her greatest skill as an actress -- and the key to her brain-addling sexiness -- may be her ability to melt without cracking the hard shell of composure she wears.\"[87] She starred as an abused wife seeking revenge in the thriller Enough.[88] An overworked Lopez suffered a nervous breakdown in 2001 while filming it.[89] Upon its release in 2002, Ebert of the Chicago Sun-Times was unimpressed by the \"tacky material\" and was surprised to see \"an actress like Jennifer Lopez\" involved with the project.[90] Nathan Rabin of The A.V. Club said \"the film's idiocy works for Lopez: Every diva needs at least one camp classic on her résumé\".[91]\n\nLopez released two albums in 2002. The first was a remix album, J to tha L–O! The Remixes, featuring rappers Ja Rule, 50 Cent, Fat Joe and P Diddy. It debuted at number one on the Billboard 200,[92] with its lead single Ain't It Funny (Murder Remix)\" reaching the top of the Billboard Hot 100.[93] Lopez's third studio album, This Is Me... Then, was released in late 2002. Jon Caramanica of The Village Voice was unimpressed by her studio-enhanced vocals and expressed bemusement as to how the \"mega-millionaire Bronx-expat public-fantasy bombshell\" was \"making the least interesting music on the pop charts today.\"[94] Despite having the highest opening sales of Lopez's career, the album charted at number six on the Billboard 200.[95] The album's lead single \"Jenny from the Block\", peaked at number three on the Billboard Hot 100 while its second single, \"All I Have\", reached number one. In 2002 business ventures, Lopez opened Madre's, a Los Angeles restaurant serving Latin cuisine,[96] and released her first fragrance, Glow by JLo. It became the top-selling fragrance in the US,[97] and Lopez ultimately released over 18 fragrances as part of a licensing deal with Coty.[98]\n\n2003–2010: Box-office failures and declining record sales\n\nLopez arriving at the MTV Video Music Awards in 2004\n\nLopez became the subject of widespread media criticism in 2003 due to her public relationship with Affleck and the tabloid depiction of her as a demanding diva. The Guardian published an article exploring her \"bilious\" media coverage, with journalist Lawrence Donegan positing that \"indefensible\" misogyny and racism were to blame for her position as \"the most vilified woman in modern popular culture\".[99] Lopez fired both her personal manager Benny Medina and her publicist in mid-2003; The New York Times reported that movie executives had become frustrated by having their communications with Lopez \"largely filtered\" through Medina.[100]\n\nLopez starred opposite Affleck in the romantic comedy Gigli (2003), which was a box-office bomb and is considered one of the worst films of all time.[86][101][102] Rex Reed of The Observer criticized the lead actors, writing that the film reminds the world how \"pathetically incompetent they both are in the only two things that matter in career longevity - craft and talent.\"[103] Roger Ebert agreed that the movie \"doesn't quite work\", but found Lopez and Affleck \"appealing in their performances\" and noted that they \"have chemistry\" together.[104] Lopez had a minor role opposite Affleck in the film Jersey Girl (2004). Following test audiences' negative reactions to the onscreen couple, Lopez's screen time was halved.[105] Lopez later described this as the lowest point of her career[106] and admitted she felt \"eviscerated\" by the media coverage surrounding Gigli: \"I lost my sense of self, questioned if I belonged in this business, thought maybe I did suck at everything. And my relationship self-destructed in front of the entire world. It was a two-year thing for me until I picked myself up again.\"[107] She became the face of a Louis Vuitton advertising campaign,[108] launched her second fashion label, Sweetface,[75][109] and starred opposite Richard Gere in the romantic comedy-drama Shall We Dance?, which was a box-office success.[86]\n\nThe marketing for the romantic comedy Monster-in-Law (2005), in which Lopez starred opposite Jane Fonda, played up her \"Gigli-and-tabloid tarnished image\", and it became a box office success.[110][86][111] She released her fourth studio album, Rebirth, in early 2005.[112] It was recorded during a period where Lopez felt \"a little bit lost, trying to get my footing in a new life\": \"I had just gotten married [to singer Marc Anthony] ... I wasn't with Benny [Medina].\"[113] Alexis Petridis of The Guardian remarked that the album title \"suggests even Lopez has realised that something is amiss with her career ... Despite the highlights, you're still left pondering the question: what happened to Jennifer Lopez?\"[114] While the album reached number two on the Billboard 200 and its lead single \"Get Right\" charted at number twelve on the Billboard Hot 100, the second and final single \"Hold You Down\" peaked at number 64.[115] She returned the Billboard Hot 100 the following year, at number four, when she was a featured artist on \"Control Myself\", the lead single from LL Cool J's twelfth studio album.[116]\n\nLopez's next three movie projects were box office failures. She starred alongside Robert Redford and Morgan Freeman in the drama An Unfinished Life (2005). Ebert of the Chicago Sun-Times predicted that the typical review would be unkind: \"It will have no respect for Jennifer Lopez, because she is going through a period right now when nobody is satisfied with anything she does ... Give Lopez your permission to be good again; she is the same actress now as when we thought her so new and fine.\"[117] In 2006, she reunited with Gregory Nava, the director of both Mi Familia and Selena, to star in the crime drama Bordertown as a journalist investigating female homicides in Ciudad Juárez, Mexico.[118] The film was negatively reviewed and received a direct-to-video release.[86] David D'Arcy of Screen Daily found Lopez \"unconvincing\" as a journalist.[119] In 2007, she starred opposite her then-husband Marc Anthony in the music biopic El Cantante, which told the story of Puerto Rican salsa singer Héctor Lavoe and his wife Puchi.[120] It did not perform well at the box office[86] and received mixed reviews from film critics. Mick LaSalle of the San Francisco Chronicle considered it her \"most mannered, least relaxed and least convincing performance to date\".[121] Lopez later expressed particular pride in her work in the film.[122]\n\nLopez in 2008\n\nLopez released two studio albums in 2007. Her fifth album, Como Ama una Mujer, was her first to be recorded entirely in Spanish. Chris Willman of Entertainment Weekly acknowledged that the album offered \"fairly persuasive proof\" that Lopez can sing, but was unimpressed by the \"flaccid torch songs.\"[125] It reached number 10 on the Billboard 200;[126] the lead single \"Qué Hiciste\" reached number 86 on the Billboard Hot 100 while the second single \"Me Haces Falta\" failed to chart. Lopez's sixth studio album Brave, released later that year, was her lowest-charting album worldwide.[127] Jonathan Bernstein of Entertainment Weekly was disappointed that Lopez had returned to \"listless vocals\" for her \"back-to-the-dance-floor album.\"[128] The album debuted at number 12 on the Billboard 200[129] and produced two singles, \"Do It Well\" and \"Hold It Don't Drop It\". The first peaked at number 31 on the Billboard Hot 100 chart, while the latter failed to chart. While pregnant with twins, Lopez embarked upon her first ever concert tour, a show co-headlined by Anthony, in September 2007.[130][131] She also created, produced and was featured in the MTV show DanceLife.[132]\n\nAfter giving birth to twins in February 2008, Lopez took a career break.[133] Her restaurant Madre's closed permanently,[96] as did her two fashion lines.[134] After rehiring former manager Medina,[135] Lopez released two songs in late 2009, \"Louboutins\" and \"Fresh Out of the Oven\". The songs were intended for her seventh studio album but failed to make an appearance on the Billboard charts, leading to her departure from Sony Music and Epic Records.[136] Lopez's first theatrical role in three years was in the romantic comedy The Back-up Plan (2010).[133] Manohla Dargis of The New York Times was unimpressed by the movie and described Lopez as \"an appealing screen presence with a disappointing big-screen track record. That's probably not all her fault: romantic roles for women often are the provenance of the bland or the blonde.\"[137]\n\n2011–2018: American Idol and Las Vegas residency\n\nA \"big turning point\" in Lopez's career came in 2011, when she joined the judging panel of the singing competition series American Idol.[138] She accepted the job at a time when she was \"not getting offered a whole bunch of movies\"[138] and the show returned her to prominence. Hannah Elliot of Forbes described it as \"a remarkable comeback\": \"Idol humanized her. Viewers who knew only an attention-grabbing siren met a hardworking, self-made, empathetic single mother, who got emotional when contestants did well and when they failed.\" She returned as a judge for the eleventh season, earning a reported $20 million,[139] and again for the thirteenth season, earning a reported $17.5 million.[140] She became a brand ambassador for L'Oréal,[141] Venus[142] and Fiat,[143] and launched the Jennifer Lopez Collection, a clothing and homeware line with Tommy Hilfiger for Kohl's.[144][145]\n\nAfter signing a new recording contract with Island Records, Lopez's seventh studio album, Love?, was released in early 2011.[146][147] While the album itself was a moderate commercial success,[127] the single \"On the Floor\" was one of the year's most successful songs.[148] It reached number three on the Billboard Hot 100, becoming her highest-charting single as a lead artist since \"All I Have\".[149] Lopez's greatest hits album, Dance Again... the Hits, was released in mid-2012[150] to fulfil her contractual obligations with her former label Epic Records.[151] Lopez, who was divorcing Anthony and navigating the \"breakup of a family\", felt as if the album's sole single, \"Dance Again\", had come to her at the \"perfect moment\".[152][153] \"Dance Again\" reached number 17 on the US Billboard Hot 100. Lopez launched the Dance Again World Tour, her first headlining concert tour, in mid-2012.[154] It grossed over $1 million per show.[155] Also that year, she launched Teeology, a luxury T-shirt brand.[156]\n\nLopez returned to the big screen in 2012, starring alongside an ensemble cast in the film What to Expect When You're Expecting, which is based on the book of the same name.[157] Lopez voiced Shira, a saber tooth tiger, in the animated film, Ice Age: Continental Drift, the fourth film in the Ice Age franchise.[158][159] Also in 2012, a talent show, ¡Q'Viva! The Chosen[160] followed Lopez, Anthony, and director-choreographer Jamie King as they travelled across 21 countries in Latin America to find new talent for a Las Vegas show. In 2013, Lopez starred alongside Jason Statham in the crime thriller Parker, in which she played Leslie. Her performance earned positive reviews, with Chicago Tribune commending the role for giving Lopez \"an opportunity to be dramatic, romantic, funny, depressed, euphoric and violent. The audience stays with her all the way\".[161] Lopez became the chief creative officer of nuvoTV[162][163] and founded the mobile phone retail brand Viva Móvil.[164][165][166] She was an executive producer of the television series The Fosters.[167][168]\n\nLopez at the 25th GLAAD Media Awards in 2014\n\nLopez's eighth studio album, A.K.A., was released in mid-2014 through Capitol Records, experiencing lacklustre sales, becoming her lowest-selling album in the US.[169][170] The album produced three singles: \"I Luh Ya Papi\", featuring French Montana, \"First Love\", and \"Booty\", featuring Iggy Azalea. They reached 77, 87 and 18 respectively on the Billboard Hot 100. Also that year, Lopez released \"We Are One (Ole Ola)\", the official song for the 2014 FIFA World Cup along with Pitbull and Claudia Leitte. Lopez partnered with Endless Jewelry on a range of jewelry[171] and released a book, True Love, which became a New York Times best-seller.[172]\n\n2015 saw the release of The Boy Next Door, an erotic thriller that Lopez both co-produced and starred in as a high school teacher who becomes involved with a student, which eventually leads to his dangerous obsession with her.[173] The film received negative reviews from critics.[174] Despite this, it became her most successful opening at the box office for a live action film since Monster-in-Law.[175][176] Lopez had a voice role in the animated feature Home[177] and contributed the single \"Feel the Light\" to the film's official soundtrack.[178] Lopez also starred in the independent drama film Lila & Eve, alongside Viola Davis.[179]\n\nFrom 2016 to 2018, Lopez had a residency concert show, All I Have, at Planet Hollywood's Zappos Theater in Las Vegas.[180][181] She performed 120 shows during the three-year run, grossing over $100 million in ticket sales.[182][183] At the beginning of the residency, Lopez signed a multi-album deal with her former label Epic Records[184] but, the failure of A.K.A. and its poor sales, she opted to release standalone singles instead including \"Ain't Your Mama\",[185][186][187] \"Ni Tú Ni Yo\",[188][189]\"Amor, Amor, Amor\",[190] \"El Anillo\"[191] and \"Dinero\", featuring DJ Khaled and Cardi B.[192] The highest charting of these were \"Ain't Your Mama\" and \"Dinero\", reaching 76 and 80 respectively on the Billboard Hot 100, while the former's music video received over 800 million views on YouTube.[193] In collaboration with Giuseppe Zanotti, Lopez designed a capsule collection of shoes and jewelry[194] and, with Inglot Cosmetics, launched a limited-edition makeup collection.[195] With the release of \"Ni Tú Ni Yo\" and \"Amor, Amor, Amor\", Lopez planned to release her second spanish-language album Por Primera Vez, which was ultimately cancelled.[196]\n\nFrom 2016 to 2018, Lopez produced and starred in NBC's crime drama series Shades of Blue as Detective Harlee Santos, a single mother and police detective in New York City who goes undercover for the FBI to investigate her own squad.[197][198][199] Starring alongside the great Ray Liotta, Lopez's performance received positive reviews.[200][201][202][203][204][205] Lopez was executive producer and judge on NBC's successful series World of Dance.[206][207][208] Lopez reprised her voice role as Shira in the animated film Ice Age: Collision Course (2016).[209]\n\nIn 2018, Lopez was named one of Time's 100 most influential people in the world,[210] and starred in the comedy film Second Act, directed by Peter Segal; she also produced the film,[211] and recorded the single \"Limitless\" for its soundtrack.[212] Second Act earned mixed reviews from critics,[213] but performed well at the box office, grossing $72.3 million during its theatrical run.[214]\n\n2019–present: Hustlers, Super Bowl LIV halftime show and This Is Me... Now\n\nLopez performing during her It's My Party tour in July 2019\n\nLopez starred in the film Hustlers (2019), for which she also served as an executive producer, and which grossed over US$100 million in North American box office receipts alone. Directed by Lorene Scafaria, the film is inspired by a true story, following a group of Manhattan strippers who con wealthy men.[215][216] Lopez's portrayal of a veteran stripper in Hustlers garnered acclaim from critics, with some deeming it the best performance of her acting career.[217][218][219] The film also gave Lopez her highest opening weekend at the box office for a live action film (grossing $33.2 million),[220] and garnered her nominations for Best Supporting Actress at the Golden Globe Awards, Screen Actors Guild Awards, Critics' Choice Movie Awards and Independent Spirit Awards, but snubbed of a nomination at the Academy Awards.[221][222][223][224][225] The success of Hustlers has been regarded by various media outlets as a comeback as an actress for Lopez.[226][227][228] She was announced as the global face of the Coach brand[229] and launched a collection of sunglasses with the brand Quay Australia.[230] Also in September 2019, Lopez modeled an updated version of her Green Versace dress at Milan Fashion Week; her appearance generated $31.8 million in total media impact value.[231][232] She also became executive producer of the two television series, Good Trouble and Thanks a Million.[233]\n\nIn 2019, Lopez embarked on an international concert tour, It's My Party, to celebrate her 50th birthday; the tour grossed an estimated $54.7 million from thirty-eight shows.[234] In February 2020, Lopez co-headlined the Super Bowl LIV halftime show in Miami, Florida alongside Shakira; the performance included an appearance by her child Emme Muñiz.[235][236] The performance was widely praised and is currently the most-watched Super Bowl halftime show to date.[237][238] In June 2020, she appeared in YouTube Originals's special, Dear Class of 2020, which featured a virtual commencement event and highlighted the George Floyd protests.[239] By the end of the year, Lopez headlined the 2021 Dick Clark’s New Year’s Rockin’ Eve with Ryan Seacrest special on ABC.[240][241] In January 2021, she performed at the 2021 inauguration of President Joe Biden in Washington, D.C., where she sang \"This Land Is Your Land\" and \"America the Beautiful\", while also reciting the last phrase of the Pledge of Allegiance in Spanish.[242][243] She also released a number of singles between 2019 and 2021, including: \"Medicine\" featuring French Montana,[244] \"Pa' Ti + Lonely\" with Maluma[245] and \"Cambia el Paso\" with Rauw Alejandro.[246] In January 2021, Lopez launched her skincare line, JLo Beauty.[247]\n\nIn mid-2021, Lopez signed a multi-year deal with Netflix to produce a range of films and television shows through her own Nuyorican Productions.[248] Lopez co-produced and starred opposite Owen Wilson and Maluma in the romantic comedy Marry Me, which was filmed in late 2019 and released in February 2022.[249] The film grossed over $50 million at the box office[250] while becoming the most-streamed day-and-date film on Peacock,[251] and received generally mixed reviews from critics.[252][253] Lopez also released a soundtrack for the film, with Maluma, which generated the singles \"On My Way\" and \"Marry Me\"; the former won the 2023 MTV Movie & TV Award for Best Song.[254] The soundtrack received mixed reviews.[255] In March 2022, Lopez was appointed as the chief \"entertainment and lifestyle\" officer of cruise line, Virgin Voyages.[256] Later that month, she performed \"On My Way\" and her 2005 single \"Get Right\" in connection to her receiving the Icon Award at the 2022 iHeartRadio Music Awards; her performance featured Billy Porter and some of the queens from RuPaul's Drag Race.[257] Her next project was the documentary Jennifer Lopez: Halftime (2022), which focuses on Lopez's life following the release of Hustlers and in preparation for her 2020 Super Bowl performance.[258] The film premiered at the Tribeca Film Festival in June 2022 and was released on Netflix shortly after;[259] it garnered positive reviews from film critics.[260] In September, Lopez was announced as the global ambassador of Italian lingerie label Intimissimi.[261] The following month, Jimmy Fallon and Lopez released a children's book, Con Pollo: A Bilingual Playtime Adventure, which became a New York Times best-seller.[262][263]\n\nLopez co-produced and starred opposite Josh Duhamel and Jennifer Coolidge in the action-comedy Shotgun Wedding, filmed in the Dominican Republic; it was released on Amazon Prime Video on January 27, 2023.[264] In March, she announced a collaboration between her lifestyle brand J.Lo by Jennifer Lopez and fashion retailer Revolve.[265] A footwear line, JLO Jennifer Lopez, was released as three collections in March, May and June; it consisted of kitten heels, sandals, boots, stilettos and platforms.[266] In April, she launched her own spritz brand, Delola.[267] Lopez led and co-produced the action thriller feature The Mother, directed by Niki Caro. Filmed in Canada and Gran Canaria,[268] it was released on Netflix in May 2023.[269][270] In September 2023, she entered a \"recording and publishing\" partnership with BMG Rights Management, in conjunction with her Nuyorican Productions.[271] Lopez and Intimissimi released a collaborative capsule collection of lingerie titled after her upcoming ninth studio album in October.[272]\n\nLopez's ninth studio album This Is Me... Now, a follow-up and \"sister album\" to This Is Me... Then (2002), will be released by Nuyorican and BMG on February 16, 2024.[273] A musical short film directed by Dave Meyers, produced by Nuyorican, and distributed by Amazon MGM Studios will be released as a visual companion to the album on Prime Video on the same day.[274] Her first studio album in nearly a decade, Lopez described it as an \"emotional, spiritual, and psychological journey\" of the past two decades;[275] she stated that her reunion and marriage to former ex Ben Affleck—who is also a co-writer[276] for the film—inspired her to write honest music.[277] The record was previously slated for a summer 2023 release,[278] and was announced on the 20th anniversary of This Is Me... Then.[279] The album's lead single, \"Can't Get Enough\" will be released on January 10, 2024.[280]\n\nUpcoming projects\n\nLopez filmed the sci-fi thriller Atlas from September to November 2022 in L.A. and New Zealand, her third project under her Netflix deal.[281][282] She will star alongside Jharrel Jerome in the biographical wrestling drama Unstoppable, produced by Ben Affleck and based on the life of wrestler Anthony Robles.[283][284] Production began in May 2023 but was put on hold till the end of the 2023 Writers Guild of America strike in September.[285] Lopez has also committed to lead and co-produce Netflix's film adaptation of the bestselling novel, The Cipher.[286][287] She has several projects in the works as a producer.[288][289]\n\nPersonal life\n\nLopez was in a nearly decade-long relationship with David Cruz, her high school boyfriend, until the mid-1990s.[290] She would later say of Cruz, \"You get lucky, you have a first love like that.\"[291] She was married to Cuban waiter Ojani Noa from February 1997 to January 1998. In subsequent court cases, Noa was prevented from publishing a book about their marriage[292][293] and from using private honeymoon footage of Lopez in a documentary.[294][295] Lopez was in an on again–off again relationship with record producer and rapper Sean Combs (then known as \"Puff Daddy\") from 1999 to early 2001.[296][297] On the night of December 27, 1999, Lopez and Combs were arrested and charged with criminal possession of a weapon and possession of stolen property, after leaving the scene of a shooting at a Times Square nightclub. Charges against Lopez were dropped within an hour[298] while Combs was acquitted of all charges at trial in early 2001.[299] They broke up shortly thereafter.[23] Lopez later said that, while she had \"cared very much\" about Combs, their \"crazy, tumultuous\" relationship \"was always something I knew would end.\"[300][23] She was married to Cris Judd, her former backup dancer, from September 2001 to January 2003.[301]\n\nBefore her divorce with Judd was finalized, Lopez was in a relationship with actor and filmmaker Ben Affleck from mid-2002 to early 2004. Although they had crossed paths several times before (including at the 70th Academy Awards and at the premiere of Armageddon,[302] both in 1998), the first major meeting was on the set of Gigli (2003) in December 2001.[303][304] They later worked together on the music video for \"Jenny from the Block\" and the film Jersey Girl (2004).[305][306] Her album This Is Me... Then was dedicated to and inspired by Affleck. Their relationship was extensively publicized.[307] Tabloids referred to the couple as \"Bennifer\", a portmanteau Vanity Fair described as \"the first of that sort of tabloid branding\".[308] They became engaged in November 2002,[309][310] but their planned wedding on September 14, 2003, was postponed with four days' notice because of \"excessive media attention\".[311][312] They ended their engagement in January 2004.[313] Years later, Lopez said Affleck's discomfort with media scrutiny was one reason for their split[23][314] and described it as her \"first real heartbreak\": \"I think different time, different thing, who knows what could've happened, but there was a genuine love there.\"[315][316]\n\nLopez and Anthony, 2006\n\nLopez was married to singer Marc Anthony from June 2004 to June 2014;[317][318] they had previously worked together and dated for a few months in the late 1990s.[23][319] Their wedding took place five months after the end of her relationship with Affleck. During their marriage, they collaborated on music and performed together, as well as co-starring in El Cantante (2006).[320] Lopez gave birth to fraternal twins, a boy and a girl, on Long Island in February 2008.[321][322] People paid a reported US$6 million for the first photographs of the twins, making them the most expensive celebrity pictures ever taken at the time.[323] In 2009, Anthony and Lopez purchased a stake in the Miami Dolphins.[324] The couple announced their separation in July 2011. Anthony filed for divorce in April 2012[325] and it was finalized in June 2014. Lopez retained primary physical custody of the two children.[326][327] Lopez occasionally performs with her daughter.[328][329][330][331]\n\nLopez had an on again-off again relationship relationship with her former backup dancer Casper Smart from October 2011 to August 2016.[332][333] She dated New York Yankees baseball player Alex Rodriguez from February 2017 to early 2021.[334][335][107] They became engaged in March 2019[336] but postponed their wedding twice due to the COVID-19 pandemic. In response to tabloid speculation about the state of their relationship, they released a statement in March 2021, saying they were \"working through some things\".[337] They announced the end of their relationship in April 2021.[338]\n\nIn April 2021, Lopez and Affleck were reported to be dating again,[339] with Lopez publicly confirming their rekindled relationship that July.[340] In the years after their breakup, they had remained in contact and spoken highly of each other in the press.[341][342][343][344][345] Both Affleck and Lopez have spoken of the gift of a second chance with each other since reuniting.[346][347][348] On April 8, 2022, Lopez announced their second engagement, 20 years after the first proposal.[349][350] They were married in Las Vegas on July 16, 2022.[351][352] The following month, they held a wedding celebration for family and friends.[353][354]\n\nPhilanthropy\n\nFollowing the September 11 attacks, Lopez was heavily involved in charitable activities. Joining various other artists, she was featured on charitable singles such as \"What's Going On\" and \"El Ultimo Adios (The Last Goodbye)\", which benefited people affected by the tragedy.[356][357] One dollar from each ticket sold at Lopez and Anthony's co-headlining North American concert tour, which grossed an estimated $10 million, was donated to Run for Something Better—a charitable organization supporting physical fitness programs for children.[131][358] In February 2007, Lopez was honored with the Artists for Amnesty prize by the human rights organization Amnesty International, for her work in the film Bordertown, which shed light on the hundreds of feminicides in Ciudad Juárez. Lopez described it as \"one of the world's most shocking and disturbing, underreported crimes against humanity\".[359][360]\n\nSince early in her life, Lopez has supported children; her album Rebirth (2005) is dedicated to Paige Peterson,[361] an eleven-year-old cancer patient whom Lopez befriended during visits to the Children's Hospital Los Angeles. Peterson died in November 2004. Lopez stated that \"[she doesn't] like to do [her] charity work in public. That's not what you do it for.\"[362] Having had plans to create a charitable foundation for years,[363] she eventually launched the Lopez Family Foundation (originally known as the Maribel Foundation) alongside her sister, Lynda, in 2009. The nonprofit organization seeks to increase the availability of healthcare for underprivileged women and children, offering a telemedicine program supported by a partnership with the Children's Hospital Los Angeles. The foundation has led to the expansion of medical facilities in Panama and Puerto Rico, and created the Center for a Healthy Childhood at the Montefiore Medical Center in the Bronx.[364][365]\n\nIn December 2012, Lopez held a charity drive that would affect her three favorite charities: the Gloria Wise Boys and Girls Club, the Children's Hospital of Los Angeles as well as the American Red Cross, mainly benefiting victims of Hurricane Sandy, which devastated parts of her hometown, New York City.[366] In May 2015, she became the first national celebrity spokesperson for the Children's Miracle Network Hospitals and the BC Children's Hospital Foundation (BCCHF), appearing in a campaign entitled \"Put Your Money Where the Miracles Are\".[367] That September, Lopez was announced as the first Global Advocate for Girls and Women at the United Nations Foundation.[368] This role sees her mobilizing action to address challenges faced by girls and women around the world, including maternal health care programs, education and violence against women.[369] In September 2017, following Hurricane Irma and Hurricane Maria, Lopez announced that she would be donating $1 million from the proceeds of her Las Vegas residency to humanitarian aid for Puerto Rico.[370][371] Along with ex-husband Marc Anthony, she launched a humanitarian relief campaign entitled Somos Una Voz (English: We Are One Voice), an effort supported by various celebrities to rush supplies to areas affected by Hurricane Maria.[372] Lopez and Anthony presented a subsequent concert and telethon for disaster relief, \"One Voice: Somos Live!\", which raised over $35 million.[373] She was also among various artists featured on Lin-Manuel Miranda's charity single \"Almost Like Praying\" which benefits Puerto Rico.[374]\n\nAs of 2021, Lopez continues to regularly donate and support charities.[375] In September 2021, she launched her own philanthropic organization, Limitless Labs, that supports and empowers Latina entrepreneurs and business owners. Lopez announced a partnership between the venture and the 10,000 Small Businesses initiative.[376] In June 2022, Lopez partnered with nonprofit Grameen America as a national ambassador to financially empower women-led Latina businesses: \"She'll join the organization [...] in concert with her own Limitless Labs, which aims to support Latina-owned small businesses\". Lopez and the organization explained their collective goal: to \"empower Latina entrepreneurs across 50 U.S. cities with $14 billion in business capital and 6 million hours of financial education and training by 2030.\"[377][378]\n\nLopez has performed at charity concerts throughout her career. In 2022, Lopez headlined the Los Angeles Dodgers Foundation's star-studded 6th Annual Blue Diamond Gala. The event raised a record-breaking $3.6 million to support LADF in their mission to improve education, health care, homelessness, and social justice for all Angelenos.[379]\n\nPolitical views\n\nLopez is a supporter of the Democratic Party, and has a long history of backing Democratic candidates for public office.[380] Lopez is also an avid supporter of LGBT rights, and has raised millions of dollars for HIV/AIDS research.[381] In June 2013, amfAR presented Lopez with its humanitarian award for her philanthropic work.[381] That September, she was awarded the Ally for Equality award presented by the Human Rights Campaign, for her support of the LGBT community.[382] The following year, she received the GLAAD Vanguard Award.[383] In July 2016, Lopez released a single entitled \"Love Make the World Go Round\", a collaboration with Lin-Manuel Miranda, which benefits victims of the Orlando nightclub shooting.[384] She was also featured on the song \"Hands\" along with numerous other artists, also benefiting those affected by the Orlando shooting.[385] Among numerous other artists, Lopez signed an open letter from Billboard magazine to the United States Congress in 2016, which demanded action on gun control.[386]\n\nLopez endorsed President Barack Obama in his 2012 presidential campaign, speaking in television advertisements and attending a fundraising event for Obama in Paris.[387][388] She endorsed Democratic presidential nominee Hillary Clinton in 2016, headlining a free concert in Florida in support of her that October.[388][389] In June 2020, Lopez attended a Black Lives Matter movement protest in Los Angeles, in connection with the broader George Floyd protests.[390] Lopez has also been an active advocate for the Time's Up movement.[391] She endorsed President Joe Biden in his 2020 presidential campaign and also performed at his 2021 inauguration in Washington, D.C.[392][393] In January 2022, she became one of the Co-Chairs for Michelle Obama's When We All Vote.[394]\n\nArtistry\n\nInfluences and musical style\n\nLopez cited Madonna as her \"first big musical influence\"\n\nLopez has cited Madonna as her \"first big musical influence\", explaining \"It was all about Madonna for me. She inspired me to want to sing, to dance, to work hard.\"[395][396] Other \"big influences in [her] life\" include Tina Turner, Whitney Houston, James Brown, and Michael Jackson.[397][398] Growing up, she was influenced by Latin music styles ranging from salsa to bachata, and artists including Celia Cruz and Tito Puente. It was the 1979 hip hop song \"Rapper's Delight\" by The Sugarhill Gang that she said changed her life.[399] She was also \"hugely inspired in her youth\" by Rita Moreno's performance in the 1961 musical film West Side Story,[400] noting that she \"was Puerto Rican\" like herself at a time when that was rare in Hollywood.[222] Speaking of musicals being an essential influence, she has said that, \"musicals were a part of the tapestry of my childhood,\" and crediting her mom, saying: \"My mom was also the mom who got me into musicals and introduced me to all kinds of music. I am an entertainer because of my mom.\"[291][401] Another major influence on Lopez is Barbra Streisand, stating that, \"watching her career over the years, watching her sing and act and direct, was very inspiring to me.\"[222] Lopez has cited Janet Jackson as a major inspiration for her own dance and videos, stating that she \"probably started dancing\" because of Jackson's music video for \"The Pleasure Principle\".[402][403] She has said that she also looks to the careers of Cher and Diana Ross,[404] and has been influenced by younger artists such as Lady Gaga.[402][405]\n\nAccording to author Ed Morales in The Latin Beat: The Rhythms And Roots Of Latin Music From Bossa Nova To Salsa And Beyond (2003), Lopez's music explores the \"romantic innocence\" of Latin music, while strongly identifying with hip hop.[408] Her debut album On the 6 fuses the influence of Latin music with R&B and hip hop, which Lopez described as Latin soul. To the contrary, Morales described it as \"state-of-the-art dance pop\".[400] Dee Lockett, writing for the Chicago Tribune, stated that songs such as \"Waiting for Tonight\" made Lopez \"arguably the leading artist in the dance-pop movement at the time\".[409] While primarily sung in English, she speaks in Spanish and asserts her Latin heritage throughout the album, which is apparent in the song \"Let's Get Loud\".[410][411][412] She has also recorded bilingual songs, including the Latin pop song \"Cariño\", for her second album J.Lo.[413] A departure from her previous albums, This Is Me... Then blends 1970s soul with \"streetwise\" hip hop.[414]\n\nDescribed as autobiographical,[415] much of Lopez's music has centered around the \"ups and downs\" of love.[416] The lyrical content of This Is Me... Then is largely focused on her relationship with Ben Affleck, with the song \"Dear Ben\" being described as the album's \"glowing centerpiece\". The two Ben inspired songs \"I'm Glad\" and \"Baby I Love U!\" becoming even more meaningful to the Bennifer story with time.[417] Her first full-length Spanish-language album, Como Ama una Mujer features introspective lyrics about romance, heartache and self-loathing.[418] When explaining her seventh studio album Love?, Lopez stated: \"There's still so much to learn and that's why the question mark.\"[416] Other recurrent themes in Lopez's music have included her upbringing in the Bronx[400][419] and women's empowerment.[420]\n\nSome critics have considered Lopez's voice to be limited,[421][422] and overshadowed by the production of her music, while remaining \"radio-friendly\".[423] Rob Sheffield of Rolling Stone remarked: \"Instead of strained vocal pyrotechnics, Lopez sticks to the understated R&B murmur of a round-the-way superstar who doesn't need to belt because she knows you're already paying attention ... She makes a little va-va and a whole lot of voom go a long way.\"[424] Meanwhile, AllMusic's Stephen Thomas Erlewine called her voice \"slight\" and wrote: \"Lopez was never, ever about singing; she was about style\".[425] Entertainment Weekly criticized her vocal performance for lacking the trademark \"husky-voiced voluptuousness\" she has in her films.[426] J. D. Considine of The Baltimore Sun regards Lopez as having a \"breathy\" stylistic range, but lacking personality.[427]\n\nDance and stage\n\nConsidered one of dance's \"greatest success stories\",[206] Refinery29 ranked Lopez at number two on \"11 Of Pop's Most Iconic Dancers\" in 2015.[428] Lopez felt an emotional connection to dance since her youth, when she specialized in ballet, jazz and flamenco.[429][430] Her career commenced on the variety television sketch comedy series In Living Color, where she was a part of an ethnically diverse dance group known as the Fly Girls.[431] Since beginning her music career, Lopez has become known for her body-emphasizing music videos, which often include dance routines.[432] CNN's Holly Thomas noted that \"Lopez's years of professional dance experience gave her a captivating, commanding presence in her videos.\"[433] Some of these videos have been the subject of controversy, including \"Jenny from the Block\", \"Dance Again\" and \"Booty\".[434][435] Her provocatively choreographed music video for \"If You Had My Love\" allowed Lopez to become a dominant figure on MTV networks worldwide.[436] Madeline Roth of MTV wrote: \"Her diverse videography encompasses some of the most memorable visuals of the 21st century\",[437] with Rolling Stone writer Brittany Spanos observing that her \"dancing skills and ability to toy with her own celebrity have made her videos an important part of the new millennium's pop canon\".[438]\n\nOn stage, Lopez is recognized for her showmanship and sex appeal,[439] and often includes costumes such as bodysuits as part of her performance.[440][441] Author Priscilla Peña Ovalle stated in Dance and the Hollywood Latina: Race, Sex and Stardom (2011) that Lopez was one of the Latin stars who \"used dance to gain agency as working performers with mainstream careers, yet many of their roles paradoxically racialized and sexualized their bodies\".[442] Troy Patterson of Entertainment Weekly also observed that she used her body for emphasis on stage, \"She turned herself out as the fly girl hyperversion of postfeminist power, flaunting her control by toying with the threat of excess. In consequence, her star went supernova.\"[443] Her signature movements include \"clock-wise pivoting with salsa hip circles and sequential torso undulations\".[444] While being noted to lip sync in the early stages of career, Lopez's Dance Again World Tour was praised for showcasing live vocals and choreography synchronously.[445][446][447] In a review of her Las Vegas residency All I Have, Los Angeles Times writer Nolan Feeney remarked that her dancing is \"undoubtedly the centerpiece of the show\".[439]\n\nLopez's provocative stage performances have also drawn scrutiny at times. In May 2013, her performance on the finale of the television series Britain's Got Talent was deemed inappropriate for family-friendly television, and drew viewer complaints to Ofcom.[448] Following her controversial performance at the musical festival Mawazine in 2015, Moroccan Prime Minister Abdelilah Benkirane called it \"indecent\" and \"disgraceful\", while an education group claimed that she \"disturbed public order and tarnished women's honor and respect\".[449]\n\nPublic image\n\nLopez wearing an updated version of her iconic green Versace dress at Milan Fashion Week in September 2019\n\nWriting of Lopez's image, Andrew Barker of Variety observed: \"Despite a carefully cultivated image as an imperious pop empress in ludicrously expensive outfits, her signature hits bear the titles 'I'm Real' and 'Jenny From the Block'. She managed the perilous transition from actress to music star without ever seeming to pick either as a primary gig. She established herself as an oft-provocative sex symbol while her demeanor made it abundantly clear that she's not asking you to come hither.\"[407] In 2002, Lynette Holloway of The New York Times described Lopez as overexposed. She wrote: \"Forgive yourself if you are seeing Jennifer Lopez in your sleep. She is everywhere.\" Holloway noted her image to be \"a dash of ghetto fabulousness\" and \"middle-class respectability\" for mass appeal.[450] Entertainment Weekly observed a change in her public profile upon joining American Idol in 2011, writing: \"Gone was her old cut-a-bitch swagger; J. Lo 2.0 is an all-embracing, Oprahfied earth madre.\"[451] Television presenter Ray Martin describes her as a \"showbiz phenomenon\".[452]\n\nLopez is widely celebrated for her callipygian figure.[453] She has been credited with influencing a change in mainstream female body image.[454] In Latin Sensations (2001), Herón Marquez wrote: \"Because she wasn't rail thin, Lopez had broken the mold and allowed millions of women to feel good about their bodies. Suddenly, it was okay for women to have hips, curves, and a big backside.\"[455] Vanity Fair described her buttocks as \"in and of themselves, a cultural icon\".[456] Details magazine named Lopez the \"Sexiest Woman of the Year\" in 1998,[457] and she topped FHM's \"100 Sexiest Women in the World\" list twice.[458] In 2011, she was named \"The Most Beautiful Woman\" by People.[459] The following year, VH1 ranked her the fourth on their list of \"100 Sexiest Artists\",[460] while Vibe magazine named her the most \"lustable\" celebrity of the past twenty years.[461] In 2014, Lopez stated, \"There's this funny notion in America that you can't be a mom and be sexy (...) It's the craziest thing I've ever heard... The truth is that women can be sexy until the day they die.\"[173] In Jennifer Lopez: Halftime (2022) she further said: \"I think, sometimes, as women, we think: 'if I'm too sexy I won't be taken seriously'; we're supposed to be celebrating women in every sense of who they are – smart, strong, sensual. You cannot just cancel out different parts of who you are. They can all coexist and be very authentic and real.\"\n\nLopez has been a tabloid fixture[462][463] and has admitted to having a \"less-than-perfect\" public image.[464] The media has drawn comparisons between Lopez and actress Elizabeth Taylor, due to her numerous failed relationships,[465] and Lopez has been dubbed a \"modern-day Liz Taylor\" by the media.[466][467] Lynn Hirschberg of W compared her glamorous public persona to that of Taylor.[468] Her style was described by Billboard's Lauren Savage as \"scantily clad\".[469] Lopez herself has said that she likes to \"look to the women who epitomize old Hollywood glamour, like Rita Hayworth,\" Ava Gardner and Marilyn Monroe for inspiration to her own style, but because she \"grew up in the Bronx,\" her style has \"a more urban, hip-hop influence\" as well.[470][471][472][473] Her sense of style continues to be a big part of her public image.[302][474][475][476]\n\nShe has received a bad reputation as being a demanding \"diva\",[477] something which she denies: \"I've always been fascinated by how much more well-behaved we have to be than men.\" Adding that, \"I got a moniker of being 'the diva,' which I never felt I deserved — which I don't deserve — because I've always been a hard worker, on time, doing what I'm supposed to do, and getting that label because you reach a certain amount of success.\"[478][479] In 2003, The Observer remarked that Lopez was \"the woman immortalised in a million headlines as 'Hollywood's most demanding diva' ... Lopez must wonder what heinous crime she has committed to become the most vilified woman in modern popular culture.\"[480] Actor and filmmaker Ben Affleck has observed the reason for her reputation as having something to do with racism and sexism: \"People were so fucking mean about her; sexist, racist, ugly vicious shit was written about her in ways that if you wrote it now, you would literally be fired for saying some of the things you said.\"[481]\n\nLegacy\n\nLopez is regarded as the most influential Latin entertainer of all time, credited with breaking ethnic barriers in the entertainment industry.[21][482][483] In 1999, Lopez said the \"responsibility\" of being a role model for the Latin community initially \"kind of scared me because you don't want to let anybody down and you don't want to do anything wrong ... I've always wanted to be the best that I can be and I think that's more what they look to, y'know, 'She's up there. She's doing it. She's from the same place we are.\"[484] In 1999, The Record newspaper observed that she was responsible for the introduction of a Latina presence in the film industry, which was a \"whites-only preserve\" for much of its history.[485] Described as a \"multidimensional artist who had turned into a financial powerhouse\",[486] Lopez became the highest-paid actress of Hispanic descent in history.[487] Miriam Jiménez Román stated in The Afro-Latin Reader: History and Culture in the United States (2009) that \"[she] was able to traverse the difficult racial boundaries\".[488] In 2012, business magazine Forbes suggested that Lopez \"may be the most powerful entertainer on the planet\",[489] and named her \"the world's most powerful Latino celebrity\".[490]\n\nUpon launching her music career in the late 1990s, Lopez contributed to the \"Latin explosion\" occurring in entertainment at the time.[491] Writing for The Recording Academy, Brian Haack described her as the \"breakout female star\" of the Latin pop movement in American music.[492] She was featured on the cover of the first issue of Latina magazine in 1996, with editor Galina Espinoza stating in 2011 that there is \"no recounting of modern Latina history without Jennifer\".[493] Around the time her career began to burgeon, the emphasis on Lopez's curvaceous figure grew; scholar Sean Redmond wrote that this was a sign of her role and social power in the cultural changes occurring in the United States.[494] In August 2005, Time listed Lopez as one of the most influential Hispanics in America, remarking: \"Why? Because over a decade ago, she was an anonymous background dancer on the second-rated sketch-comedy show. Today she's known by two syllables.\"[75] In February 2007, People en Español named her the most influential Hispanic entertainer.[482] In 2014, scientists named a species of aquatic mite found in Puerto Rico, Litarachna lopezae, after Lopez.[495][496]\n\nLopez is considered a global icon, and is often described as a triple threat performer.[497][498][499] VH1 ranked her at number 15 on their list of 200 Greatest Pop Culture Icons,[500] number 16 on 100 Greatest Women In Music,[501] and number 21 on 50 Greatest Women of the Video Era.[502] Lopez has been cited as an influence or inspiration by a range of entertainers, including Jessica Alba,[503] Adrienne Bailon,[504] Kat DeLuna,[505] Mike Doughty,[506] Fifth Harmony,[507] Becky G,[508] Selena Gomez,[509] Ryan Guzman,[510] Kelly Key,[511] Q'orianka Kilcher,[512] Demi Lovato,[513] Normani,[514] Rita Ora,[515] Pitbull,[516] Ivy Queen,[517] Francia Raisa,[504] Naya Rivera,[518] Bebe Rexha,[519] Rosa Salazar,[520] Gwen Stefani,[521] Taylor Swift,[522][523] Stooshe,[524] and Kerry Washington.[525]\n\nIn 2019, the Council of Fashion Designers of America presented her with its Fashion Icon Award for her \"long-standing and global impact on fashion\".[526] The Green Versace \"Jungle Dress\" that Lopez wore at the 42nd Annual Grammy Awards in 2000 was voted the fifth most iconic red carpet dress of all time in a poll run by The Daily Telegraph.[527] The images of Lopez wearing the dress became the most popular search query of all time at that point, and subsequently led to the creation of Google's image search.[528][529] Her style has influenced a range of celebrities, including Kelly Rowland, Kim Kardashian, and Jennifer Love Hewitt.[530][531][532] Her record-breaking fragrance line has become the most successful celebrity line in the world, with sales exceeding $2 billion as of 2012 .[533] Her first fragrance, Glow by JLo, has been credited with influencing the rise of celebrity fragrances in the 2000s,[534][535] with perfume critic Chandler Burr stating: \"Elizabeth Taylor was one of the first [to have her own scent], but Glow kicked the whole thing into overdrive.\"[536] Following the success of Lopez's appointment as a judge on American Idol in 2010, a trend of networks hiring \"big names\" for judging panels on reality shows ensued. The Hollywood Reporter branded this \"The J.Lo Effect\".[537]\n\nIn Tok Pisin, a language spoken in Papua New Guinea, the term palopa is used to describe non-heteronormative people whose identities may correlate with western definitions of homosexual men or trans women; its etymology is derived from the name Jennifer Lopez.[538][539]\n\nAchievements\n\nAs of 2022 , Lopez has sold more than 80 million records worldwide[540][541] and her films have grossed a cumulative total of US$3.1 billion.[542] She remains the only female entertainer to have a number one album and film simultaneously in the United States.[543][544] With her second studio album J.Lo (2001), Lopez became the first female solo recording artist under Epic Records to achieve a number one album in the United States since its inception in 1953.[545] Her album J to tha L-O! The Remixes was acknowledged by the Guinness World Records as the first number one remix album in the United States.[546] In 2010, Lopez was honored by the World Music Awards with the Legend Award for her contribution to the arts.[547] Lopez's return to prominence the following year with her single \"On the Floor\"—among the best-selling singles of all time, and its music video recognized as the \"Highest Viewed Female Music Video of All Time\" by Guinness World Records in 2012—is regarded as one of the greatest musical comebacks in history.[548][549] In 2013, she was presented with the prestigious landmark 2,500th star on the Hollywood Walk of Fame for her musical contributions,[550] and Univision presented her with the World Icon Award in its Premios Juventud.[551] In 2014, she became the first female recipient of the Billboard Icon Award.[552] Billboard magazine ranked her as the ninth greatest dance club artist of all time in 2016.[553] In 2017, she was awarded the Telemundo Star Award.[554] In 2018, Lopez received the Michael Jackson Video Vanguard Award at the 2018 MTV Video Music Awards, making her the first Latin performer to claim the prize since its introduction in 1984.[555] In 2022, she became the first person of Latin descent to receive the MTV Generation Award at the MTV Movie & TV Awards. She is also the first and only person in history to receive both the Michael Jackson Video Vanguard Award and MTV Movie & TV Awards' Generation Award for her accomplishments in music, film and television.[556]\n\nDiscography\n\nFilmography\n\nFilms starred\n\nBibliography\n\nLopez has written a memoir and co-written one children's book so far.\n\nTours and residencies\n\nHeadlining tours\n\nCo-headlining tours\n\nResidencies\n\nSee also\n\nReferences", "images": ["http://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Jennifer_Lopez_12%2C_2012.jpg/170px-Jennifer_Lopez_12%2C_2012.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/P071014AL-0257_%2815156063116%29_%28cropped%29.jpg/170px-P071014AL-0257_%2815156063116%29_%28cropped%29.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-tagline-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/8b/Jennifer_Lopez_with_Flag.jpg/170px-Jennifer_Lopez_with_Flag.jpg", "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg/1200px-210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/07/Jennifer_Lopez_at_GLAAD_Media_Awards_%28cropped%29.jpg/170px-Jennifer_Lopez_at_GLAAD_Media_Awards_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/1/17/ExpressYourselfUnderGround_cropped.jpg/170px-ExpressYourselfUnderGround_cropped.jpg", "http://upload.wikimedia.org/wikipedia/en/thumb/e/e7/Video-x-generic.svg/19px-Video-x-generic.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/9/96/Symbol_category_class.svg/16px-Symbol_category_class.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/ba/Flag_of_New_York_City.svg/21px-Flag_of_New_York_City.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0b/Jennifer_Lopez_Spring_Summer.jpg/170px-Jennifer_Lopez_Spring_Summer.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/73/BathingSuit1920s.jpg/21px-BathingSuit1920s.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Gnome-mime-sound-openclipart.svg/50px-Gnome-mime-sound-openclipart.svg.png", "https://login.wikimedia.org/wiki/Special:CentralAutoLogin/start?type=1x1", "http://upload.wikimedia.org/wikipedia/commons/thumb/2/28/Flag_of_Puerto_Rico.svg/21px-Flag_of_Puerto_Rico.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Flag_of_the_Hispanicity.svg/21px-Flag_of_the_Hispanicity.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg/10px-OOjs_UI_icon_edit-ltr-progressive.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/7e/Jennifer_Lopez_Live_during_Its_my_party_tour.jpg/170px-Jennifer_Lopez_Live_during_Its_my_party_tour.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/6/6c/Audio-input-microphone.png/19px-Audio-input-microphone.png", "http://en.wikipedia.org/static/images/footer/poweredby_mediawiki_88x31.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Jennifer_Lopez_Signature.svg/150px-Jennifer_Lopez_Signature.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/4/4a/Commons-logo.svg/30px-Commons-logo.svg.png", "http://upload.wikimedia.org/wikipedia/en/thumb/1/1b/Semi-protection-shackle.svg/20px-Semi-protection-shackle.svg.png", "http://en.wikipedia.org/static/images/icons/wikipedia.png", "http://en.wikipedia.org/static/images/footer/wikimedia-button.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/5/57/LA_Skyline_Mountains2.jpg/21px-LA_Skyline_Mountains2.jpg", "http://en.wikipedia.org/static/images/mobile/copyright/wikipedia-wordmark-en.svg", "http://upload.wikimedia.org/wikipedia/commons/thumb/b/bf/JenniferLopez.jpg/170px-JenniferLopez.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Wikiquote-logo.svg/34px-Wikiquote-logo.svg.png", "http://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg/220px-210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Time_100_Jennifer_Lopez_and_Marc_Anthony.jpg/220px-Time_100_Jennifer_Lopez_and_Marc_Anthony.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Jennifer_Lopez_2008.jpg/170px-Jennifer_Lopez_2008.jpg", "http://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/The_opening_ceremony_of_the_FIFA_World_Cup_2014_13_%28cropped%29.jpg/170px-The_opening_ceremony_of_the_FIFA_World_Cup_2014_13_%28cropped%29.jpg"], "top_img": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg/1200px-210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg", "keywords": [], "authors": [], "canonical_link": "https://en.wikipedia.org/wiki/Jennifer_Lopez", "title": "Jennifer Lopez", "meta_data": {"generator": "MediaWiki 1.42.0-wmf.5", "referrer": "origin-when-cross-origin", "robots": "max-image-preview:standard", "format-detection": "telephone=no", "og": {"image": {"identifier": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg/640px-210120-D-WD757-1975_%2850860511978%29_%28cropped%29.jpg", "width": 640, "height": 832}, "title": "Jennifer Lopez - Wikipedia", "type": "website"}, "viewport": "width=1000"}, "movies": [], "publish_date": null, "source": "http://en.wikipedia.org", "summary": ""}