{"url": "www.inquisitr.com/5001151/kylie-jenner-travis-scotts-friends-think-they-could-be-secretly-engaged-reports-hollywood-life/", "text": "Kylie Jenner and Travis Scott have been sparking engagement rumors online, and now their friends allegedly believe they may be ready to walk down the aisle as well.\n\nAccording to a July 24 report by Hollywood Life, Kylie Jenner and Travis Scott’s close friends and family members believe that the couple, who share one daughter together, Stormi Webster, may be hiding a secret engagement.\n\nSources tell the outlet that Jenner and Scott have not made any sort of announcement or dished about wedding plans to their closest friends and family members, but that they are very much in love and committed to their relationship. Insiders even revealed that Travis calls Kylie “wifey” and that they have been in a really good place in their relationship since the Keeping Up With the Kardashians star gave birth to their baby girl, Stormi, 6 months, back in February.\n\n“As far as everyone knows, Kylie and Travis aren’t engaged, but that doesn’t mean they couldn’t have gotten secretly engaged! He calls her wifey and she likes to call him daddy. They are majorly in love and committed to each other,” the sourced revealed about the couple’s relationship.\n\nMeanwhile, the insider adds that if Kylie Jenner and Travis Scott are engaged, they may keep the news a secret like they did with the pregnancy, as Travis values his privacy very much. “Travis is extremely private – he already struggles with the level of attention that comes with being a part of Kylie’s life. It’s something that takes a toll on the relationship at times, so they do try to keep as much of their lives as they can private,” the source stated.\n\nAs previously reported by the Inquisitr, Kylie Jenner and Travis Scott have talked about marriage, but the makeup mogul is allegedly “scared” of taking the next step. Sources claim that Jenner isn’t worried about getting married, but is leery of having a lavish wedding in the spotlight after watching her sisters Kim and Khloe Kardashian’s marriages fizzle out following televised wedding ceremonies.\n\n“Kylie is so happy with Travis, she’s madly in love with him and their baby girl. And he feels the exact same way, he worships Kylie. They do talk about getting married, but Kylie’s really scared. It’s not marrying Travis that scares Kylie, it’s all the attention that goes with it,” an insider said of Jenner and Scott.\n\nKylie Jenner can be seen when the new season of Keeping Up With the Kardashians begins airing next month.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/5001151/kylie-jenner-travis-scotts-friends-think-they-could-be-secretly-engaged-reports-hollywood-life", "title": "Kylie Jenner & Travis Scott’s Friends Think They Could Be Secretly Engaged, Reports ‘Hollywood Life’", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Kylie Jenner and Travis Scott have been sparking engagement rumors online, and now their friends allegedly believe they may be ready to walk down the aisle as well. According to a July 24 report by Hollywood Life, Kylie Jenner and Travis Scott&#8217;s close friends and family members believe that the couple, who share one daughter [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Kylie Jenner & Travis Scott’s Friends Think They Could Be Secretly Engaged, Reports ‘Hollywood Life’", "url": "https://www.inquisitr.com/5001151/kylie-jenner-travis-scotts-friends-think-they-could-be-secretly-engaged-reports-hollywood-life", "type": "article", "description": "Kylie Jenner and Travis Scott have been sparking engagement rumors online, and now their friends allegedly believe they may be ready to walk down the aisle as well. According to a July 24 report by Hollywood Life, Kylie Jenner and Travis Scott&#8217;s close friends and family members believe that the couple, who share one daughter [&hellip;]"}, "article": {"published_time": "2018-07-24T23:10:22", "modified_time": "2018-07-24T23:10:22", "author": "Amanda Lynne"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Kylie Jenner & Travis Scott’s Friends Think They Could Be Secretly Engaged, Reports ‘Hollywood Life’", "description": "Kylie Jenner and Travis Scott have been sparking engagement rumors online, and now their friends allegedly believe they may be ready to walk down the aisle as well. According to a July 24 report by Hollywood Life, Kylie Jenner and Travis Scott&#8217;s close friends and family members believe that the couple, who share one daughter [&hellip;]"}}, "movies": [], "publish_date": 1532463022.0, "source": "http://www.inquisitr.com", "summary": ""}