{"url": "https://www.hellomagazine.com/healthandbeauty/2018032347267/pink-daughter-willow-makeup-tutoial-video/", "text": "This might just be our favourite Instagram clip of ALL TIME. Pink's six-year-old daughter Willow has given her first ever makeup tutorial and it's too cute for words. The singer shared the clip with her followers and it's already got a 1.4million views. In the video we see Willow sitting at her dressing table with a mirror and sparkly vanity case. The little girl proceeds to test an array of products, and not in all the right places - we're talking blue eyeshadow under her eyes, lipstick on the chin, bronzer everywhere. It's hilarious! Pink captioned the clip: \"My little girl and her first makeup tutorial #backstage#rockstarintraining #likemamalikedaughter.\"\n\n© Photo: Instagram\n\nWillow's dad Carey Hart shared a photo of her recent makeup fun Photo credit: Instagram/ hartluck\n\nWillow is Pink's daughter with Carey Hart and she certainly looks to have inherited her parents' performing talents. We loved watching the fun clip, which sees their daughter start off with a touch of lippy and finish with all the colours on her face. Whose six-year-old would do this too given half the chance? Willow is so cute as she applies eyeliner to her eyebrows, goes crazy with the pink blush and puts glitter on her cheeks. Who know, perhaps the look will catch on.\n\nLOOK: Beyonce wows in killer vamp lipstick: get her gothic look\n\nThe singer's fans adored the tutorial, which Pink speeded up using the app's fast forward function. One follower wrote: \"Oh momma... I’m loving it! Now she just needs a little hair wrap and the old Barbie vanity light!! Just to keep her little instead of going with the grown up stuff!\" Another said: \"I love her creativity, it has flare that only a true artist can dream up. She is destined for a career doing make up artistry for the big screens. She's the future of female Academy award winners.\" One posted: \"She is SO cute!!? And she really does have talent about creativity!\"\n\nPink recently revealed she is raising her two children, Willow and one-year-old Jameson, as gender neutral. Speaking to the Sunday People about her young family, she explained: \"We are a very label-less household. Last week Willow told me she is going to marry an African woman. I was like: 'Great, can you teach me how to make African food?' And she's like, 'Sure mama, and we are going to live with you while our house is getting ready.'\"", "images": ["https://www.hellomagazine.com/apple-touch-icon-57x57.png", "https://images.hellomagazine.com/horizon/original_aspect_ratio/c5ebe109b939-willow-makeuo-z.jpg", "https://images.hellomagazine.com/horizon/square/f745bdf5bcad-header-tweakments-btl-2-1.jpg", "https://images.hellomagazine.com/horizon/square/e7fe1b79529b-111skin-party.jpg", "https://images.hellomagazine.com/horizon/square/0ab1c5fb9b0a-collagen-supplement-istock-1169073353.jpg", "https://images.hellomagazine.com/horizon/square/2c9f11209389-sophiehamilton.jpg"], "top_img": "https://www.hellomagazine.com/apple-touch-icon-57x57.png", "keywords": [], "authors": ["Sophie Hamilton", "Parenting Editor"], "canonical_link": "https://www.hellomagazine.com/healthandbeauty/2018032347267/pink-daughter-willow-makeup-tutoial-video/", "title": "Pink's six-year-old daughter gives her first ever makeup tutorial and it's adorable", "meta_data": {"viewport": "width=device-width", "title": "Watch Pink's daughter Willow give first makeup tutorial on Instagram | HELLO!", "description": "Pink's six year old daughter Willow has entertained fans with her first ever makeup tutorial, showing how to apply lipstick, eyeshadow and blusher. See the super cute clip", "robots": "max-image-preview:large", "plantilla": "Plantilla de noticias (plantilla-noticias.html)", "og": {"url": "https://www.hellomagazine.com/healthandbeauty/2018032347267/pink-daughter-willow-makeup-tutoial-video/", "title": "Pink's six-year-old daughter gives her first ever makeup tutorial and it's adorable", "description": "Little Willow was let loose with a makeup kit and look what happened", "updated_time": "2018-03-23T14:17:03.000Z", "article": {"author": "https://www.hellomagazine.com/author/sophie-hamilton/"}, "image": {"height": 675, "width": 1200}, "type": "article", "site_name": "HELLO!"}, "article": {"modified_time": "2018-03-23T14:17:03.000Z", "published_time": "2018-03-23T14:17:03.000Z", "section": "Beauty", "tag": "Article,Pink,Beauty Tips,Beauty", "publisher": "https://www.facebook.com/hello/"}, "fb": {"app_id": 115281558857295, "pages": 89982930077, "admins": 89982930077}, "twitter": {"card": "summary_large_image", "site": "@hellomag", "title": "Pink's six-year-old daughter gives her first ever makeup tutorial and it's adorable", "description": "Little Willow was let loose with a makeup kit and look what happened", "creator": "@hellomag", "url": "https://www.hellomagazine.com/healthandbeauty/2018032347267/pink-daughter-willow-makeup-tutoial-video/"}, "next-head-count": 34, "msapplication-TileColor": "#cc0000", "theme-color": "#ffffff"}, "movies": [], "publish_date": 1521814623.0, "source": "https://www.hellomagazine.com", "summary": ""}