{"url": "www.inquisitr.com/4977160/ariana-grande-did-not-cheat-on-pete-davidson-with-ex-boyfriend-big-sean-debunked/", "text": "Ariana Grande is currently engaged to Pete Davidson. The Dangerous Woman singer and her fiance have had a whirlwind romance and got engaged after only dating for a few weeks. However, according to tweets from her former boyfriend Big Sean’s Twitter account, the singer has been cheating on her boyfriend with him.\n\nAccording to a July 7 report by Gossip Cop, it seems that rapper Big Sean’s Twitter account was hacked over the weekend. The hacker posted a series of explicit comments, which included profanity and the n-word, before tweeting that Ariana Grande had been cheating on Pete Davidson with her ex-boyfriend the “whole time.”\n\nThe tweet started a firestorm among fans via Twitter. The rumors that Ariana had been cheating on Pete began to circulate and the tweet garnered over 5,000 retweets and 8,000 likes in only about 15 minutes. Fans were talking about the surprising post so much that “Big Sean” even became a trending topic on the social media site.\n\nIf fans only saw the one tweet from the rapper’s account it could look like a legitimate claim. However, those who bothered to go back and read all of Big Sean’s tweets could see that his account had been hacked, which is something that has happened to multiple celebrities in the past.\n\nAs previously reported by the Inquisitr, Ariana Grande and Pete Davidson shocked fans when they got engaged just a few weeks after they began dating. The couple has seemingly been inseparable since beginning their romance, and have been seen furniture shopping for their new apartment and even getting tattoos in honor of one another.\n\nHowever, it seems that not everyone is thrilled about the quick pace of Grande and Davidson’s romance. Sources previously told Radar Online that Ariana’s family believe that she is rushing into things with Pete and that the Saturday Night Live star may be using her to boost his own fame.\n\n“Of course everyone is happy for her but they are also super worried that she is going to get her heart ripped out. Everyone thinks that he is using her. “She is not listening to anyone and is shutting out anyone who tries to wish her anything but happiness and joy. The red flags are everywhere and Ariana refuses to see any of it,” an insider told the outlet.\n\nIt seems that Ariana Grande and Pete Davidson’s relationship has fans interested, and they may want to get used to their names making headlines as their romance continues.", "images": ["https://d15pn4sjte4r7g.cloudfront.net/v4/assets/inquisitr_cross.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/WhatsApp.png", "https://dab57h0r8ahff.cloudfront.net/v3/assets/search-icon.svg", "https://d6ehjqrqtzoun.cloudfront.net/share/mail.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/inquisitr-logo.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Twitter.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Copy+Link.png", "https://d6ehjqrqtzoun.cloudfront.net/share/Facebook.png", "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico"], "top_img": "https://d15pn4sjte4r7g.cloudfront.net/inquisitr/assets/favicon.ico", "keywords": [], "authors": ["Amanda Lynne"], "canonical_link": "https://www.inquisitr.com/4977160/ariana-grande-did-not-cheat-on-pete-davidson-with-ex-boyfriend-big-sean-debunked", "title": "Ariana Grande Did Not Cheat On Pete Davidson With Ex-Boyfriend Big Sean [Debunked]", "meta_data": {"viewport": "width=device-width,user-scalable=no", "robots": "max-snippet:-1, max-image-preview:large, max-video-preview:-1", "description": "Ariana Grande is currently engaged to Pete Davidson. The Dangerous Woman singer and her fiance have had a whirlwind romance and got engaged after only dating for a few weeks. However, according to tweets from her former boyfriend Big Sean&#8217;s Twitter account, the singer has been cheating on her boyfriend with him. According to a [&hellip;]", "keywords": "Sports,Entertainment", "og": {"locale": "en_US", "site_name": "The Inquisitr", "title": "Ariana Grande Did Not Cheat On Pete Davidson With Ex-Boyfriend Big Sean [Debunked]", "url": "https://www.inquisitr.com/4977160/ariana-grande-did-not-cheat-on-pete-davidson-with-ex-boyfriend-big-sean-debunked", "type": "article", "description": "Ariana Grande is currently engaged to Pete Davidson. The Dangerous Woman singer and her fiance have had a whirlwind romance and got engaged after only dating for a few weeks. However, according to tweets from her former boyfriend Big Sean&#8217;s Twitter account, the singer has been cheating on her boyfriend with him. According to a [&hellip;]"}, "article": {"published_time": "2018-07-08T21:41:27", "modified_time": "2018-07-08T21:41:27", "author": "Amanda Lynne"}, "twitter": {"site": "https://twitter.com/theinquisitr", "card": "summary_large_image", "title": "Ariana Grande Did Not Cheat On Pete Davidson With Ex-Boyfriend Big Sean [Debunked]", "description": "Ariana Grande is currently engaged to Pete Davidson. The Dangerous Woman singer and her fiance have had a whirlwind romance and got engaged after only dating for a few weeks. However, according to tweets from her former boyfriend Big Sean&#8217;s Twitter account, the singer has been cheating on her boyfriend with him. According to a [&hellip;]"}}, "movies": [], "publish_date": 1531075287.0, "source": "http://www.inquisitr.com", "summary": ""}