{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/kel-mitchell-net-worth/", "text": "Info Category: Richest Celebrities › Actors Net Worth: $500 Thousand Date of Birth: Aug 25, 1978 (45 years old) Place of Birth: Chicago Gender: Male Height: 5 ft 10 in (1.8 m) Profession: Actor, Comedian, Musician, Dancer, Film Producer, Screenwriter Nationality: United States of America 💰 Compare Kel Mitchell's Net Worth\n\nWhat is Kel Mitchell's Net Worth?\n\nKel Mitchell is an American actor, comedian, rapper, screenwriter, producer, parodist, dancer, and musician who has a net worth of $500 thousand. Kel Mitchell first became famous as one of the stars of the Nickelodeon sketch comedy show \"All That.\" He and future collaborator Keenan Thompson were both 15 when the show started in 1994. Kel remained on the show through 1999. Between 1996 and 2000, Keenan and Kel starred on a spinoff show that was appropriately called, \"Keenan & Kel,\" In 1997 the duo starred in the featured film \"Good Burger,\" which was based on a series of sketches from \"All That.\" Good Burger was surprisingly successful at the box office, earning $24 million on its budget of $8 million.\n\nKel has appeared in dozens of other films and TV shows. He was nominated for a daytime Emmy for his voice work as \"T-Bone\" on the animated series \"Clifford the Big Red Dog.\" In 2023 he and Keenan reunited to film \"Good Burger 2.:\n\nEarly Life\n\nKel Johari Rice Mitchell was born on August 25th of 1978 in Chicago, Illinois. While growing up on the South Side alongside two sisters, Kel Mitchell took drama classes as he attended high school.\n\nAll That & Kenan and Kel\n\nKel Mitchell first gained notoriety after appearing in All That, booking a main, recurring role from the first to the fifth season. The series won a number of awards and spawned various spin-offs and sequels. Kel Mitchell is known for his collaboration with Kenan Thompson, beginning with the series Kenan and Kel, which ran from 1996 to 2000. One sketch from All That also spawned an entire movie called Good Burger, which starred Kel Mitchell and Kenan Thompson once again. Both actors also appeared in shows like Sister, Sister, The Steve Harvey Show, Cousin Skeeter, and Sabrina, the Teenage Witch.\n\nOther Work\n\nIn 1999, Kel Mitchell played the Invisible Boy in Ben Stiller's superhero comedy Mystery Men. Even with a star-studded cast, Mystery Men received average reviews and proved to be a massive box office flop, generating just $33 million on a budget of $68 million.\n\nKel Mitchell is also known for his voice acting work, particularly in the series Clifford the Big Red Dog. In the series, he voiced the character of T-Bone. He also voiced the character of Dutch in Disney XD's Motorcity. Other roles during the 2000s included a co-hosting position in Dance 360 and appearances in One on One and BET's Take the Cake. In 2006, he appeared in the Like Mike sequel, Like Mike 2: Streetball.\n\nAfter a rumor spread on MySpace claiming that Kel Mitchell had died, the actor took a role in the 2007 film Honeydripper. He then wrote and produced the film Dance Fu before appearing in various Detroit-based stage productions. Kel Mitchell gained further notoriety for his appearances in G4's Attack of the Show!\n\nKel Mitchell continued to appear in children's shows throughout his career, most notably booking a recurring role in PBS's Curious George and a guest role in Nickelodeon's Sam & Cat. Mitchell also appeared as a rapper in the Nickelodeon sitcom Game Shakers. In addition, he has appeared in shows such as The Tonight Show with Jimmy Fallon, Double Dare, and Dancing with the Stars.\n\nKel Mitchell currently hosts Tails of Valor, a show that looks at the real stories of service animals that help people in need. Mitchell is also an executive producer for the reboot of All That, which debuted in 2019, booking a recurring role on the show as well.\n\nRelationships\n\nIn 1999, Kel Mitchell married Tyisha Hampton-Mitchell, although they divorced in 2005. Kel Mitchell then married rapper Asia Lee in 2012, and the couple later had a child together. Mitchell and his wife later won an award for their show, The Back House Party.\n\nPersonal Life\n\nKel Mitchell is a Christian, although he didn't convert until later in life. He is also a spokesperson for the Black College Expo and acts as a youth pastor for the Spirit Food Christian Center.", "images": ["https://vz.cnwimg.com/thumb-400x400/wp-content/uploads/2011/08/Kel-Mitchell.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/05/kim-fields2.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2010/05/Bill+Bellamy+UNICEF+Playlist+List+Celebrity+HDu6FoxIToNl.jpg", "https://vz.cnwimg.com/wp-content/uploads/2011/08/Kel-Mitchell.jpg?x81397", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2011/01/Kenan-Thompson.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2012/08/GettyImages-481426755.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2011/08/Kel-Mitchell.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/kel-mitchell-net-worth/", "title": "Kel Mitchell Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Kel Mitchell Net Worth: Kel Mitchell is an American actor, comedian, rapper, screenwriter, producer, parodist, dancer, and musician who has a net worth of $500 thousand.", "slick": {"wpversion": "1.4.0", "wppostid": 20272, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2011/08/Kel-Mitchell.jpg?x81397", "group": "post", "category": "actors:Actors;richest-celebrities:Richest Celebrities"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Kel Mitchell Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/kel-mitchell-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/08/Kel-Mitchell.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Kel Mitchell's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2023-11-09T17:50:13+00:00", "published_time": "2020-05-24T08:24:13+00:00", "section": "Actors", "tag": "Kel Mitchell salary"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/08/Kel-Mitchell.jpg?x81397", "title": "Kel Mitchell Net Worth", "description": "Kel Mitchell Net Worth: Kel Mitchell is an American actor, comedian, rapper, screenwriter, producer, parodist, dancer, and musician who has a net worth of $500 thousand."}}, "movies": [], "publish_date": 1590308653.0, "source": "https://www.celebritynetworth.com", "summary": ""}