{"url": "https://web.archive.org/web/20170506031425/http://www.today.com/style/jennifer-lawrence-has-bangs-see-her-new-hairstyle-t111217", "text": "share tweet pin email\n\nOne of our favorite style icons is giving us major hair inspiration. Jennifer Lawrence has changed up her hair yet again and added bangs!\n\nThe 26-year-old was recently spotted rocking some chic, blunt bangs on the set of her upcoming film \"Red Sparrow.\"\n\nFlynet Pictures via Splash News It's been quite some time since we've seen Lawrence rock bangs.\n\nWhile the new 'do is likely for her role as a Russian spy in the film, we aren't sure if it's wig or an actual chop. She looks so fabulous that we're hoping this fringe is here to stay.\n\nClosed Captioning ON OFF apply | reset x Text Display\n\nBackground\n\nEnhancements font\n\nTimes New Roman Arial Comic Sans\n\nT T T T size\n\n\n\ncolor share link Do Jennifer Lawrence and Helen Mirren look alike? Play Video - 1:39 Do Jennifer Lawrence and Helen Mirren look alike? Play Video - 1:39\n\nLawrence is no stranger to changing up her 'do. From bobs to pixies to even different types of bangs, she's tried it all.\n\nWhile the actress has been a blonde for most of her career, in May 2016, she stepped out with platinum locks that created instant summer hair color inspiration.\n\nJeff Spicer / Getty Images This ultra icy hue was a first for Lawrence.\n\nThis flirty bob looks inspired by flapper girls in the '20s.\n\nStuart C. Wilson / Getty Images Lawrence opted for a bob as she grew out her pixie.\n\nThis haircut was the result of her grown-out pixie — but the slicked-back style really works for her.\n\nJason Merritt / Getty Images Lawrence slicked back her growing pixie for the Oscars in 2014.\n\nShe made the chop into a pixie in 2013 after explaining that her hair was fried from being overprocessed.\n\nFrazer Harrison / Getty Images Lawrence showed off her bold pixie in 2013.\n\nMonths before making the big cut, Lawrence had cascading, light brown tresses, which made it even more shocking when she went for such a drastic and dramatic look.\n\nFrederick M. Brown / Getty Images Months before chopping her hair into a pixie, Lawrence had long, glamorous tresses.\n\nBut that wasn't the darkest hair color she's had. In 2012, she had chestnut brown locks and a completely different look.\n\nJason Merritt / Getty Images It's hard to even recognize Lawrence with these super dark locks.\n\nAnd then there was the period in 2012 when she had blunt bangs and strawberry blond hair.\n\nDimitrios Kambouris / Getty Images This isn't the first time Lawrence has tried bangs, as seen here at a screening of \"The Hunger Games\" in 2012.\n\nBefore that, in 2010 when her career was just beginning to kick off, she really looked like the girl next door with these soft curls.\n\nDimitrios Kambouris / WireImage This is the curliest we've seen Lawrence's hair.\n\nShort or long, dark or blonde, bangs or no bangs, it seems like Lawrence can rock any hairstyle.\n\nWhat will she try next?\n\nSlideshow Photos Getty Images See Jennifer Lawrence's red carpet evolution See Jennifer Lawrence's red carpet evolution of 2007 Movieguide Faith and Values Awards In one of her earliest red carpet appearances, JLaw rocks a funky short dress with a hint of tulle. WireImage\n\nSee Jennifer Lawrence's red carpet evolution of 2008 \"The Burning Plain\" Premiere Lawrence shows a touch more sophistication with a silky blue ensemble and a choker-style necklace. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2008 Venice Film Festival She totally steps up her style game in late 2008, stepping out at the 65th Venice Film Festival in a stunning silver gown. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 16th Annual Critics' Choice Movie Awards - Arrivals Lawrence steals the spotlight in this glittering ombré cocktail dress. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 17th Annual Screen Actors Guild Awards - Red Carpet She shows a bit more skin with a thigh-high slit and shoulder-baring sleeves at the 2011 SAG Awards. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2011 British Academy Film Awards A dash of Parisian charm and a splash of Old West romance makes this look an unforgettable one. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2011 Academy Awards Chic, sleek and simple: Jenifer Lawrence manages to upgrade the classic tank dress into a red carpet-worthy look. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2012 People's Choice Awards Lawrence poses with panache in a daring mesh number. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of Premiere Of Liongate's \"The Hunger Games\" - Arrivals Golden girl! Lawrence wows in a shimmering lamé gown. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2012 Toronto International Film Festival Her dark locks and deep maroon dress exude a sort of Gothic watercolor feeling. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2012 \"Silver Linings Playbook\" New York Premiere Lawrence shows off her high-fashion flair in a Dior pantsuit. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 Critics' Choice Movie Awards She reveals just the right amount of skin to makes a statement in this sweeping black gown. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 70th Annual Golden Globe Awards This belted bodice is the perfect detail to finish off her enviable silhouette. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 Film Independent Spirit Awards Not your average LBD! JLaw steps out in this rather edgy number. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 85th Annual Academy Awards - Arrivals Lawrence stuns at the 2013 Oscars in a dramatic Dior Couture dream. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 Costume Institute Gala Isn’t she just the prettiest punk around? Lawrence dons a black a-line dress for the 2013 Costume Institute Gala. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 Cannes Film Festival JLaw taught us a valuable lesson in 2013: You can never go wrong with color-blocking. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 \"The Hunger Games: Catching Fire\" Premiere Rome When in Rome! Lawrence confidently walks in a voluminous origami-inspired dress with an asymmetrical neckline. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 \"The Hunger Games: Catching Fire\" Paris Premiere From good girl to rebel with a cause, she completely changes up her look just one day later by pairing a black risqué Dior number with a dark plum lip. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2013 \"The Hunger Games: Catching Fire\" Los Angeles Premiere So many gowns, so little time! At yet another press tour event, Lawrence shows some serious skin in this sheer bodysuit-slash-dress. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 71st Annual Golden Globe Awards - Arrivals One of her less praised style moments, we can’t help but admire the woman under the dress anyhow. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2014 Oscar Awards Jennifer Lawrence is red-hot in this strapless Dior dress that screams “Old Hollywood.” Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2014 Vanity Fair Oscar Party Mirror mirror on the wall, JLaw’s the fairest of them all. She shows some leg in this sparkly mini. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of Premiere Of Lionsgate's \"The Hunger Games: Mockingjay - Part 1\" - Arrivals A striking, illusory silhouette makes this dress a hit. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 26th Annual Producers Guild Of America Awards - Arrivals Lawrence dazzles in this regal, pale peach gown. The extra length adds extra drama. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2015 Costume Institute Gala As co-chair of the 2015 Met Gala, Lawrence perfectly embodies the event's \"China: Through the Looking Glass\" theme with a delicate floral bralette dress and chic topknot. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of 2015 \"The Hunger Games: Mockingjay - Part 2\" Berlin Premiere She looks nothing short of extravagant in this royal plum gown with a plunging neckline. Getty Images\n\nSee Jennifer Lawrence's red carpet evolution of Image: UK Premiere of The Hunger Games: Mockingjay - Part 2 One of our favorite looks, this delicately daring cut-out dress must have turned heads. EPA\n\nSee Jennifer Lawrence's red carpet evolution of Image: Jennifer Lawrence Lawrence poses in a ruffled, tiered black gown that doesn’t skimp on the drama factor. AP\n\nSee Jennifer Lawrence's red carpet evolution of 2015 \"The Hunger Games: Mockingjay - Part 2\" Los Angeles Premiere Jennifer Lawrence graces the red carpet in a floor-length white gown with gold detailing. It's hard to deny how angelic she looks! AP\n\nRELATED:", "images": ["https://web.archive.org/web/20170506031425im_/https://media2.s-nbcnews.com/j/newscms/2017_18/1212525/jennifer-lawrence-bangs-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/http://media2.s-nbcnews.com/i/newscms/2017_18/1212552/jennifer-lawrence-today-170505-tease_86ed5d163f1df1eba548c3f2d36b4a00.jpg", "https://web.archive.org/web/20170506031425im_/https://media1.s-nbcnews.com/j/newscms/2016_01/925116/ss-jennifer-lawrence-style-160106-tease2_1cb0455a0fc427f245a018bf0b0dc59c.today-ss-slide-desktop.jpg", "https://web.archive.org/web/20170506031425im_/https://media4.s-nbcnews.com/j/newscms/2017_18/1212532/jennifer-lawrence-2014-03-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/https://media2.s-nbcnews.com/j/MSNBC/Components/Video/150310/tdy_tren_celebs_150310.today-inline-vid-featured-desktop.jpg", "https://web.archive.org/web/20170506031425im_/https://media1.s-nbcnews.com/j/newscms/2017_18/1212528/jennifer-lawrence-2016-03-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/https://media3.s-nbcnews.com/j/newscms/2017_18/1212540/jennifer-lawrence-2010-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/https://media4.s-nbcnews.com/j/newscms/2015_24/624031/jordan_204b4ba942d3a010e9bb449762d751bc.today-byline.jpg", "https://web.archive.org/web/20170506031425im_/https://media4.s-nbcnews.com/j/newscms/2017_18/1212530/jennifer-lawrence-2014-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/http://c.betrad.com/pub/icon1.png", "https://web.archive.org/web/20170506031425im_/https://media1.s-nbcnews.com/j/newscms/2017_18/1212537/jennifer-lawrence-2013-02-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/https://media4.s-nbcnews.com/j/newscms/2017_18/1212538/jennifer-lawrence-2012-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/http://www.today.com/style/jennifer-lawrence-has-bangs-see-her-new-hairstyle-t111217", "https://web.archive.org/web/20170506031425im_/https://media1.s-nbcnews.com/j/newscms/2017_18/1212535/jennifer-lawrence-2013-04-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg", "https://web.archive.org/web/20170506031425im_/https://c.betrad.com/pub/icon1.png", "https://web.archive.org/web/20170506031425im_/https://nodeassets.today.com/cdnassets/today-images/tdy-header-logo.png", "https://web.archive.org/web/20170506031425im_/https://media2.s-nbcnews.com/j/newscms/2017_18/1212539/jennifer-lawrence-2012-02-today-170505_898c2e89d6538a5cdd18455d3799e308.today-inline-large.jpg"], "top_img": "https://web.archive.org/web/20170506031425im_/http://media2.s-nbcnews.com/i/newscms/2017_18/1212552/jennifer-lawrence-today-170505-tease_86ed5d163f1df1eba548c3f2d36b4a00.jpg", "keywords": [], "authors": ["Jordan Muto"], "canonical_link": "https://web.archive.org/web/20170506031425/http://www.today.com/style/jennifer-lawrence-has-bangs-see-her-new-hairstyle-t111217", "title": "Jennifer Lawrence has bangs — see her new hairstyle", "meta_data": {"viewport": "width=device-width initial-scale=1 maximum-scale=1 user-scalable=no", "msvalidate.01": "43434ADDF3F60D7897F819F388E2FADF", "author": "Jordan Muto", "og": {"description": "Jennifer Lawrence stepped out with a new hairstyle.", "title": "Jennifer Lawrence has a brand new look — bangs!", "site_name": "TODAY.com", "type": "article", "image": "https://web.archive.org/web/20170506031425im_/http://media2.s-nbcnews.com/i/newscms/2017_18/1212552/jennifer-lawrence-today-170505-tease_86ed5d163f1df1eba548c3f2d36b4a00.jpg", "url": "https://web.archive.org/web/20170506031425/http://www.today.com/style/jennifer-lawrence-has-bangs-see-her-new-hairstyle-t111217"}, "description": "Jennifer Lawrence stepped out with a new hairstyle.", "twitter": {"title": "Jennifer Lawrence has a brand new look — bangs!", "card": "summary_large_image", "site": "@TodayShow", "description": "Jennifer Lawrence stepped out with a new hairstyle.", "creator": "@TodayShow", "domain": "TODAY.com", "image": {"src": "http://media2.s-nbcnews.com/j/newscms/2017_18/1212552/jennifer-lawrence-today-170505-tease_86ed5d163f1df1eba548c3f2d36b4a00.today-inline-vid-featured-desktop.jpg"}}, "fb": {"app_id": 122384521533, "admins": 100001657893615, "pages": 12566691349}, "news_keywords": "Trending,Style,Pop Culture,Hair,Celeb style,Beauty", "google-site-verification": "uDRXhvw8LRHhorJhIUmXCkUPjqGebM6KFh9jZGwH6VA", "DC.date.issued": "2017-05-05T21:22:00.000Z", "apple-itunes-app": "app-id=416357699, affiliate-data=ct=todaycom_sb&pt=211554, app-argument=http://www.today.com/style/jennifer-lawrence-has-bangs-see-her-new-hairstyle-t111217"}, "movies": [], "publish_date": null, "source": "https://web.archive.org", "summary": ""}