{"url": "https://www.celebritynetworth.com/richest-celebrities/actors/ashley-greene-net-worth/", "text": "Info Category: Richest Celebrities › Actors Net Worth: $8 Million Date of Birth: Feb 21, 1987 (36 years old) Place of Birth: Jacksonville Gender: Female Height: 5 ft 4 in (1.65 m) Profession: Actor, Model Nationality: United States of America 💰 Compare Ashley Greene's Net Worth\n\nWhat is Ashley Greene's Net Worth?\n\nAshley Greene is an American actress and model who has a net worth of $8 million. Ashley Greene is best known for playing the character Alice Cullen in the \"Twilight\" film series. Her other film credits have included \"Butter,\" \"The Apparition,\" \"Kristy,\" \"Bombshell,\" and \"Aftermath.\" On television, Greene had recurring roles on \"Desire\" and \"Pan Am,\" as well as a main role in seasons three and four of the police drama series \"Rogue.\"\n\nEarly Life\n\nAshley Greene was born on February 21, 1987 in Jacksonville, Florida to Joe, a former US Marine who owns a concrete business, and Michele, who works in insurance. As a youth, she went to University Christian School before transferring to Wolfson High School as a sophomore. At the age of 17, Greene graduated early and moved to Los Angeles, California to pursue a career in acting.\n\nCareer Beginnings\n\nGreene made her television debut in 2006, appearing in an episode of the crime drama series \"Crossing Jordan.\" The same year, she made a guest appearance on the sketch comedy series \"Mad TV,\" and had a recurring role on the American telenovela \"Desire.\" In 2007, Greene debuted on the big screen with a bit part in the dramedy film \"King of California,\" starring Michael Douglas and Evan Rachel Wood.\n\nFilm Career\n\nIn 2008, Greene had her breakthrough role in the romantic fantasy film \"Twilight,\" based on the first in the series of eponymous books by author Stephenie Meyer. She played the clairvoyant Alice Cullen, the adopted daughter of Esme and Carlisle Cullen. Greene went on to reprise her role in the film's four hit sequels: \"The Twilight Saga: New Moon,\" \"The Twilight Saga: Eclipse,\" \"The Twilight Saga: Breaking Dawn – Part 1,\" and \"The Twilight Saga: Breaking Dawn – Part 2.\" The actress appeared in a number of other movies during this time. In 2009, she was in the independent dramedy \"Shrink\" and the Canadian horror film \"Summer's Blood.\" The next year, Greene starred in the independent drama \"Skateland\" and had a supporting role in the dystopian science-fiction film \"Radio Free Albemuth,\" adapted from Philip K. Dick's posthumously released novel of the same name. Greene's subsequent credits were the romantic sports drama \"A Warrior's Heart,\" costarring her \"Twilight\" cast mate Kellan Lutz; the ensemble comedy \"Butter\"; the teen romantic dramedy \"LOL,\" costarring Miley Cyrus and Demi Moore; and the supernatural horror film \"The Apparition,\" with Sebastian Stan and Tom Felton.\n\nGreene's first film credit after the conclusion of the \"Twilight\" series was 2013's \"CBGB,\" a biographical drama about the eponymous former New York City music venue. Following this, Greene had starring roles in three 2014 films: Zach Braff's dramedy \"Wish I Was Here,\" the horror thriller \"Kristy,\" and the zombie comedy \"Burying the Ex.\" Greene's subsequent credits were the comedy \"Staten Island Summer,\" the crime drama \"Shangri-La Suite,\" the thriller \"Urge,\" and the ensemble drama \"In Dubious Battle,\" which was loosely based on the John Steinbeck novel. In 2018, Greene had roles in \"Accident Man\" and \"Antiquities,\" and in 2019, portrayed television personality Abby Huntsman in the biographical drama \"Bombshell.\" She had her next leading role in 2021, starring in the Netflix streaming thriller \"Aftermath.\"\n\nTelevision Career\n\nIn 2008, the same year she had her film breakthrough in \"Twilight,\" Greene was in an episode of the CBS legal drama series \"Shark.\" She had a bigger role from 2011 to 2012, when she played the recurring character Amanda Mason on the period drama series \"Pan Am.\" Later, in 2016, Greene landed her first main role on a television series on the police drama \"Rogue,\" costarring Thandiwe Newton, Sara Jeffery, Derek Luke, and Sarah Carter, among others. On the show, Greene played Mia Rochland in the final two seasons. She followed this up with roles in the television films \"Christmas on My Mind\" and \"The Charm Bracelet.\"\n\nModeling\n\nAs a model, Greene appeared naked in a body-painted bikini in advertisements for the beverage brand SoBe; these ads were featured in the 2010 issue of the Sports Illustrated Swimsuit Edition. That same year, she won the Style Icon Award at the Young Hollywood Awards.\n\nOther Media\n\nGreene has made appearances in a variety of other media beyond film and television. In 2005, she was in the music video for the promotional single \"Lyudi Invalidy\" by the Russian duo \"t.A.T.u.\" A decade later, Greene voiced the characters of Barbara Joan Gordon and Batgirl in the action-adventure video game \"Batman: Arkham Knight.\" In 2019, she played the recurring role of Nine Sanders in the second season of the web series \"Step Up: High Water,\" based on the \"Step Up\" series of films.\n\nPersonal Life\n\nIn December of 2016, Greene got engaged to Australian-Lebanese television personality Paul Khoury; the two later married in July of 2018 in San Jose, California. Prior to this relationship, Greene had dated singer-songwriter Joe Jonas.\n\nAs a native Floridian, Greene is an avid fan of the Florida Gators.", "images": ["https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2017/02/Christopher-Heyerdahl.jpg", "data:image/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==", "https://vz.cnwimg.com/wp-content/themes/cnw_2023/svg/logo.svg", "https://vz.cnwimg.com/thumb-600x300/wp-content/uploads/2011/04/Ashley-Greene-1.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2015/02/GettyImages-830899396.jpg", "https://www.facebook.com/tr?id=1471602713096627&ev=NoScript", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2019/03/mw.jpg", "https://vz.cnwimg.com/wp-content/uploads/2011/04/Ashley-Greene-1.jpg?x81397", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2010/03/Kellan-Lutz.jpg", "https://vz.cnwimg.com/thumb-132x132/wp-content/uploads/2013/04/Taylor-Swift.jpg", "https://b.scorecardresearch.com/p?c1=2&c2=7516694&cv=2.0&cj=1"], "top_img": "https://vz.cnwimg.com/wp-content/uploads/2011/04/Ashley-Greene-1.jpg?x81397", "keywords": [], "authors": [], "canonical_link": "https://www.celebritynetworth.com/richest-celebrities/actors/ashley-greene-net-worth/", "title": "Ashley Greene Net Worth", "meta_data": {"viewport": "width=device-width, initial-scale=1.0", "robots": "index, follow, max-image-preview:large, max-snippet:-1, max-video-preview:-1", "description": "Ashley Greene is an American actress and model who has a net worth of $8 million. Ashley Greene is best known for playing the character Alice Cullen in the “Twilight” film series.", "slick": {"wpversion": "1.4.0", "wppostid": 15464, "featured_image": "https://vz.cnwimg.com/wp-content/uploads/2011/04/Ashley-Greene-1.jpg?x81397", "group": "post", "category": "actors:Actors;richest-celebrities:Richest Celebrities"}, "apple-mobile-web-app-title": "Celebrity Net Worth", "application-name": "Celebrity Net Worth", "msapplication-TileColor": "#603cba", "msapplication-config": "https://www.celebritynetworth.com/wp-content/themes/cnw_2023/images/favicons_202304/browserconfig.xml", "theme-color": "#152934", "fb": {"app_id": 241750049176605, "admins": 194602255, "pages": 135556409817901}, "og": {"locale": "en_US", "title": "Ashley Greene Net Worth", "type": "article", "url": "https://www.celebritynetworth.com/richest-celebrities/actors/ashley-greene-net-worth/", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/04/Ashley-Greene-1.jpg?x81397", "site_name": "Celebrity Net Worth", "description": "What is Ashley Greene's net worth?"}, "article": {"publisher": "https://www.facebook.com/CelebrityNetWorth", "modified_time": "2022-01-20T15:39:05+00:00", "published_time": "2021-12-11T08:37:37+00:00", "section": "Actors", "tag": "Ashley Greene worth"}, "twitter": {"card": "summary_large_image", "site": "@celebnetworth", "image": "https://vz.cnwimg.com/wp-content/uploads/2011/04/Ashley-Greene-1.jpg?x81397", "title": "Ashley Greene Net Worth", "description": "Ashley Greene is an American actress and model who has a net worth of $8 million. Ashley Greene is best known for playing the character Alice Cullen in the \"Twilight\" film series."}}, "movies": [], "publish_date": 1639211857.0, "source": "https://www.celebritynetworth.com", "summary": ""}